Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/**
* @brief SYSCFG Registers
*/
typedef struct
{
   __IO uint32_t CFGR[5];          /*!< SYSCFG configuration register,   Address offset: 0x00 ~ 0x13 */
   __IO uint32_t EXTICR[4];        /*!< SYSCFG external interrupt configuration registers,   Address offset: 0x14-0x23 */
   __IO uint32_t PAENS;            /*!< SYSCFG desc PAENS,   Address offset: 0x24 */
   __IO uint32_t PBENS;            /*!< SYSCFG desc PBENS,   Address offset: 0x28 */
   __IO uint32_t PCENS;            /*!< SYSCFG desc PCENS,   Address offset: 0x2C */
   __IO uint32_t PDENS;            /*!< SYSCFG desc PDENS,   Address offset: 0x30 */
   __IO uint32_t PEENS;            /*!< SYSCFG desc PEENS,   Address offset: 0x34 */
   __IO uint32_t PFENS;            /*!< SYSCFG desc PFENS,   Address offset: 0x38 */
   __IO uint32_t RESERVED1;         
   __IO uint32_t PAANA2ENR;        /*!< PA ANA2ENR Register,                Address offset: 0x40  */
   __IO uint32_t PBANA2ENR;        /*!< PB ANA2ENR Register,                Address offset: 0x44  */
   __IO uint32_t PCANA2ENR;        /*!< PC ANA2ENR Register,                Address offset: 0x48  */
   __IO uint32_t PDANA2ENR;        /*!< PD ANA2ENR Register,                Address offset: 0x4C  */
   __IO uint32_t PEANA2ENR;        /*!< PE ANA2ENR Register,                Address offset: 0x50  */
   __IO uint32_t PVDINANA2ENR;     /*!< PVDIN ANA2ENR Register,             Address offset: 0x54  */
   __IO uint32_t RESERVED2[6];          
   __IO uint32_t SCSR;             /*!< SYSCFG SCSR Register,               Address offset: 0x70  */
   __IO uint32_t SWPR;             /*!< SYSCFG SWPR Register,               Address offset: 0x74  */
   __IO uint32_t SKR;              /*!< SYSCFG SKR Register,                Address offset: 0x78  */
}SYSCFG_TypeDef;

/**
* @brief TIM Registers
*/
typedef struct
{
    __IO uint32_t CR1;         /*!< TIM desc CR1,          Address offset: 0x00 */
    __IO uint32_t CR2;         /*!< TIM desc CR2,          Address offset: 0x04 */
    __IO uint32_t SMCR;        /*!< TIM desc SMCR,         Address offset: 0x08 */
    __IO uint32_t DIER;        /*!< TIM desc DIER,         Address offset: 0x0C */
    __IO uint32_t SR;          /*!< TIM desc SR,           Address offset: 0x10 */
    __IO uint32_t EGR;         /*!< TIM desc EGR,          Address offset: 0x14 */
    __IO uint32_t CCMR1;       /*!< TIM desc CCMR1:OUTPUT, Address offset: 0x18 */
    __IO uint32_t CCMR2;       /*!< TIM desc CCMR2:OUTPUT, Address offset: 0x1C */
    __IO uint32_t CCER;        /*!< TIM desc CCER,         Address offset: 0x20 */
    __IO uint32_t CNT;         /*!< TIM desc CNT,          Address offset: 0x24 */
    __IO uint32_t PSC;         /*!< TIM desc PSC,          Address offset: 0x28 */
    __IO uint32_t ARR;         /*!< TIM desc ARR,          Address offset: 0x2C */
    __IO uint32_t RCR;         /*!< TIM desc RCR,          Address offset: 0x30 */
    __IO uint32_t CCR1;        /*!< TIM desc CCR1,         Address offset: 0x34 */
    __IO uint32_t CCR2;        /*!< TIM desc CCR2,         Address offset: 0x38 */
    __IO uint32_t CCR3;        /*!< TIM desc CCR3,         Address offset: 0x3C */
    __IO uint32_t CCR4;        /*!< TIM desc CCR4,         Address offset: 0x40 */
    __IO uint32_t BDTR;        /*!< TIM desc BDTR,         Address offset: 0x44 */
    __IO uint32_t CCR5;        /*!< TIM desc CCR5,         Address offset: 0x48 */
    __IO uint32_t CCR6;        /*!< TIM desc CCR6,         Address offset: 0x4C */
    __IO uint32_t CCMR3;       /*!< TIM desc CCMR3:OUTPUT, Address offset: 0x50 */
    __IO uint32_t DTR2;        /*!< TIM desc DTR,          Address offset: 0x54 */
    __IO uint32_t ECR;         /*!< TIM desc ECR,          Address offset: 0x58 */
    __IO uint32_t TISEL;       /*!< TIM desc TISEL,        Address offset: 0x5C */
    __IO uint32_t AF1;         /*!< TIM AF1 Register,      Address offset: 0x60 */
    __IO uint32_t AF2;         /*!< TIM AF2 Register,      Address offset: 0x64 */
    __IO uint32_t OR1;         /*!< TIM OR1 Register,      Address offset: 0x68 */
         uint32_t RESERVED0[220];/*!< Reserved,              Address offset: 0x6C */
    __IO uint32_t DCR;         /*!< TIM desc DCR,          Address offset: 0x3DC */
    __IO uint32_t DMAR;        /*!< TIM desc DMAR,         Address offset: 0x3E0 */
}TIM_TypeDef;

/**
* @brief USART Registers
*/
typedef struct
{
   __IO uint32_t SR;               /*!< USART SR Register,                  Address offset: 0x00  */
   __IO uint32_t DR;               /*!< USART DR Register,                  Address offset: 0x04  */
   __IO uint32_t BRR;              /*!< USART BRR Register,                 Address offset: 0x08  */
   __IO uint32_t CR1;              /*!< USART CR1 Register,                 Address offset: 0x0C  */
   __IO uint32_t CR2;              /*!< USART CR2 Register,                 Address offset: 0x10  */
   __IO uint32_t CR3;              /*!< USART CR3 Register,                 Address offset: 0x14  */
   __IO uint32_t GTPR;             /*!< USART GTPR Register,                Address offset: 0x18  */
   __IO uint32_t RTOR;             /*!< USART RTOR Register,                Address offset: 0x1C  */
} USART_TypeDef;



/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */
typedef struct
{
  __IO uint32_t DR;          /*!< UART DR Register,           Address offset: 0x00  */
  __IO uint32_t BRR;         /*!< UART BRR register,          Address offset: 0x04  */
  __IO uint32_t RESERVED1[2];   
  __IO uint32_t SR;          /*!< UART SR  register 2,        Address offset: 0x10  */
  __IO uint32_t CR1;         /*!< UART Control register 1,    Address offset: 0x14  */
  __IO uint32_t CR2;         /*!< UART Control register 2,    Address offset: 0x18  */
  __IO uint32_t CR3;         /*!< UART Control register 3,    Address offset: 0x1C  */
  __IO uint32_t RAR;         /*!< UART RAR register,          Address offset: 0x20  */
  __IO uint32_t TAR;         /*!< UART TAR register,          Address offset: 0x24  */
  __IO uint32_t BRRF;        /*!< UART BRRF register,         Address offset: 0x28  */
} UART_TypeDef;

/**
* @brief LPUART Registers
*/
typedef struct
{
   __IO uint32_t CR1;              /*!< LPUART CR1 Register,                Address offset: 0x00  */
   __IO uint32_t CR2;              /*!< LPUART CR2 Register,                Address offset: 0x04  */
   __IO uint32_t CR3;              /*!< LPUART CR3 Register,                Address offset: 0x08  */
   __IO uint32_t BRR;              /*!< LPUART BRR Register,                Address offset: 0x0C  */
   __IO uint32_t RESERVED1[2];      
   __IO uint32_t RQR;              /*!< LPUART RQR Register,                Address offset: 0x18  */
   __IO uint32_t ISR;              /*!< LPUART ISR Register,                Address offset: 0x1C  */
   __IO uint32_t ICR;              /*!< LPUART ICR Register,                Address offset: 0x20  */
   __IO uint32_t RDR;              /*!< LPUART RDR Register,                Address offset: 0x24  */
   __IO uint32_t TDR;              /*!< LPUART TDR Register,                Address offset: 0x28  */
   __IO uint32_t PRESC;            /*!< LPUART PRESC Register,              Address offset: 0x2C  */
} LPUART_TypeDef;


/** 
  * @brief __USB_OTG_Core_register
  */

typedef struct
{
  __IO uint32_t GOTGCTL;              /*!<  USB_OTG Control and Status Register       Address offset: 000h */
  __IO uint32_t GOTGINT;              /*!<  USB_OTG Interrupt Register                Address offset: 004h */
  __IO uint32_t GAHBCFG;              /*!<  Core AHB Configuration Register           Address offset: 008h */
  __IO uint32_t GUSBCFG;              /*!<  Core USB Configuration Register           Address offset: 00Ch */
  __IO uint32_t GRSTCTL;              /*!<  Core Reset Register                       Address offset: 010h */
  __IO uint32_t GINTSTS;              /*!<  Core Interrupt Register                   Address offset: 014h */
  __IO uint32_t GINTMSK;              /*!<  Core Interrupt Mask Register              Address offset: 018h */
  __IO uint32_t GRXSTSR;              /*!<  Receive Sts Q Read Register               Address offset: 01Ch */
  __IO uint32_t GRXSTSP;              /*!<  Receive Sts Q Read & POP Register         Address offset: 020h */
  __IO uint32_t GRXFSIZ;              /*!< Receive FIFO Size Register                 Address offset: 024h */
  __IO uint32_t DIEPTXF0_HNPTXFSIZ;   /*!<  EP0 / Non Periodic Tx FIFO Size Register  Address offset: 028h */
  __IO uint32_t HNPTXSTS;             /*!<  Non Periodic Tx FIFO/Queue Sts reg        Address offset: 02Ch */
  uint32_t Reserved30[2];             /*!< Reserved 030h*/
  __IO uint32_t GCCFG;                /*!< General Purpose IO Register                Address offset: 038h */
  __IO uint32_t CID;                  /*!< User ID Register                           Address offset: 03Ch */
  uint32_t  Reserved40[48];           /*!< Reserved 040h-0FFh */
  __IO uint32_t HPTXFSIZ;             /*!< Host Periodic Tx FIFO Size Reg             Address offset: 100h */
  __IO uint32_t DIEPTXF[0x0F];        /*!< dev Periodic Transmit FIFO                 Address offset: 0x104 */
} USB_OTG_GlobalTypeDef;

/** 
  * @brief __device_Registers
  */

typedef struct 
{
  __IO uint32_t DCFG;                 /*!< dev Configuration Register                 Address offset: 800h*/
  __IO uint32_t DCTL;                 /*!< dev Control Register                       Address offset: 804h*/
  __IO uint32_t DSTS;                 /*!< dev Status Register (RO)                   Address offset: 808h*/
  uint32_t Reserved0C;                /*!< Reserved 80Ch*/
  __IO uint32_t DIEPMSK;              /*!< dev IN Endpoint Mask                       Address offset: 810h*/
  __IO uint32_t DOEPMSK;              /*!< dev OUT Endpoint Mask                      Address offset: 814h*/
  __IO uint32_t DAINT;                /*!< dev All Endpoints Itr Reg                  Address offset: 818h*/
  __IO uint32_t DAINTMSK;             /*!< dev All Endpoints Itr Mask                 Address offset: 81Ch*/
  uint32_t Reserved20;                /*!< Reserved 820h                                                  */
  uint32_t Reserved9;                 /*!< Reserved 824h                                                  */
  __IO uint32_t DVBUSDIS;             /*!< dev VBUS discharge Register                Address offset: 828h*/
  __IO uint32_t DVBUSPULSE;           /*!< dev VBUS Pulse Register                    Address offset: 82Ch*/
  uint32_t Reserved;                  /*!< Reserved 830h                                                  */
  __IO uint32_t DIEPEMPMSK;           /*!< dev empty msk                              Address offset: 834h*/
} USB_OTG_DeviceTypeDef;

/** 
  * @brief __IN_Endpoint-Specific_Register
  */

typedef struct 
{
  __IO uint32_t DIEPCTL;              /*!< dev IN Endpoint Control Reg                900h + (ep_num * 20h) + 00h*/
  uint32_t Reserved04;                /*!< Reserved                                   900h + (ep_num * 20h) + 04h*/
  __IO uint32_t DIEPINT;              /*!< dev IN Endpoint Itr Reg                    900h + (ep_num * 20h) + 08h*/
  uint32_t Reserved0C;                /*!< Reserved                                   900h + (ep_num * 20h) + 0Ch*/
  __IO uint32_t DIEPTSIZ;             /*!< IN Endpoint Txfer Size                     900h + (ep_num * 20h) + 10h*/
  uint32_t Reserved14;                /*!< Reserved                                   900h + (ep_num * 20h) + 14h*/
  __IO uint32_t DTXFSTS;              /*!< IN Endpoint Tx FIFO Status Reg             900h + (ep_num * 20h) + 18h*/
  uint32_t Reserved1C;                /*!< Reserved                                   900h + (ep_num * 20h) + 1Ch */
} USB_OTG_INEndpointTypeDef;

/** 
  * @brief __OUT_Endpoint-Specific_Registers
  */

typedef struct 
{
  __IO uint32_t DOEPCTL;              /*!< dev OUT Endpoint Control Reg               B00h + (ep_num * 20h) + 00h*/
  uint32_t Reserved04;                /*!< Reserved                                   B00h + (ep_num * 20h) + 04h*/
  __IO uint32_t DOEPINT;              /*!< dev OUT Endpoint Itr Reg                   B00h + (ep_num * 20h) + 08h*/
  uint32_t Reserved0C;                /*!< Reserved                                   B00h + (ep_num * 20h) + 0Ch*/
  __IO uint32_t DOEPTSIZ;             /*!< dev OUT Endpoint Txfer Size                B00h + (ep_num * 20h) + 10h*/
  uint32_t Reserved14[3];             /*!< Reserved                                   B00h + (ep_num * 20h) + 14h - B00h + (ep_num * 20h) + 1Ch*/
} USB_OTG_OUTEndpointTypeDef;

/** 
  * @brief __Host_Mode_Register_Structures
  */

typedef struct 
{
  __IO uint32_t HCFG;                 /*!< Host Configuration Register                Address offset: 400h*/
  __IO uint32_t HFIR;                 /*!< Host Frame Interval Register               Address offset: 404h*/
  __IO uint32_t HFNUM;                /*!< Host Frame Nbr/Frame Remaining             Address offset: 408h*/
  uint32_t Reserved40C;               /*!< Reserved                                   Address offset: 40Ch*/
  __IO uint32_t HPTXSTS;              /*!< Host Periodic Tx FIFO/ Queue Status        Address offset: 410h*/
  __IO uint32_t HAINT;                /*!< Host All Channels Interrupt Register       Address offset: 414h*/
  __IO uint32_t HAINTMSK;             /*!< Host All Channels Interrupt Mask           Address offset: 418h*/
} USB_OTG_HostTypeDef;

/** 
  * @brief __Host_Channel_Specific_Registers
  */

typedef struct
{
  __IO uint32_t HCCHAR;               /*!< Host Channel Characteristics Register      500h + (ch_num * 20h) + 00h*/
  uint32_t Reserved04;                /*!< Reserved                                   500h + (ch_num * 20h) + 04h*/  
  __IO uint32_t HCINT;                /*!< Host Channel Interrupt Register            500h + (ch_num * 20h) + 08h*/
  __IO uint32_t HCINTMSK;             /*!< Host Channel Interrupt Mask Register       500h + (ch_num * 20h) + 0Ch*/
  __IO uint32_t HCTSIZ;               /*!< Host Channel Transfer Size Register        500h + (ch_num * 20h) + 10h*/
  uint32_t Reserved14[3];             /*!< Reserved                                   500h + (ch_num * 20h) + 14h - 500h + (ch_num * 20h) + 1Ch*/
} USB_OTG_HostChannelTypeDef;

/**
* @brief WWDG Registers
*/
typedef struct
{
   __IO uint32_t CR;               /*!< WWDR CR Register,                   Address offset: 0x0  */
   __IO uint32_t CFR;              /*!< WWDG CFR Register,                  Address offset: 0x4  */
   __IO uint32_t SR;               /*!< WWDG SR Register,                   Address offset: 0x8  */
}WWDG_TypeDef;

/*!< Peripheral memory map */
#define FLASH_BASE            (0x08000000UL)                         /*!< FLASH base address */
#define FLASH_END             (0x0805FFFFUL)                         /*!< FLASH end address */
#define FLASH_SIZE            (FLASH_END - FLASH_BASE + 1)
#define FLASH_PAGE_SIZE       (0x00000200UL)                         /*!< FLASH Page Size, 512 Bytes */
#define FLASH_PAGE_NB         (FLASH_SIZE / FLASH_PAGE_SIZE)
#define FLASH_SECTOR_SIZE     (0x00001000UL)                         /*!< FLASH Sector Size, 4096 Bytes */
#define FLASH_SECTOR_NB       (FLASH_SIZE / FLASH_SECTOR_SIZE)
#define FLASH_BLOCK_SIZE      (0x00010000UL)                         /*!< FLASH Block  Size, 65536 Bytes */
#define FLASH_BLOCK_NB        (FLASH_SIZE / FLASH_BLOCK_SIZE)
#define SRAM1_BASE            (0x20000000UL)                         /*!< SRAM1(up to 96 KB) base address */
#define SRAM2_BASE            (0x20018000UL)                         /*!< SRAM2(16 KB) base address */
#define CCMSRAM_BASE          (0x10000000UL)                         /*!< CCMSRAM(32 KB) base address */
#define PERIPH_BASE           (0x40000000UL)                         /*!< Peripheral base address */
#define SRAM1_BB_BASE         (0x22000000UL)                         /*!< SRAM1(96 KB) base address in the bit-band region */
#define SRAM2_BB_BASE         (0x22300000UL)                         /*!< SRAM2(16 KB) base address in the bit-band region */
#define CCMSRAM_BB_BASE       (0x22380000UL)                         /*!< CCMSRAM(32 KB) base address in the bit-band region */
#define PERIPH_BB_BASE        (0x42000000UL)                         /*!< Peripheral base address in the bit-band region */
#define OB_BASE               (0x1FFF7400UL)                         /*!< Flash Option Bytes base address */
#define UID_BASE              (0x1FFF7E00UL)                         /*!< Unique device ID register base address */
#define OTP_BASE              (0x1FFF7000UL)

