Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/* Legacy defines */
#define SRAM_BASE             SRAM1_BASE
#define SRAM_BB_BASE          SRAM1_BB_BASE

#define SRAM1_SIZE_MAX        (0x00018000UL) /*!< maximum SRAM1 size (up to 96 KBytes) */
#define SRAM2_SIZE            (0x00004000UL) /*!< SRAM2 size (16 KBytes) */
#define CCMSRAM_SIZE          (0x00008000UL) /*!< CCMSRAM size (32 KBytes) */

#define APB1PERIPH_BASE                        PERIPH_BASE
#define APB2PERIPH_BASE                        (PERIPH_BASE + 0x00010000UL)

#define AHBPERIPH_BASE                         (0xA0000000UL)
#define AHB1PERIPH_BASE                        (PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE                        (PERIPH_BASE + 0x08000000UL)

/*!< APB1 peripherals */
#define TIM2_BASE                              (0x40000000UL)
#define TIM3_BASE                              (0x40000400UL)
#define TIM4_BASE                              (0x40000800UL)
#define TIM5_BASE                              (0x40000C00UL)
#define TIM6_BASE                              (0x40001000UL)
#define TIM7_BASE                              (0x40001400UL)
#define TIM12_BASE                             (0x40001800UL)
#define TIM13_BASE                             (0x40001C00UL)
#define TIM14_BASE                             (0x40002000UL)
#define TIM18_BASE                             (0x40002400UL)
#define RTC_BASE                               (0x40002800UL)
#define WWDG_BASE                              (0x40002C00UL)
#define IWDG_BASE                              (0x40003000UL)
#define SPI2_BASE                              (0x40003800UL)
#define SPI3_BASE                              (0x40003C00UL)
#define USART2_BASE                            (0x40004400UL)
#define USART3_BASE                            (0x40004800UL)
#define UART1_BASE                             (0x40004C00UL)
#define UART2_BASE                             (0x40005000UL)
#define I2C1_BASE                              (0x40005400UL)
#define I2C2_BASE                              (0x40005800UL)
#define UART3_BASE                             (0x40005C00UL)
#define BKP_BASE                               (0x40006C00UL)
#define PWR_BASE                               (0x40007000UL)
#define DAC1_BASE                              (0x40007400UL)
#define I2C3_BASE                              (0x40007800UL)
#define LPTIM1_BASE                            (0x40007C00UL)
#define LPUART_BASE                            (0x40008000UL)
#define I2C4_BASE                              (0x40008400UL)
#define SRAMCAN_BASE                           (0x4000AC00UL)
#define CTC_BASE                               (0x4000C800UL)
#define FDCAN1_BASE                            (0x4000CC00UL)
#define FDCAN2_BASE                            (0x4000E000UL)

/*!< APB2 peripherals */
#define SYSCFG_BASE                            (0x40010000UL)
#define EXTI_BASE                              (0x40010400UL)
#define ADC1_BASE                              (0x40012400UL)
#define ADC_COMMON_BASE                        (ADC1_BASE + 0x00000308UL)
#define ADC2_BASE                              (0x40012800UL)
#define TIM1_BASE                              (0x40012C00UL)
#define SPI1_BASE                              (0x40013000UL)
#define TIM8_BASE                              (0x40013400UL)
#define USART1_BASE                            (0x40013800UL)
#define ADC3_BASE                              (0x40013C00UL)
#define TIM9_BASE                              (0x40014C00UL)
#define TIM10_BASE                             (0x40015000UL)
#define TIM11_BASE                             (0x40015400UL)
#define TIM15_BASE                             (0x40015800UL)
#define TIM16_BASE                             (0x40015C00UL)
#define TIM17_BASE                             (0x40016000UL)
#define TIM19_BASE                             (0x40016400UL)
#define RNG_BASE                               (0x40016800UL)
#define COMP1_BASE                             (0x40016C00UL)
#define COMP2_BASE                             (0x40016C10UL)
#define COMP3_BASE                             (0x40016C20UL)
#define COMP4_BASE                             (0x40016C30UL)
#define OPA_BASE                               (0x40017000UL)
#define OPA1_BASE                              (0x40017000UL)
#define OPA2_BASE                              (0x40017004UL)
#define OPA3_BASE                              (0x40017008UL)
#define LCDC0123_COMMON_BASE                   (0x40017400UL)
#define LCDC0_BASE                             (0x40017404UL)
#define LCDC1_BASE                             (0x40017414UL)
#define LCDC2_BASE                             (0x40017424UL)
#define LCDC3_BASE                             (0x40017434UL)

/*!< AHB1 peripherals */
#define DMA1_BASE                              (AHB1PERIPH_BASE + 0x00000000UL)
#define DMA2_BASE                              (AHB1PERIPH_BASE + 0x00000400UL)
#define RCC_BASE                               (0x40021000UL)
#define FLASH_R_BASE                           (AHB1PERIPH_BASE + 0x2000) /*!< Flash registers base address */
#define CRC_BASE                               (0x40023000UL)

#define DMA1_Channel1_BASE                     (AHB1PERIPH_BASE + 0x00000010UL)
#define DMA1_Channel2_BASE                     (AHB1PERIPH_BASE + 0x00000068UL)
#define DMA1_Channel3_BASE                     (AHB1PERIPH_BASE + 0x000000C0UL)
#define DMA1_Channel4_BASE                     (AHB1PERIPH_BASE + 0x00000118UL)
#define DMA1_Channel5_BASE                     (AHB1PERIPH_BASE + 0x00000170UL)
#define DMA1_Channel6_BASE                     (AHB1PERIPH_BASE + 0x000001C8UL)
#define DMA2_Channel1_BASE                     (AHB1PERIPH_BASE + 0x00000410UL)
#define DMA2_Channel2_BASE                     (AHB1PERIPH_BASE + 0x00000468UL)
#define DMA2_Channel3_BASE                     (AHB1PERIPH_BASE + 0x000004C0UL)
#define DMA2_Channel4_BASE                     (AHB1PERIPH_BASE + 0x00000518UL)
#define DMA2_Channel5_BASE                     (AHB1PERIPH_BASE + 0x00000570UL)
#define DMA2_Channel6_BASE                     (AHB1PERIPH_BASE + 0x000005C8UL)

/*!< AHB2 peripherals */
#define CORDIC_BASE                            (0x4002C000UL)
#define GPIOA_BASE                             (0x48000000UL)
#define GPIOB_BASE                             (0x48000400UL)
#define GPIOC_BASE                             (0x48000800UL)
#define GPIOD_BASE                             (0x48000C00UL)
#define GPIOE_BASE                             (0x48001000UL)
#define GPIOF_BASE                             (0x48001400UL)
#define SDIO_BASE                              (0x48002000UL)
#define AES_BASE                               (0x48002400UL)
#define ETH_BASE                               (0x480C0000UL)
#define ESMC_BASE                              (AHBPERIPH_BASE + 0x00001000UL)
#define USB1_OTG_FS_PERIPH_BASE                (0x48040000UL)
#define USB2_OTG_FS_PERIPH_BASE                (0x48080000UL)
#define ETH_MAC_BASE                           (ETH_BASE)
#define ETH_MMC_BASE                           (ETH_BASE + 0x00000100UL)
#define ETH_PTP_BASE                           (ETH_BASE + 0x00000700UL)
#define ETH_DMA_BASE                           (ETH_BASE + 0x00001000UL)

/*!< USB registers address offset*/
#define USB_OTG_GLOBAL_BASE                    (0x00000000UL)
#define USB_OTG_DEVICE_BASE                    (0x00000800UL)
#define USB_OTG_IN_ENDPOINT_BASE               (0x00000900UL)
#define USB_OTG_OUT_ENDPOINT_BASE              (0x00000B00UL)
#define USB_OTG_EP_REG_SIZE                    (0x00000020UL)
#define USB_OTG_HOST_BASE                      (0x00000400UL)
#define USB_OTG_HOST_PORT_BASE                 (0x00000440UL)
#define USB_OTG_HOST_CHANNEL_BASE              (0x00000500UL)
#define USB_OTG_HOST_CHANNEL_SIZE              (0x00000020UL)
#define USB_OTG_PCGCCTL_BASE                   (0x00000E00UL)
#define USB_OTG_FIFO_BASE                      (0x00001000UL)
#define USB_OTG_FIFO_SIZE                      (0x00001000UL)

