Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
#define BKP_RTCCR_CCO_Pos                         (7U)
#define BKP_RTCCR_CCO_Msk                         (0x1UL<<BKP_RTCCR_CCO_Pos)                        /*!< 0x00000080 */
#define BKP_RTCCR_CCO                             BKP_RTCCR_CCO_Msk                                 /*!< Calibration clock output */
#define BKP_RTCCR_ASOE_Pos                        (8U)
#define BKP_RTCCR_ASOE_Msk                        (0x1UL<<BKP_RTCCR_ASOE_Pos)                       /*!< 0x00000100 */
#define BKP_RTCCR_ASOE                            BKP_RTCCR_ASOE_Msk                                /*!< Alarm or second output enable */
#define BKP_RTCCR_ASOS_Pos                        (9U)
#define BKP_RTCCR_ASOS_Msk                        (0x1UL<<BKP_RTCCR_ASOS_Pos)                       /*!< 0x00000200 */
#define BKP_RTCCR_ASOS                            BKP_RTCCR_ASOS_Msk                                /*!< Alarm or second output selection */

/********************************* Bit definition for BKP_DR0 register **********************************************/
#define BKP_DR0_D_Pos                             (0U)
#define BKP_DR0_D_Msk                             (0xFFFFFFFFUL<<BKP_DR0_D_Pos)                     /*!< 0xFFFFFFFF */
#define BKP_DR0_D                                 BKP_DR0_D_Msk                                     /*!< bakeup data word0 */

/********************************* Bit definition for BKP_DR1 register **********************************************/
#define BKP_DR1_D_Pos                             (0U)
#define BKP_DR1_D_Msk                             (0xFFFFFFFFUL<<BKP_DR1_D_Pos)                     /*!< 0xFFFFFFFF */
#define BKP_DR1_D                                 BKP_DR1_D_Msk                                     /*!< bakeup data word1 */

/********************************* Bit definition for BKP_DR2 register **********************************************/
#define BKP_DR2_D_Pos                             (0U)
#define BKP_DR2_D_Msk                             (0xFFFFFFFFUL<<BKP_DR2_D_Pos)                     /*!< 0xFFFFFFFF */
#define BKP_DR2_D                                 BKP_DR2_D_Msk                                     /*!< bakeup data word2 */

/********************************* Bit definition for BKP_DR3 register **********************************************/
#define BKP_DR3_D_Pos                             (0U)
#define BKP_DR3_D_Msk                             (0xFFFFFFFFUL<<BKP_DR3_D_Pos)                     /*!< 0xFFFFFFFF */
#define BKP_DR3_D                                 BKP_DR3_D_Msk                                     /*!< bakeup data word3 */

/********************************* Bit definition for BKP_DR4 register **********************************************/
#define BKP_DR4_D_Pos                             (0U)
#define BKP_DR4_D_Msk                             (0xFFFFFFFFUL<<BKP_DR4_D_Pos)                     /*!< 0xFFFFFFFF */
#define BKP_DR4_D                                 BKP_DR4_D_Msk                                     /*!< bakeup data word4 */

/********************************* Bit definition for BKP_DR5 register **********************************************/
#define BKP_DR5_D_Pos                             (0U)
#define BKP_DR5_D_Msk                             (0xFFFFFFFFUL<<BKP_DR5_D_Pos)                     /*!< 0xFFFFFFFF */
#define BKP_DR5_D                                 BKP_DR5_D_Msk                                     /*!< bakeup data word5 */

/********************************* Bit definition for BKP_DR6 register **********************************************/
#define BKP_DR6_D_Pos                             (0U)
#define BKP_DR6_D_Msk                             (0xFFFFFFFFUL<<BKP_DR6_D_Pos)                     /*!< 0xFFFFFFFF */
#define BKP_DR6_D                                 BKP_DR6_D_Msk                                     /*!< bakeup data word6 */

/********************************* Bit definition for BKP_DR7 register **********************************************/
#define BKP_DR7_D_Pos                             (0U)
#define BKP_DR7_D_Msk                             (0xFFFFFFFFUL<<BKP_DR7_D_Pos)                     /*!< 0xFFFFFFFF */
#define BKP_DR7_D                                 BKP_DR7_D_Msk                                     /*!< bakeup data word7 */

/********************************* Bit definition for BKP_DR8 register **********************************************/
#define BKP_DR8_D_Pos                             (0U)
#define BKP_DR8_D_Msk                             (0xFFFFFFFFUL<<BKP_DR8_D_Pos)                     /*!< 0xFFFFFFFF */
#define BKP_DR8_D                                 BKP_DR8_D_Msk                                     /*!< bakeup data word8 */

/********************************* Bit definition for BKP_DR9 register **********************************************/
#define BKP_DR9_D_Pos                             (0U)
#define BKP_DR9_D_Msk                             (0xFFFFFFFFUL<<BKP_DR9_D_Pos)                     /*!< 0xFFFFFFFF */
#define BKP_DR9_D                                 BKP_DR9_D_Msk                                     /*!< bakeup data word9 */

/********************************* Bit definition for BKP_DR10 register *********************************************/
#define BKP_DR10_D_Pos                            (0U)
#define BKP_DR10_D_Msk                            (0xFFFFFFFFUL<<BKP_DR10_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR10_D                                BKP_DR10_D_Msk                                    /*!< bakeup data word10 */

/********************************* Bit definition for BKP_DR11 register *********************************************/
#define BKP_DR11_D_Pos                            (0U)
#define BKP_DR11_D_Msk                            (0xFFFFFFFFUL<<BKP_DR11_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR11_D                                BKP_DR11_D_Msk                                    /*!< bakeup data word11 */

/********************************* Bit definition for BKP_DR12 register *********************************************/
#define BKP_DR12_D_Pos                            (0U)
#define BKP_DR12_D_Msk                            (0xFFFFFFFFUL<<BKP_DR12_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR12_D                                BKP_DR12_D_Msk                                    /*!< bakeup data word12 */

/********************************* Bit definition for BKP_DR13 register *********************************************/
#define BKP_DR13_D_Pos                            (0U)
#define BKP_DR13_D_Msk                            (0xFFFFFFFFUL<<BKP_DR13_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR13_D                                BKP_DR13_D_Msk                                    /*!< bakeup data word13 */

/********************************* Bit definition for BKP_DR14 register *********************************************/
#define BKP_DR14_D_Pos                            (0U)
#define BKP_DR14_D_Msk                            (0xFFFFFFFFUL<<BKP_DR14_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR14_D                                BKP_DR14_D_Msk                                    /*!< bakeup data word14 */

/********************************* Bit definition for BKP_DR15 register *********************************************/
#define BKP_DR15_D_Pos                            (0U)
#define BKP_DR15_D_Msk                            (0xFFFFFFFFUL<<BKP_DR15_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR15_D                                BKP_DR15_D_Msk                                    /*!< bakeup data word15 */

/********************************* Bit definition for BKP_DR16 register *********************************************/
#define BKP_DR16_D_Pos                            (0U)
#define BKP_DR16_D_Msk                            (0xFFFFFFFFUL<<BKP_DR16_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR16_D                                BKP_DR16_D_Msk                                    /*!< bakeup data word16 */

/********************************* Bit definition for BKP_DR17 register *********************************************/
#define BKP_DR17_D_Pos                            (0U)
#define BKP_DR17_D_Msk                            (0xFFFFFFFFUL<<BKP_DR17_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR17_D                                BKP_DR17_D_Msk                                    /*!< bakeup data word17 */

/********************************* Bit definition for BKP_DR18 register *********************************************/
#define BKP_DR18_D_Pos                            (0U)
#define BKP_DR18_D_Msk                            (0xFFFFFFFFUL<<BKP_DR18_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR18_D                                BKP_DR18_D_Msk                                    /*!< bakeup data word18 */

/********************************* Bit definition for BKP_DR19 register *********************************************/
#define BKP_DR19_D_Pos                            (0U)
#define BKP_DR19_D_Msk                            (0xFFFFFFFFUL<<BKP_DR19_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR19_D                                BKP_DR19_D_Msk                                    /*!< bakeup data word19 */

