Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/********************************* Bit definition for CTC_CTL1 register *********************************************/
#define CTC_CTL1_RLVALUE_Pos                      (0U)
#define CTC_CTL1_RLVALUE_Msk                      (0xFFFFUL<<CTC_CTL1_RLVALUE_Pos)                  /*!< 0x0000FFFF */
#define CTC_CTL1_RLVALUE                          CTC_CTL1_RLVALUE_Msk                              /*!< CTC counter reload value */
#define CTC_CTL1_CKLIM_Pos                        (16U)
#define CTC_CTL1_CKLIM_Msk                        (0xFFUL<<CTC_CTL1_CKLIM_Pos)                      /*!< 0x00FF0000 */
#define CTC_CTL1_CKLIM                            CTC_CTL1_CKLIM_Msk                                /*!< Clock calibration time base limit */
#define CTC_CTL1_REFPSC_Pos                       (24U)
#define CTC_CTL1_REFPSC_Msk                       (0x7UL<<CTC_CTL1_REFPSC_Pos)                      /*!< 0x07000000 */
#define CTC_CTL1_REFPSC                           CTC_CTL1_REFPSC_Msk                               /*!< Reference signal source pre division */
#define CTC_CTL1_REFPSC_0                         (0x1UL<<CTC_CTL1_REFPSC_Pos)                      /*!< 0x01000000 */
#define CTC_CTL1_REFPSC_1                         (0x2UL<<CTC_CTL1_REFPSC_Pos)                      /*!< 0x02000000 */
#define CTC_CTL1_REFPSC_2                         (0x4UL<<CTC_CTL1_REFPSC_Pos)                      /*!< 0x04000000 */
#define CTC_CTL1_REFSEL_Pos                       (28U)
#define CTC_CTL1_REFSEL_Msk                       (0x3UL<<CTC_CTL1_REFSEL_Pos)                      /*!< 0x30000000 */
#define CTC_CTL1_REFSEL                           CTC_CTL1_REFSEL_Msk                               /*!< Selection of reference signal source */
#define CTC_CTL1_REFSEL_0                         (0x1UL<<CTC_CTL1_REFSEL_Pos)                      /*!< 0x10000000 */
#define CTC_CTL1_REFSEL_1                         (0x2UL<<CTC_CTL1_REFSEL_Pos)                      /*!< 0x20000000 */
#define CTC_CTL1_REFPOL_Pos                       (31U)
#define CTC_CTL1_REFPOL_Msk                       (0x1UL<<CTC_CTL1_REFPOL_Pos)                      /*!< 0x80000000 */
#define CTC_CTL1_REFPOL                           CTC_CTL1_REFPOL_Msk                               /*!< Reference signal source polarity */

/********************************* Bit definition for CTC_SR register ***********************************************/
#define CTC_SR_CKOKIF_Pos                         (0U)
#define CTC_SR_CKOKIF_Msk                         (0x1UL<<CTC_SR_CKOKIF_Pos)                        /*!< 0x00000001 */
#define CTC_SR_CKOKIF                             CTC_SR_CKOKIF_Msk                                 /*!< Clock calibration successful interrupt flag bit */
#define CTC_SR_CKWARNIF_Pos                       (1U)
#define CTC_SR_CKWARNIF_Msk                       (0x1UL<<CTC_SR_CKWARNIF_Pos)                      /*!< 0x00000002 */
#define CTC_SR_CKWARNIF                           CTC_SR_CKWARNIF_Msk                               /*!< Clock calibration warning interrupt flag bit */
#define CTC_SR_ERRIF_Pos                          (2U)
#define CTC_SR_ERRIF_Msk                          (0x1UL<<CTC_SR_ERRIF_Pos)                         /*!< 0x00000004 */
#define CTC_SR_ERRIF                              CTC_SR_ERRIF_Msk                                  /*!< Error interrupt flag bit */
#define CTC_SR_EREFIF_Pos                         (3U)
#define CTC_SR_EREFIF_Msk                         (0x1UL<<CTC_SR_EREFIF_Pos)                        /*!< 0x00000008 */
#define CTC_SR_EREFIF                             CTC_SR_EREFIF_Msk                                 /*!< Expected reference interrupt flag bit */
#define CTC_SR_CKERR_Pos                          (8U)
#define CTC_SR_CKERR_Msk                          (0x1UL<<CTC_SR_CKERR_Pos)                         /*!< 0x00000100 */
#define CTC_SR_CKERR                              CTC_SR_CKERR_Msk                                  /*!< Clock calibration error bit */
#define CTC_SR_REFMISS_Pos                        (9U)
#define CTC_SR_REFMISS_Msk                        (0x1UL<<CTC_SR_REFMISS_Pos)                       /*!< 0x00000200 */
#define CTC_SR_REFMISS                            CTC_SR_REFMISS_Msk                                /*!< Loss of synchronous reference pulse signal */
#define CTC_SR_TRIMERR_Pos                        (10U)
#define CTC_SR_TRIMERR_Msk                        (0x1UL<<CTC_SR_TRIMERR_Pos)                       /*!< 0x00000400 */
#define CTC_SR_TRIMERR                            CTC_SR_TRIMERR_Msk                                /*!< Calibration value error bit */
#define CTC_SR_REFDIR_Pos                         (15U)
#define CTC_SR_REFDIR_Msk                         (0x1UL<<CTC_SR_REFDIR_Pos)                        /*!< 0x00008000 */
#define CTC_SR_REFDIR                             CTC_SR_REFDIR_Msk                                 /*!< CTC calibration clock counting direction */
#define CTC_SR_REFCAP_Pos                         (16U)
#define CTC_SR_REFCAP_Msk                         (0xFFFFUL<<CTC_SR_REFCAP_Pos)                     /*!< 0xFFFF0000 */
#define CTC_SR_REFCAP                             CTC_SR_REFCAP_Msk                                 /*!< CTC counter capture value */

/********************************* Bit definition for CTC_INTC register *********************************************/
#define CTC_INTC_CKOKIC_Pos                       (0U)
#define CTC_INTC_CKOKIC_Msk                       (0x1UL<<CTC_INTC_CKOKIC_Pos)                      /*!< 0x00000001 */
#define CTC_INTC_CKOKIC                           CTC_INTC_CKOKIC_Msk                               /*!< CKOKIF interrupt clear bit */
#define CTC_INTC_CKWARNIC_Pos                     (1U)
#define CTC_INTC_CKWARNIC_Msk                     (0x1UL<<CTC_INTC_CKWARNIC_Pos)                    /*!< 0x00000002 */
#define CTC_INTC_CKWARNIC                         CTC_INTC_CKWARNIC_Msk                             /*!< CKWARNIF interrupt clear bit */
#define CTC_INTC_ERRIC_Pos                        (2U)
#define CTC_INTC_ERRIC_Msk                        (0x1UL<<CTC_INTC_ERRIC_Pos)                       /*!< 0x00000004 */
#define CTC_INTC_ERRIC                            CTC_INTC_ERRIC_Msk                                /*!< ERRIF interrupt clear bit */
#define CTC_INTC_EREFIC_Pos                       (3U)
#define CTC_INTC_EREFIC_Msk                       (0x1UL<<CTC_INTC_EREFIC_Pos)                      /*!< 0x00000008 */
#define CTC_INTC_EREFIC                           CTC_INTC_EREFIC_Msk                               /*!< EREFIF interrupt clear bit */

