Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/********************************************************************************************************************/
/********************************* DAC ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for DAC_CR register ***********************************************/
#define DAC_CR_EN1_Pos                            (0U)
#define DAC_CR_EN1_Msk                            (0x1UL<<DAC_CR_EN1_Pos)                           /*!< 0x00000001 */
#define DAC_CR_EN1                                DAC_CR_EN1_Msk                                    
#define DAC_CR_BOFF1_Pos                          (1U)
#define DAC_CR_BOFF1_Msk                          (0x1UL<<DAC_CR_BOFF1_Pos)                         /*!< 0x00000002 */
#define DAC_CR_BOFF1                              DAC_CR_BOFF1_Msk                                  
#define DAC_CR_TEN1_Pos                           (2U)
#define DAC_CR_TEN1_Msk                           (0x1UL<<DAC_CR_TEN1_Pos)                          /*!< 0x00000004 */
#define DAC_CR_TEN1                               DAC_CR_TEN1_Msk                                   
#define DAC_CR_TSEL1_Pos                          (3U)
#define DAC_CR_TSEL1_Msk                          (0xFUL<<DAC_CR_TSEL1_Pos)                         /*!< 0x00000078 */
#define DAC_CR_TSEL1                              DAC_CR_TSEL1_Msk
#define DAC_CR_TSEL1_0                            (0x1UL<<DAC_CR_TSEL1_Pos)                         /*!< 0x00000008 */
#define DAC_CR_TSEL1_1                            (0x2UL<<DAC_CR_TSEL1_Pos)                         /*!< 0x00000010 */
#define DAC_CR_TSEL1_2                            (0x4UL<<DAC_CR_TSEL1_Pos)                         /*!< 0x00000020 */
#define DAC_CR_TSEL1_3                            (0x8UL<<DAC_CR_TSEL1_Pos)                         /*!< 0x00000040 */
#define DAC_CR_WAVE1_Pos                          (7U)
#define DAC_CR_WAVE1_Msk                          (0x3UL<<DAC_CR_WAVE1_Pos)                         /*!< 0x00000180 */
#define DAC_CR_WAVE1                              DAC_CR_WAVE1_Msk
#define DAC_CR_WAVE1_0                            (0x1UL<<DAC_CR_WAVE1_Pos)                         /*!< 0x00000080 */
#define DAC_CR_WAVE1_1                            (0x2UL<<DAC_CR_WAVE1_Pos)                         /*!< 0x00000100 */
#define DAC_CR_MAMP1_Pos                          (9U)
#define DAC_CR_MAMP1_Msk                          (0xFUL<<DAC_CR_MAMP1_Pos)                         /*!< 0x00001E00 */
#define DAC_CR_MAMP1                              DAC_CR_MAMP1_Msk
#define DAC_CR_MAMP1_0                            (0x1UL<<DAC_CR_MAMP1_Pos)                         /*!< 0x00000200 */
#define DAC_CR_MAMP1_1                            (0x2UL<<DAC_CR_MAMP1_Pos)                         /*!< 0x00000400 */
#define DAC_CR_MAMP1_2                            (0x4UL<<DAC_CR_MAMP1_Pos)                         /*!< 0x00000800 */
#define DAC_CR_MAMP1_3                            (0x8UL<<DAC_CR_MAMP1_Pos)                         /*!< 0x00001000 */
#define DAC_CR_DMAEN1_Pos                         (13U)
#define DAC_CR_DMAEN1_Msk                         (0x1UL<<DAC_CR_DMAEN1_Pos)                        /*!< 0x00002000 */
#define DAC_CR_DMAEN1                             DAC_CR_DMAEN1_Msk                                 
#define DAC_CR_DMAUDRIE1_Pos                      (14U)
#define DAC_CR_DMAUDRIE1_Msk                      (0x1UL<<DAC_CR_DMAUDRIE1_Pos)                     /*!< 0x00004000 */
#define DAC_CR_DMAUDRIE1                          DAC_CR_DMAUDRIE1_Msk                              
#define DAC_CR_DAC1CEN_Pos                        (15U)
#define DAC_CR_DAC1CEN_Msk                        (0x1UL<<DAC_CR_DAC1CEN_Pos)                       /*!< 0x00008000 */
#define DAC_CR_DAC1CEN                            DAC_CR_DAC1CEN_Msk                                
#define DAC_CR_EN2_Pos                            (16U)
#define DAC_CR_EN2_Msk                            (0x1UL<<DAC_CR_EN2_Pos)                           /*!< 0x00010000 */
#define DAC_CR_EN2                                DAC_CR_EN2_Msk                                    
#define DAC_CR_BOFF2_Pos                          (17U)
#define DAC_CR_BOFF2_Msk                          (0x1UL<<DAC_CR_BOFF2_Pos)                         /*!< 0x00020000 */
#define DAC_CR_BOFF2                              DAC_CR_BOFF2_Msk                                  
#define DAC_CR_TEN2_Pos                           (18U)
#define DAC_CR_TEN2_Msk                           (0x1UL<<DAC_CR_TEN2_Pos)                          /*!< 0x00040000 */
#define DAC_CR_TEN2                               DAC_CR_TEN2_Msk                                   
#define DAC_CR_TSEL2_Pos                          (19U)
#define DAC_CR_TSEL2_Msk                          (0xFUL<<DAC_CR_TSEL2_Pos)                         /*!< 0x00780000 */
#define DAC_CR_TSEL2                              DAC_CR_TSEL2_Msk
#define DAC_CR_TSEL2_0                            (0x1UL<<DAC_CR_TSEL2_Pos)                         /*!< 0x00080000 */
#define DAC_CR_TSEL2_1                            (0x2UL<<DAC_CR_TSEL2_Pos)                         /*!< 0x00100000 */
#define DAC_CR_TSEL2_2                            (0x4UL<<DAC_CR_TSEL2_Pos)                         /*!< 0x00200000 */
#define DAC_CR_TSEL2_3                            (0x8UL<<DAC_CR_TSEL2_Pos)                         /*!< 0x00400000 */
#define DAC_CR_WAVE2_Pos                          (23U)
#define DAC_CR_WAVE2_Msk                          (0x3UL<<DAC_CR_WAVE2_Pos)                         /*!< 0x01800000 */
#define DAC_CR_WAVE2                              DAC_CR_WAVE2_Msk
#define DAC_CR_WAVE2_0                            (0x1UL<<DAC_CR_WAVE2_Pos)                         /*!< 0x00800000 */
#define DAC_CR_WAVE2_1                            (0x2UL<<DAC_CR_WAVE2_Pos)                         /*!< 0x01000000 */
#define DAC_CR_MAMP2_Pos                          (25U)
#define DAC_CR_MAMP2_Msk                          (0xFUL<<DAC_CR_MAMP2_Pos)                         /*!< 0x1E000000 */
#define DAC_CR_MAMP2                              DAC_CR_MAMP2_Msk
#define DAC_CR_MAMP2_0                            (0x1UL<<DAC_CR_MAMP2_Pos)                         /*!< 0x02000000 */
#define DAC_CR_MAMP2_1                            (0x2UL<<DAC_CR_MAMP2_Pos)                         /*!< 0x04000000 */
#define DAC_CR_MAMP2_2                            (0x4UL<<DAC_CR_MAMP2_Pos)                         /*!< 0x08000000 */
#define DAC_CR_MAMP2_3                            (0x8UL<<DAC_CR_MAMP2_Pos)                         /*!< 0x10000000 */
#define DAC_CR_DMAEN2_Pos                         (29U)
#define DAC_CR_DMAEN2_Msk                         (0x1UL<<DAC_CR_DMAEN2_Pos)                        /*!< 0x20000000 */
#define DAC_CR_DMAEN2                             DAC_CR_DMAEN2_Msk                                 
#define DAC_CR_DMAUDRIE2_Pos                      (30U)
#define DAC_CR_DMAUDRIE2_Msk                      (0x1UL<<DAC_CR_DMAUDRIE2_Pos)                     /*!< 0x40000000 */
#define DAC_CR_DMAUDRIE2                          DAC_CR_DMAUDRIE2_Msk                              
#define DAC_CR_DAC2CEN_Pos                        (31U)
#define DAC_CR_DAC2CEN_Msk                        (0x1UL<<DAC_CR_DAC2CEN_Pos)                       /*!< 0x80000000 */
#define DAC_CR_DAC2CEN                            DAC_CR_DAC2CEN_Msk                                

/********************************* Bit definition for DAC_SWTRIGR register ******************************************/
#define DAC_SWTRIGR_SWTRIG1_Pos                   (0U)
#define DAC_SWTRIGR_SWTRIG1_Msk                   (0x1UL<<DAC_SWTRIGR_SWTRIG1_Pos)                  /*!< 0x00000001 */
#define DAC_SWTRIGR_SWTRIG1                       DAC_SWTRIGR_SWTRIG1_Msk                           
#define DAC_SWTRIGR_SWTRIG2_Pos                   (1U)
#define DAC_SWTRIGR_SWTRIG2_Msk                   (0x1UL<<DAC_SWTRIGR_SWTRIG2_Pos)                  /*!< 0x00000002 */
#define DAC_SWTRIGR_SWTRIG2                       DAC_SWTRIGR_SWTRIG2_Msk                           

