Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/********************************************************************************************************************/
/********************************* DBG ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for DBGMCU_IDCODE register ****************************************/
#define DBGMCU_IDCODE_REV_ID_Pos                   (0U)
#define DBGMCU_IDCODE_REV_ID_Msk                   (0xFFFFFFFFUL << DBGMCU_IDCODE_REV_ID_Pos)          /*!< 0xFFFFFFFF */
#define DBGMCU_IDCODE_REV_ID                       DBGMCU_IDCODE_REV_ID_Msk                            /*!< REV_ID[31:0] bits (desc REV_ID) */

/********************************* Bit definition for DBGMCU_CR1 register *******************************************/
#define DBGMCU_CR1_DBG_SLEEP_Pos                   (0U)
#define DBGMCU_CR1_DBG_SLEEP_Msk                   (0x1UL << DBGMCU_CR1_DBG_SLEEP_Pos)                /*!< 0x00000001 */
#define DBGMCU_CR1_DBG_SLEEP                       DBGMCU_CR1_DBG_SLEEP_Msk                           /*!< desc DBG_SLEEP */
#define DBGMCU_CR1_DBG_STOP_Pos                    (1U)
#define DBGMCU_CR1_DBG_STOP_Msk                    (0x1UL << DBGMCU_CR1_DBG_STOP_Pos)                 /*!< 0x00000002 */
#define DBGMCU_CR1_DBG_STOP                        DBGMCU_CR1_DBG_STOP_Msk                            /*!< desc DBG_STOP */
#define DBGMCU_CR1_DBG_STDBY_Pos                   (2U)
#define DBGMCU_CR1_DBG_STDBY_Msk                   (0x1UL << DBGMCU_CR1_DBG_STDBY_Pos)                /*!< 0x00000004 */
#define DBGMCU_CR1_DBG_STDBY                       DBGMCU_CR1_DBG_STDBY_Msk                           /*!< desc DBG_STDBY */
#define DBGMCU_CR1_DBG_IWDG_STOP_Pos               (8U)
#define DBGMCU_CR1_DBG_IWDG_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_IWDG_STOP_Pos)            /*!< 0x00000100 */
#define DBGMCU_CR1_DBG_IWDG_STOP                   DBGMCU_CR1_DBG_IWDG_STOP_Msk                       /*!< desc DBG_IWDG_STOP */
#define DBGMCU_CR1_DBG_WWDG_STOP_Pos               (9U)
#define DBGMCU_CR1_DBG_WWDG_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_WWDG_STOP_Pos)            /*!< 0x00000200 */
#define DBGMCU_CR1_DBG_WWDG_STOP                   DBGMCU_CR1_DBG_WWDG_STOP_Msk                       /*!< desc DBG_WWDG_STOP */
#define DBGMCU_CR1_DBG_TIM1_STOP_Pos               (10U)
#define DBGMCU_CR1_DBG_TIM1_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM1_STOP_Pos)            /*!< 0x00000400 */
#define DBGMCU_CR1_DBG_TIM1_STOP                   DBGMCU_CR1_DBG_TIM1_STOP_Msk                       /*!< desc DBG_TIM1_STOP */
#define DBGMCU_CR1_DBG_TIM2_STOP_Pos               (11U)
#define DBGMCU_CR1_DBG_TIM2_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM2_STOP_Pos)            /*!< 0x00000800 */
#define DBGMCU_CR1_DBG_TIM2_STOP                   DBGMCU_CR1_DBG_TIM2_STOP_Msk                       /*!< desc DBG_TIM2_STOP */
#define DBGMCU_CR1_DBG_TIM3_STOP_Pos               (12U)
#define DBGMCU_CR1_DBG_TIM3_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM3_STOP_Pos)            /*!< 0x00001000 */
#define DBGMCU_CR1_DBG_TIM3_STOP                   DBGMCU_CR1_DBG_TIM3_STOP_Msk                       /*!< desc DBG_TIM3_STOP */
#define DBGMCU_CR1_DBG_TIM4_STOP_Pos               (13U)
#define DBGMCU_CR1_DBG_TIM4_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM4_STOP_Pos)            /*!< 0x00002000 */
#define DBGMCU_CR1_DBG_TIM4_STOP                   DBGMCU_CR1_DBG_TIM4_STOP_Msk                       /*!< desc DBG_TIM4_STOP */
#define DBGMCU_CR1_DBG_CAN1_STOP_Pos               (14U)
#define DBGMCU_CR1_DBG_CAN1_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_CAN1_STOP_Pos)            /*!< 0x00004000 */
#define DBGMCU_CR1_DBG_CAN1_STOP                   DBGMCU_CR1_DBG_CAN1_STOP_Msk                       /*!< desc DBG_CAN_STOP */
#define DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Pos      (15U)
#define DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Msk      (0x1UL << DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Pos)   /*!< 0x00008000 */
#define DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT          DBGMCU_CR1_DBG_I2C1_SMBUS_TIMEOUT_Msk              /*!< desc DBG_I2C1_SMBUS_TIMEOUT */
#define DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Pos      (16U)
#define DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Msk      (0x1UL << DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Pos)   /*!< 0x00010000 */
#define DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT          DBGMCU_CR1_DBG_I2C2_SMBUS_TIMEOUT_Msk              /*!< desc DBG_I2C2_SMBUS_TIMEOUT */
#define DBGMCU_CR1_DBG_TIM8_STOP_Pos               (17U)
#define DBGMCU_CR1_DBG_TIM8_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM8_STOP_Pos)            /*!< 0x00020000 */
#define DBGMCU_CR1_DBG_TIM8_STOP                   DBGMCU_CR1_DBG_TIM8_STOP_Msk                       /*!< desc DBG_TIM8_STOP */
#define DBGMCU_CR1_DBG_TIM5_STOP_Pos               (18U)
#define DBGMCU_CR1_DBG_TIM5_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM5_STOP_Pos)            /*!< 0x00040000 */
#define DBGMCU_CR1_DBG_TIM5_STOP                   DBGMCU_CR1_DBG_TIM5_STOP_Msk                       /*!< desc DBG_TIM5_STOP */
#define DBGMCU_CR1_DBG_TIM6_STOP_Pos               (19U)
#define DBGMCU_CR1_DBG_TIM6_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM6_STOP_Pos)            /*!< 0x00080000 */
#define DBGMCU_CR1_DBG_TIM6_STOP                   DBGMCU_CR1_DBG_TIM6_STOP_Msk                       /*!< desc DBG_TIM6_STOP */
#define DBGMCU_CR1_DBG_TIM7_STOP_Pos               (20U)
#define DBGMCU_CR1_DBG_TIM7_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM7_STOP_Pos)            /*!< 0x00100000 */
#define DBGMCU_CR1_DBG_TIM7_STOP                   DBGMCU_CR1_DBG_TIM7_STOP_Msk                       /*!< desc DBG_TIM7_STOP */
#define DBGMCU_CR1_DBG_TIM12_STOP_Pos              (25U)
#define DBGMCU_CR1_DBG_TIM12_STOP_Msk              (0x1UL << DBGMCU_CR1_DBG_TIM12_STOP_Pos)           /*!< 0x02000000 */
#define DBGMCU_CR1_DBG_TIM12_STOP                  DBGMCU_CR1_DBG_TIM12_STOP_Msk                      /*!< desc DBG_TIM12_STOP */
#define DBGMCU_CR1_DBG_TIM13_STOP_Pos              (26U)
#define DBGMCU_CR1_DBG_TIM13_STOP_Msk              (0x1UL << DBGMCU_CR1_DBG_TIM13_STOP_Pos)           /*!< 0x04000000 */
#define DBGMCU_CR1_DBG_TIM13_STOP                  DBGMCU_CR1_DBG_TIM13_STOP_Msk                      /*!< desc DBG_TIM13_STOP */
#define DBGMCU_CR1_DBG_TIM14_STOP_Pos              (27U)
#define DBGMCU_CR1_DBG_TIM14_STOP_Msk              (0x1UL << DBGMCU_CR1_DBG_TIM14_STOP_Pos)           /*!< 0x08000000 */
#define DBGMCU_CR1_DBG_TIM14_STOP                  DBGMCU_CR1_DBG_TIM14_STOP_Msk                      /*!< desc DBG_TIM14_STOP */
#define DBGMCU_CR1_DBG_TIM9_STOP_Pos               (28U)
#define DBGMCU_CR1_DBG_TIM9_STOP_Msk               (0x1UL << DBGMCU_CR1_DBG_TIM9_STOP_Pos)            /*!< 0x10000000 */
#define DBGMCU_CR1_DBG_TIM9_STOP                   DBGMCU_CR1_DBG_TIM9_STOP_Msk                       /*!< desc DBG_TIM9_STOP */
#define DBGMCU_CR1_DBG_TIM10_STOP_Pos              (29U)
#define DBGMCU_CR1_DBG_TIM10_STOP_Msk              (0x1UL << DBGMCU_CR1_DBG_TIM10_STOP_Pos)           /*!< 0x20000000 */
#define DBGMCU_CR1_DBG_TIM10_STOP                  DBGMCU_CR1_DBG_TIM10_STOP_Msk                      /*!< desc DBG_TIM10_STOP */
#define DBGMCU_CR1_DBG_TIM11_STOP_Pos              (30U)
#define DBGMCU_CR1_DBG_TIM11_STOP_Msk              (0x1UL << DBGMCU_CR1_DBG_TIM11_STOP_Pos)           /*!< 0x40000000 */
#define DBGMCU_CR1_DBG_TIM11_STOP                  DBGMCU_CR1_DBG_TIM11_STOP_Msk                      /*!< desc DBG_TIM11_STOP */

/********************************* Bit definition for DBGMCU_CR2 register *******************************************/
#define DBGMCU_CR2_DBG_I2C3_SMBUS_TIMEOUT_Pos      (0U)
#define DBGMCU_CR2_DBG_I2C3_SMBUS_TIMEOUT_Msk      (0x1UL << DBGMCU_CR2_DBG_I2C3_SMBUS_TIMEOUT_Pos)   /*!< 0x00000001 */
#define DBGMCU_CR2_DBG_I2C3_SMBUS_TIMEOUT          DBGMCU_CR2_DBG_I2C3_SMBUS_TIMEOUT_Msk              /*!< desc DBG_I2C3_SMBUS_TIMEOUT */

#define DBGMCU_CR2_DBG_I2C4_SMBUS_TIMEOUT_Pos      (1U)
#define DBGMCU_CR2_DBG_I2C4_SMBUS_TIMEOUT_Msk      (0x1UL << DBGMCU_CR2_DBG_I2C4_SMBUS_TIMEOUT_Pos)   /*!< 0x00000002 */
#define DBGMCU_CR2_DBG_I2C4_SMBUS_TIMEOUT          DBGMCU_CR2_DBG_I2C4_SMBUS_TIMEOUT_Msk              /*!< desc DBG_I2C4_SMBUS_TIMEOUT */

