Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/********************************* Bit definition for DMA_MASKBLOCK register ****************************************/
#define DMA_MASKBLOCK_INT_MASK_Pos                (0U)
#define DMA_MASKBLOCK_INT_MASK_Msk                (0x3FUL<<DMA_MASKBLOCK_INT_MASK_Pos)              /*!< 0x0000003F */
#define DMA_MASKBLOCK_INT_MASK                    DMA_MASKBLOCK_INT_MASK_Msk                        /*!< Mask for IntBlock Interrupt */
#define DMA_MASKBLOCK_INT_MASK_0                  (0x1UL<<DMA_MASKBLOCK_INT_MASK_Pos)               /*!< 0x00000001 */
#define DMA_MASKBLOCK_INT_MASK_1                  (0x2UL<<DMA_MASKBLOCK_INT_MASK_Pos)               /*!< 0x00000002 */
#define DMA_MASKBLOCK_INT_MASK_2                  (0x4UL<<DMA_MASKBLOCK_INT_MASK_Pos)               /*!< 0x00000004 */
#define DMA_MASKBLOCK_INT_MASK_3                  (0x8UL<<DMA_MASKBLOCK_INT_MASK_Pos)               /*!< 0x00000008 */
#define DMA_MASKBLOCK_INT_MASK_4                  (0x10UL<<DMA_MASKBLOCK_INT_MASK_Pos)              /*!< 0x00000010 */
#define DMA_MASKBLOCK_INT_MASK_5                  (0x20UL<<DMA_MASKBLOCK_INT_MASK_Pos)              /*!< 0x00000020 */
#define DMA_MASKBLOCK_INT_MASK_WE_Pos             (8U)
#define DMA_MASKBLOCK_INT_MASK_WE_Msk             (0x3FUL<<DMA_MASKBLOCK_INT_MASK_WE_Pos)           /*!< 0x00003F00 */
#define DMA_MASKBLOCK_INT_MASK_WE                 DMA_MASKBLOCK_INT_MASK_WE_Msk                     /*!< Interrupt Mask Write Enable */
#define DMA_MASKBLOCK_INT_MASK_WE_0               (0x1UL<<DMA_MASKBLOCK_INT_MASK_WE_Pos)            /*!< 0x00000100 */
#define DMA_MASKBLOCK_INT_MASK_WE_1               (0x2UL<<DMA_MASKBLOCK_INT_MASK_WE_Pos)            /*!< 0x00000200 */
#define DMA_MASKBLOCK_INT_MASK_WE_2               (0x4UL<<DMA_MASKBLOCK_INT_MASK_WE_Pos)            /*!< 0x00000400 */
#define DMA_MASKBLOCK_INT_MASK_WE_3               (0x8UL<<DMA_MASKBLOCK_INT_MASK_WE_Pos)            /*!< 0x00000800 */
#define DMA_MASKBLOCK_INT_MASK_WE_4               (0x10UL<<DMA_MASKBLOCK_INT_MASK_WE_Pos)           /*!< 0x00001000 */
#define DMA_MASKBLOCK_INT_MASK_WE_5               (0x20UL<<DMA_MASKBLOCK_INT_MASK_WE_Pos)           /*!< 0x00002000 */

/********************************* Bit definition for DMA_MASKSRCTRAN register **************************************/
#define DMA_MASKSRCTRAN_INT_MASK_Pos              (0U)
#define DMA_MASKSRCTRAN_INT_MASK_Msk              (0x3FUL<<DMA_MASKSRCTRAN_INT_MASK_Pos)            /*!< 0x0000003F */
#define DMA_MASKSRCTRAN_INT_MASK                  DMA_MASKSRCTRAN_INT_MASK_Msk                      /*!< Mask for IntSrcTran Interrupt */
#define DMA_MASKSRCTRAN_INT_MASK_0                (0x1UL<<DMA_MASKSRCTRAN_INT_MASK_Pos)             /*!< 0x00000001 */
#define DMA_MASKSRCTRAN_INT_MASK_1                (0x2UL<<DMA_MASKSRCTRAN_INT_MASK_Pos)             /*!< 0x00000002 */
#define DMA_MASKSRCTRAN_INT_MASK_2                (0x4UL<<DMA_MASKSRCTRAN_INT_MASK_Pos)             /*!< 0x00000004 */
#define DMA_MASKSRCTRAN_INT_MASK_3                (0x8UL<<DMA_MASKSRCTRAN_INT_MASK_Pos)             /*!< 0x00000008 */
#define DMA_MASKSRCTRAN_INT_MASK_4                (0x10UL<<DMA_MASKSRCTRAN_INT_MASK_Pos)            /*!< 0x00000010 */
#define DMA_MASKSRCTRAN_INT_MASK_5                (0x20UL<<DMA_MASKSRCTRAN_INT_MASK_Pos)            /*!< 0x00000020 */
#define DMA_MASKSRCTRAN_INT_MASK_WE_Pos           (8U)
#define DMA_MASKSRCTRAN_INT_MASK_WE_Msk           (0x3FUL<<DMA_MASKSRCTRAN_INT_MASK_WE_Pos)         /*!< 0x00003F00 */
#define DMA_MASKSRCTRAN_INT_MASK_WE               DMA_MASKSRCTRAN_INT_MASK_WE_Msk                   /*!< Interrupt Mask Write Enable */
#define DMA_MASKSRCTRAN_INT_MASK_WE_0             (0x1UL<<DMA_MASKSRCTRAN_INT_MASK_WE_Pos)          /*!< 0x00000100 */
#define DMA_MASKSRCTRAN_INT_MASK_WE_1             (0x2UL<<DMA_MASKSRCTRAN_INT_MASK_WE_Pos)          /*!< 0x00000200 */
#define DMA_MASKSRCTRAN_INT_MASK_WE_2             (0x4UL<<DMA_MASKSRCTRAN_INT_MASK_WE_Pos)          /*!< 0x00000400 */
#define DMA_MASKSRCTRAN_INT_MASK_WE_3             (0x8UL<<DMA_MASKSRCTRAN_INT_MASK_WE_Pos)          /*!< 0x00000800 */
#define DMA_MASKSRCTRAN_INT_MASK_WE_4             (0x10UL<<DMA_MASKSRCTRAN_INT_MASK_WE_Pos)         /*!< 0x00001000 */
#define DMA_MASKSRCTRAN_INT_MASK_WE_5             (0x20UL<<DMA_MASKSRCTRAN_INT_MASK_WE_Pos)         /*!< 0x00002000 */

/********************************* Bit definition for DMA_MASKDSTTRAN register **************************************/
#define DMA_MASKDSTTRAN_INT_MASK_Pos              (0U)
#define DMA_MASKDSTTRAN_INT_MASK_Msk              (0x3FUL<<DMA_MASKDSTTRAN_INT_MASK_Pos)            /*!< 0x0000003F */
#define DMA_MASKDSTTRAN_INT_MASK                  DMA_MASKDSTTRAN_INT_MASK_Msk                      /*!< Mask for IntDstTran Interrupt */
#define DMA_MASKDSTTRAN_INT_MASK_0                (0x1UL<<DMA_MASKDSTTRAN_INT_MASK_Pos)             /*!< 0x00000001 */
#define DMA_MASKDSTTRAN_INT_MASK_1                (0x2UL<<DMA_MASKDSTTRAN_INT_MASK_Pos)             /*!< 0x00000002 */
#define DMA_MASKDSTTRAN_INT_MASK_2                (0x4UL<<DMA_MASKDSTTRAN_INT_MASK_Pos)             /*!< 0x00000004 */
#define DMA_MASKDSTTRAN_INT_MASK_3                (0x8UL<<DMA_MASKDSTTRAN_INT_MASK_Pos)             /*!< 0x00000008 */
#define DMA_MASKDSTTRAN_INT_MASK_4                (0x10UL<<DMA_MASKDSTTRAN_INT_MASK_Pos)            /*!< 0x00000010 */
#define DMA_MASKDSTTRAN_INT_MASK_5                (0x20UL<<DMA_MASKDSTTRAN_INT_MASK_Pos)            /*!< 0x00000020 */
#define DMA_MASKDSTTRAN_INT_MASK_WE_Pos           (8U)
#define DMA_MASKDSTTRAN_INT_MASK_WE_Msk           (0x3FUL<<DMA_MASKDSTTRAN_INT_MASK_WE_Pos)         /*!< 0x00003F00 */
#define DMA_MASKDSTTRAN_INT_MASK_WE               DMA_MASKDSTTRAN_INT_MASK_WE_Msk                   /*!< Interrupt Mask Write Enable */
#define DMA_MASKDSTTRAN_INT_MASK_WE_0             (0x1UL<<DMA_MASKDSTTRAN_INT_MASK_WE_Pos)          /*!< 0x00000100 */
#define DMA_MASKDSTTRAN_INT_MASK_WE_1             (0x2UL<<DMA_MASKDSTTRAN_INT_MASK_WE_Pos)          /*!< 0x00000200 */
#define DMA_MASKDSTTRAN_INT_MASK_WE_2             (0x4UL<<DMA_MASKDSTTRAN_INT_MASK_WE_Pos)          /*!< 0x00000400 */
#define DMA_MASKDSTTRAN_INT_MASK_WE_3             (0x8UL<<DMA_MASKDSTTRAN_INT_MASK_WE_Pos)          /*!< 0x00000800 */
#define DMA_MASKDSTTRAN_INT_MASK_WE_4             (0x10UL<<DMA_MASKDSTTRAN_INT_MASK_WE_Pos)         /*!< 0x00001000 */
#define DMA_MASKDSTTRAN_INT_MASK_WE_5             (0x20UL<<DMA_MASKDSTTRAN_INT_MASK_WE_Pos)         /*!< 0x00002000 */

/********************************* Bit definition for DMA_MASKERR register ******************************************/
#define DMA_MASKERR_INT_MASK_Pos                  (0U)
#define DMA_MASKERR_INT_MASK_Msk                  (0x3FUL<<DMA_MASKERR_INT_MASK_Pos)                /*!< 0x0000003F */
#define DMA_MASKERR_INT_MASK                      DMA_MASKERR_INT_MASK_Msk                          /*!< Mask for IntErr Interrupt */
#define DMA_MASKERR_INT_MASK_0                    (0x1UL<<DMA_MASKERR_INT_MASK_Pos)                 /*!< 0x00000001 */
#define DMA_MASKERR_INT_MASK_1                    (0x2UL<<DMA_MASKERR_INT_MASK_Pos)                 /*!< 0x00000002 */
#define DMA_MASKERR_INT_MASK_2                    (0x4UL<<DMA_MASKERR_INT_MASK_Pos)                 /*!< 0x00000004 */
#define DMA_MASKERR_INT_MASK_3                    (0x8UL<<DMA_MASKERR_INT_MASK_Pos)                 /*!< 0x00000008 */
#define DMA_MASKERR_INT_MASK_4                    (0x10UL<<DMA_MASKERR_INT_MASK_Pos)                /*!< 0x00000010 */
#define DMA_MASKERR_INT_MASK_5                    (0x20UL<<DMA_MASKERR_INT_MASK_Pos)                /*!< 0x00000020 */
#define DMA_MASKERR_INT_MASK_WE_Pos               (8U)
#define DMA_MASKERR_INT_MASK_WE_Msk               (0x3FUL<<DMA_MASKERR_INT_MASK_WE_Pos)             /*!< 0x00003F00 */
#define DMA_MASKERR_INT_MASK_WE                   DMA_MASKERR_INT_MASK_WE_Msk                       /*!< Interrupt Mask Write Enable */
#define DMA_MASKERR_INT_MASK_WE_0                 (0x1UL<<DMA_MASKERR_INT_MASK_WE_Pos)              /*!< 0x00000100 */
#define DMA_MASKERR_INT_MASK_WE_1                 (0x2UL<<DMA_MASKERR_INT_MASK_WE_Pos)              /*!< 0x00000200 */
#define DMA_MASKERR_INT_MASK_WE_2                 (0x4UL<<DMA_MASKERR_INT_MASK_WE_Pos)              /*!< 0x00000400 */
#define DMA_MASKERR_INT_MASK_WE_3                 (0x8UL<<DMA_MASKERR_INT_MASK_WE_Pos)              /*!< 0x00000800 */
#define DMA_MASKERR_INT_MASK_WE_4                 (0x10UL<<DMA_MASKERR_INT_MASK_WE_Pos)             /*!< 0x00001000 */
#define DMA_MASKERR_INT_MASK_WE_5                 (0x20UL<<DMA_MASKERR_INT_MASK_WE_Pos)             /*!< 0x00002000 */

/********************************* Bit definition for DMA_CLEARTFR register *****************************************/
#define DMA_CLEARTFR_CLEAR_Pos                    (0U)
#define DMA_CLEARTFR_CLEAR_Msk                    (0x3FUL<<DMA_CLEARTFR_CLEAR_Pos)                  /*!< 0x0000003F */
#define DMA_CLEARTFR_CLEAR                        DMA_CLEARTFR_CLEAR_Msk                            /*!< Clear for IntTfr Interrupt */
#define DMA_CLEARTFR_CLEAR_0                      (0x1UL<<DMA_CLEARTFR_CLEAR_Pos)                   /*!< 0x00000001 */
#define DMA_CLEARTFR_CLEAR_1                      (0x2UL<<DMA_CLEARTFR_CLEAR_Pos)                   /*!< 0x00000002 */
#define DMA_CLEARTFR_CLEAR_2                      (0x4UL<<DMA_CLEARTFR_CLEAR_Pos)                   /*!< 0x00000004 */
#define DMA_CLEARTFR_CLEAR_3                      (0x8UL<<DMA_CLEARTFR_CLEAR_Pos)                   /*!< 0x00000008 */
#define DMA_CLEARTFR_CLEAR_4                      (0x10UL<<DMA_CLEARTFR_CLEAR_Pos)                  /*!< 0x00000010 */
#define DMA_CLEARTFR_CLEAR_5                      (0x20UL<<DMA_CLEARTFR_CLEAR_Pos)                  /*!< 0x00000020 */

/********************************* Bit definition for DMA_CLEARBLOCK register ***************************************/
#define DMA_CLEARBLOCK_CLEAR_Pos                  (0U)
#define DMA_CLEARBLOCK_CLEAR_Msk                  (0x3FUL<<DMA_CLEARBLOCK_CLEAR_Pos)                /*!< 0x0000003F */
#define DMA_CLEARBLOCK_CLEAR                      DMA_CLEARBLOCK_CLEAR_Msk                          /*!< Clear for IntBlock Interrupt */
#define DMA_CLEARBLOCK_CLEAR_0                    (0x1UL<<DMA_CLEARBLOCK_CLEAR_Pos)                 /*!< 0x00000001 */
#define DMA_CLEARBLOCK_CLEAR_1                    (0x2UL<<DMA_CLEARBLOCK_CLEAR_Pos)                 /*!< 0x00000002 */
#define DMA_CLEARBLOCK_CLEAR_2                    (0x4UL<<DMA_CLEARBLOCK_CLEAR_Pos)                 /*!< 0x00000004 */
#define DMA_CLEARBLOCK_CLEAR_3                    (0x8UL<<DMA_CLEARBLOCK_CLEAR_Pos)                 /*!< 0x00000008 */
#define DMA_CLEARBLOCK_CLEAR_4                    (0x10UL<<DMA_CLEARBLOCK_CLEAR_Pos)                /*!< 0x00000010 */
#define DMA_CLEARBLOCK_CLEAR_5                    (0x20UL<<DMA_CLEARBLOCK_CLEAR_Pos)                /*!< 0x00000020 */

