Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/* Bit definition for Ethernet DMA Current Host Receive Descriptor Register */
#define ETH_DMACHRDR_HRDAP_Pos                 (0U)                            
#define ETH_DMACHRDR_HRDAP_Msk                 (0xFFFFFFFFUL << ETH_DMACHRDR_HRDAP_Pos) /*!< 0xFFFFFFFF */
#define ETH_DMACHRDR_HRDAP                     ETH_DMACHRDR_HRDAP_Msk          /* Host receive descriptor address pointer */

/* Bit definition for Ethernet DMA Current Host Transmit Buffer Address Register */
#define ETH_DMACHTBAR_HTBAP_Pos                (0U)                            
#define ETH_DMACHTBAR_HTBAP_Msk                (0xFFFFFFFFUL << ETH_DMACHTBAR_HTBAP_Pos) /*!< 0xFFFFFFFF */
#define ETH_DMACHTBAR_HTBAP                    ETH_DMACHTBAR_HTBAP_Msk         /* Host transmit buffer address pointer */

/* Bit definition for Ethernet DMA Current Host Receive Buffer Address Register */
#define ETH_DMACHRBAR_HRBAP_Pos                (0U)                            
#define ETH_DMACHRBAR_HRBAP_Msk                (0xFFFFFFFFUL << ETH_DMACHRBAR_HRBAP_Pos) /*!< 0xFFFFFFFF */
#define ETH_DMACHRBAR_HRBAP                    ETH_DMACHRBAR_HRBAP_Msk         /* Host receive buffer address pointer */


/********************************************************************************************************************/
/********************************* EXTI *****************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for EXTI_IMR1 register ********************************************/
#define EXTI_IMR1_IMR0_Pos                        (0U)
#define EXTI_IMR1_IMR0_Msk                        (0x1UL<<EXTI_IMR1_IMR0_Pos)                       /*!< 0x00000001 */
#define EXTI_IMR1_IMR0                            EXTI_IMR1_IMR0_Msk                                
#define EXTI_IMR1_IMR1_Pos                        (1U)
#define EXTI_IMR1_IMR1_Msk                        (0x1UL<<EXTI_IMR1_IMR1_Pos)                       /*!< 0x00000002 */
#define EXTI_IMR1_IMR1                            EXTI_IMR1_IMR1_Msk                                
#define EXTI_IMR1_IMR2_Pos                        (2U)
#define EXTI_IMR1_IMR2_Msk                        (0x1UL<<EXTI_IMR1_IMR2_Pos)                       /*!< 0x00000004 */
#define EXTI_IMR1_IMR2                            EXTI_IMR1_IMR2_Msk                                
#define EXTI_IMR1_IMR3_Pos                        (3U)
#define EXTI_IMR1_IMR3_Msk                        (0x1UL<<EXTI_IMR1_IMR3_Pos)                       /*!< 0x00000008 */
#define EXTI_IMR1_IMR3                            EXTI_IMR1_IMR3_Msk                                
#define EXTI_IMR1_IMR4_Pos                        (4U)
#define EXTI_IMR1_IMR4_Msk                        (0x1UL<<EXTI_IMR1_IMR4_Pos)                       /*!< 0x00000010 */
#define EXTI_IMR1_IMR4                            EXTI_IMR1_IMR4_Msk                                
#define EXTI_IMR1_IMR5_Pos                        (5U)
#define EXTI_IMR1_IMR5_Msk                        (0x1UL<<EXTI_IMR1_IMR5_Pos)                       /*!< 0x00000020 */
#define EXTI_IMR1_IMR5                            EXTI_IMR1_IMR5_Msk                                
#define EXTI_IMR1_IMR6_Pos                        (6U)
#define EXTI_IMR1_IMR6_Msk                        (0x1UL<<EXTI_IMR1_IMR6_Pos)                       /*!< 0x00000040 */
#define EXTI_IMR1_IMR6                            EXTI_IMR1_IMR6_Msk                                
#define EXTI_IMR1_IMR7_Pos                        (7U)
#define EXTI_IMR1_IMR7_Msk                        (0x1UL<<EXTI_IMR1_IMR7_Pos)                       /*!< 0x00000080 */
#define EXTI_IMR1_IMR7                            EXTI_IMR1_IMR7_Msk                                
#define EXTI_IMR1_IMR8_Pos                        (8U)
#define EXTI_IMR1_IMR8_Msk                        (0x1UL<<EXTI_IMR1_IMR8_Pos)                       /*!< 0x00000100 */
#define EXTI_IMR1_IMR8                            EXTI_IMR1_IMR8_Msk                                
#define EXTI_IMR1_IMR9_Pos                        (9U)
#define EXTI_IMR1_IMR9_Msk                        (0x1UL<<EXTI_IMR1_IMR9_Pos)                       /*!< 0x00000200 */
#define EXTI_IMR1_IMR9                            EXTI_IMR1_IMR9_Msk                                
#define EXTI_IMR1_IMR10_Pos                       (10U)
#define EXTI_IMR1_IMR10_Msk                       (0x1UL<<EXTI_IMR1_IMR10_Pos)                      /*!< 0x00000400 */
#define EXTI_IMR1_IMR10                           EXTI_IMR1_IMR10_Msk                               
#define EXTI_IMR1_IMR11_Pos                       (11U)
#define EXTI_IMR1_IMR11_Msk                       (0x1UL<<EXTI_IMR1_IMR11_Pos)                      /*!< 0x00000800 */
#define EXTI_IMR1_IMR11                           EXTI_IMR1_IMR11_Msk                               
#define EXTI_IMR1_IMR12_Pos                       (12U)
#define EXTI_IMR1_IMR12_Msk                       (0x1UL<<EXTI_IMR1_IMR12_Pos)                      /*!< 0x00001000 */
#define EXTI_IMR1_IMR12                           EXTI_IMR1_IMR12_Msk                               
#define EXTI_IMR1_IMR13_Pos                       (13U)
#define EXTI_IMR1_IMR13_Msk                       (0x1UL<<EXTI_IMR1_IMR13_Pos)                      /*!< 0x00002000 */
#define EXTI_IMR1_IMR13                           EXTI_IMR1_IMR13_Msk                               
#define EXTI_IMR1_IMR14_Pos                       (14U)
#define EXTI_IMR1_IMR14_Msk                       (0x1UL<<EXTI_IMR1_IMR14_Pos)                      /*!< 0x00004000 */
#define EXTI_IMR1_IMR14                           EXTI_IMR1_IMR14_Msk                               
#define EXTI_IMR1_IMR15_Pos                       (15U)
#define EXTI_IMR1_IMR15_Msk                       (0x1UL<<EXTI_IMR1_IMR15_Pos)                      /*!< 0x00008000 */
#define EXTI_IMR1_IMR15                           EXTI_IMR1_IMR15_Msk                               
#define EXTI_IMR1_IMR16_Pos                       (16U)
#define EXTI_IMR1_IMR16_Msk                       (0x1UL<<EXTI_IMR1_IMR16_Pos)                      /*!< 0x00010000 */
#define EXTI_IMR1_IMR16                           EXTI_IMR1_IMR16_Msk                               
#define EXTI_IMR1_IMR17_Pos                       (17U)
#define EXTI_IMR1_IMR17_Msk                       (0x1UL<<EXTI_IMR1_IMR17_Pos)                      /*!< 0x00020000 */
#define EXTI_IMR1_IMR17                           EXTI_IMR1_IMR17_Msk                               
#define EXTI_IMR1_IMR18_Pos                       (18U)
#define EXTI_IMR1_IMR18_Msk                       (0x1UL<<EXTI_IMR1_IMR18_Pos)                      /*!< 0x00040000 */
#define EXTI_IMR1_IMR18                           EXTI_IMR1_IMR18_Msk                               
#define EXTI_IMR1_IMR19_Pos                       (19U)
#define EXTI_IMR1_IMR19_Msk                       (0x1UL<<EXTI_IMR1_IMR19_Pos)                      /*!< 0x00080000 */
#define EXTI_IMR1_IMR19                           EXTI_IMR1_IMR19_Msk                               
#define EXTI_IMR1_IMR20_Pos                       (20U)
#define EXTI_IMR1_IMR20_Msk                       (0x1UL<<EXTI_IMR1_IMR20_Pos)                      /*!< 0x00100000 */
#define EXTI_IMR1_IMR20                           EXTI_IMR1_IMR20_Msk                               
#define EXTI_IMR1_IMR21_Pos                       (21U)
#define EXTI_IMR1_IMR21_Msk                       (0x1UL<<EXTI_IMR1_IMR21_Pos)                      /*!< 0x00200000 */
#define EXTI_IMR1_IMR21                           EXTI_IMR1_IMR21_Msk                               
#define EXTI_IMR1_IMR22_Pos                       (22U)
#define EXTI_IMR1_IMR22_Msk                       (0x1UL<<EXTI_IMR1_IMR22_Pos)                      /*!< 0x00400000 */
#define EXTI_IMR1_IMR22                           EXTI_IMR1_IMR22_Msk                               
#define EXTI_IMR1_IMR23_Pos                       (23U)
#define EXTI_IMR1_IMR23_Msk                       (0x1UL<<EXTI_IMR1_IMR23_Pos)                      /*!< 0x00800000 */
#define EXTI_IMR1_IMR23                           EXTI_IMR1_IMR23_Msk                               
#define EXTI_IMR1_IMR24_Pos                       (24U)
#define EXTI_IMR1_IMR24_Msk                       (0x1UL<<EXTI_IMR1_IMR24_Pos)                      /*!< 0x01000000 */
#define EXTI_IMR1_IMR24                           EXTI_IMR1_IMR24_Msk                               
#define EXTI_IMR1_IMR25_Pos                       (25U)
#define EXTI_IMR1_IMR25_Msk                       (0x1UL<<EXTI_IMR1_IMR25_Pos)                      /*!< 0x02000000 */
#define EXTI_IMR1_IMR25                           EXTI_IMR1_IMR25_Msk                               
#define EXTI_IMR1_IMR26_Pos                       (26U)
#define EXTI_IMR1_IMR26_Msk                       (0x1UL<<EXTI_IMR1_IMR26_Pos)                      /*!< 0x04000000 */
#define EXTI_IMR1_IMR26                           EXTI_IMR1_IMR26_Msk                               
#define EXTI_IMR1_IMR27_Pos                       (27U)
#define EXTI_IMR1_IMR27_Msk                       (0x1UL<<EXTI_IMR1_IMR27_Pos)                      /*!< 0x08000000 */
#define EXTI_IMR1_IMR27                           EXTI_IMR1_IMR27_Msk                               
#define EXTI_IMR1_IMR28_Pos                       (28U)
#define EXTI_IMR1_IMR28_Msk                       (0x1UL<<EXTI_IMR1_IMR28_Pos)                      /*!< 0x10000000 */
#define EXTI_IMR1_IMR28                           EXTI_IMR1_IMR28_Msk                               
#define EXTI_IMR1_IMR29_Pos                       (29U)
#define EXTI_IMR1_IMR29_Msk                       (0x1UL<<EXTI_IMR1_IMR29_Pos)                      /*!< 0x20000000 */
#define EXTI_IMR1_IMR29                           EXTI_IMR1_IMR29_Msk                               
#define EXTI_IMR1_IMR30_Pos                       (30U)
#define EXTI_IMR1_IMR30_Msk                       (0x1UL<<EXTI_IMR1_IMR30_Pos)                      /*!< 0x40000000 */
#define EXTI_IMR1_IMR30                           EXTI_IMR1_IMR30_Msk                               
#define EXTI_IMR1_IMR31_Pos                       (31U)
#define EXTI_IMR1_IMR31_Msk                       (0x1UL<<EXTI_IMR1_IMR31_Pos)                      /*!< 0x80000000 */
#define EXTI_IMR1_IMR31                           EXTI_IMR1_IMR31_Msk                               
#define EXTI_IMR1_IMR_Pos                         (0U)
#define EXTI_IMR1_IMR_Msk                         (0xFFFFFFFFUL<<EXTI_IMR1_IMR_Pos)                 /*!< 0xFFFFFFFF */
#define EXTI_IMR1_IMR                              EXTI_IMR1_IMR_Msk                               

/********************************* Bit definition for EXTI_EMR1 register ********************************************/
#define EXTI_EMR1_EMR0_Pos                        (0U)
#define EXTI_EMR1_EMR0_Msk                        (0x1UL<<EXTI_EMR1_EMR0_Pos)                       /*!< 0x00000001 */
#define EXTI_EMR1_EMR0                            EXTI_EMR1_EMR0_Msk                                
#define EXTI_EMR1_EMR1_Pos                        (1U)
#define EXTI_EMR1_EMR1_Msk                        (0x1UL<<EXTI_EMR1_EMR1_Pos)                       /*!< 0x00000002 */
#define EXTI_EMR1_EMR1                            EXTI_EMR1_EMR1_Msk                                
#define EXTI_EMR1_EMR2_Pos                        (2U)
#define EXTI_EMR1_EMR2_Msk                        (0x1UL<<EXTI_EMR1_EMR2_Pos)                       /*!< 0x00000004 */
#define EXTI_EMR1_EMR2                            EXTI_EMR1_EMR2_Msk                                
#define EXTI_EMR1_EMR3_Pos                        (3U)
#define EXTI_EMR1_EMR3_Msk                        (0x1UL<<EXTI_EMR1_EMR3_Pos)                       /*!< 0x00000008 */
#define EXTI_EMR1_EMR3                            EXTI_EMR1_EMR3_Msk                                
#define EXTI_EMR1_EMR4_Pos                        (4U)
#define EXTI_EMR1_EMR4_Msk                        (0x1UL<<EXTI_EMR1_EMR4_Pos)                       /*!< 0x00000010 */
#define EXTI_EMR1_EMR4                            EXTI_EMR1_EMR4_Msk                                
#define EXTI_EMR1_EMR5_Pos                        (5U)
#define EXTI_EMR1_EMR5_Msk                        (0x1UL<<EXTI_EMR1_EMR5_Pos)                       /*!< 0x00000020 */
#define EXTI_EMR1_EMR5                            EXTI_EMR1_EMR5_Msk                                
#define EXTI_EMR1_EMR6_Pos                        (6U)
#define EXTI_EMR1_EMR6_Msk                        (0x1UL<<EXTI_EMR1_EMR6_Pos)                       /*!< 0x00000040 */
#define EXTI_EMR1_EMR6                            EXTI_EMR1_EMR6_Msk                                
#define EXTI_EMR1_EMR7_Pos                        (7U)
#define EXTI_EMR1_EMR7_Msk                        (0x1UL<<EXTI_EMR1_EMR7_Pos)                       /*!< 0x00000080 */
#define EXTI_EMR1_EMR7                            EXTI_EMR1_EMR7_Msk                                
#define EXTI_EMR1_EMR8_Pos                        (8U)
#define EXTI_EMR1_EMR8_Msk                        (0x1UL<<EXTI_EMR1_EMR8_Pos)                       /*!< 0x00000100 */
#define EXTI_EMR1_EMR8                            EXTI_EMR1_EMR8_Msk                                
#define EXTI_EMR1_EMR9_Pos                        (9U)
#define EXTI_EMR1_EMR9_Msk                        (0x1UL<<EXTI_EMR1_EMR9_Pos)                       /*!< 0x00000200 */
#define EXTI_EMR1_EMR9                            EXTI_EMR1_EMR9_Msk                                
#define EXTI_EMR1_EMR10_Pos                       (10U)
#define EXTI_EMR1_EMR10_Msk                       (0x1UL<<EXTI_EMR1_EMR10_Pos)                      /*!< 0x00000400 */
#define EXTI_EMR1_EMR10                           EXTI_EMR1_EMR10_Msk                               
#define EXTI_EMR1_EMR11_Pos                       (11U)
#define EXTI_EMR1_EMR11_Msk                       (0x1UL<<EXTI_EMR1_EMR11_Pos)                      /*!< 0x00000800 */
#define EXTI_EMR1_EMR11                           EXTI_EMR1_EMR11_Msk                               
#define EXTI_EMR1_EMR12_Pos                       (12U)
#define EXTI_EMR1_EMR12_Msk                       (0x1UL<<EXTI_EMR1_EMR12_Pos)                      /*!< 0x00001000 */
#define EXTI_EMR1_EMR12                           EXTI_EMR1_EMR12_Msk                               
#define EXTI_EMR1_EMR13_Pos                       (13U)
#define EXTI_EMR1_EMR13_Msk                       (0x1UL<<EXTI_EMR1_EMR13_Pos)                      /*!< 0x00002000 */
#define EXTI_EMR1_EMR13                           EXTI_EMR1_EMR13_Msk                               
#define EXTI_EMR1_EMR14_Pos                       (14U)
#define EXTI_EMR1_EMR14_Msk                       (0x1UL<<EXTI_EMR1_EMR14_Pos)                      /*!< 0x00004000 */
#define EXTI_EMR1_EMR14                           EXTI_EMR1_EMR14_Msk                               
#define EXTI_EMR1_EMR15_Pos                       (15U)
#define EXTI_EMR1_EMR15_Msk                       (0x1UL<<EXTI_EMR1_EMR15_Pos)                      /*!< 0x00008000 */
#define EXTI_EMR1_EMR15                           EXTI_EMR1_EMR15_Msk                               
#define EXTI_EMR1_EMR16_Pos                       (16U)
#define EXTI_EMR1_EMR16_Msk                       (0x1UL<<EXTI_EMR1_EMR16_Pos)                      /*!< 0x00010000 */
#define EXTI_EMR1_EMR16                           EXTI_EMR1_EMR16_Msk                               
#define EXTI_EMR1_EMR17_Pos                       (17U)
#define EXTI_EMR1_EMR17_Msk                       (0x1UL<<EXTI_EMR1_EMR17_Pos)                      /*!< 0x00020000 */
#define EXTI_EMR1_EMR17                           EXTI_EMR1_EMR17_Msk                               
#define EXTI_EMR1_EMR18_Pos                       (18U)
#define EXTI_EMR1_EMR18_Msk                       (0x1UL<<EXTI_EMR1_EMR18_Pos)                      /*!< 0x00040000 */
#define EXTI_EMR1_EMR18                           EXTI_EMR1_EMR18_Msk                               
#define EXTI_EMR1_EMR19_Pos                       (19U)
#define EXTI_EMR1_EMR19_Msk                       (0x1UL<<EXTI_EMR1_EMR19_Pos)                      /*!< 0x00080000 */
#define EXTI_EMR1_EMR19                           EXTI_EMR1_EMR19_Msk                               
#define EXTI_EMR1_EMR20_Pos                       (20U)
#define EXTI_EMR1_EMR20_Msk                       (0x1UL<<EXTI_EMR1_EMR20_Pos)                      /*!< 0x00100000 */
#define EXTI_EMR1_EMR20                           EXTI_EMR1_EMR20_Msk                               
#define EXTI_EMR1_EMR21_Pos                       (21U)
#define EXTI_EMR1_EMR21_Msk                       (0x1UL<<EXTI_EMR1_EMR21_Pos)                      /*!< 0x00200000 */
#define EXTI_EMR1_EMR21                           EXTI_EMR1_EMR21_Msk                               
#define EXTI_EMR1_EMR22_Pos                       (22U)
#define EXTI_EMR1_EMR22_Msk                       (0x1UL<<EXTI_EMR1_EMR22_Pos)                      /*!< 0x00400000 */
#define EXTI_EMR1_EMR22                           EXTI_EMR1_EMR22_Msk                               
#define EXTI_EMR1_EMR23_Pos                       (23U)
#define EXTI_EMR1_EMR23_Msk                       (0x1UL<<EXTI_EMR1_EMR23_Pos)                      /*!< 0x00800000 */
#define EXTI_EMR1_EMR23                           EXTI_EMR1_EMR23_Msk                               
#define EXTI_EMR1_EMR24_Pos                       (24U)
#define EXTI_EMR1_EMR24_Msk                       (0x1UL<<EXTI_EMR1_EMR24_Pos)                      /*!< 0x01000000 */
#define EXTI_EMR1_EMR24                           EXTI_EMR1_EMR24_Msk                               
#define EXTI_EMR1_EMR25_Pos                       (25U)
#define EXTI_EMR1_EMR25_Msk                       (0x1UL<<EXTI_EMR1_EMR25_Pos)                      /*!< 0x02000000 */
#define EXTI_EMR1_EMR25                           EXTI_EMR1_EMR25_Msk                               
#define EXTI_EMR1_EMR26_Pos                       (26U)
#define EXTI_EMR1_EMR26_Msk                       (0x1UL<<EXTI_EMR1_EMR26_Pos)                      /*!< 0x04000000 */
#define EXTI_EMR1_EMR26                           EXTI_EMR1_EMR26_Msk                               
#define EXTI_EMR1_EMR27_Pos                       (27U)
#define EXTI_EMR1_EMR27_Msk                       (0x1UL<<EXTI_EMR1_EMR27_Pos)                      /*!< 0x08000000 */
#define EXTI_EMR1_EMR27                           EXTI_EMR1_EMR27_Msk                               
#define EXTI_EMR1_EMR28_Pos                       (28U)
#define EXTI_EMR1_EMR28_Msk                       (0x1UL<<EXTI_EMR1_EMR28_Pos)                      /*!< 0x10000000 */
#define EXTI_EMR1_EMR28                           EXTI_EMR1_EMR28_Msk                               
#define EXTI_EMR1_EMR29_Pos                       (29U)
#define EXTI_EMR1_EMR29_Msk                       (0x1UL<<EXTI_EMR1_EMR29_Pos)                      /*!< 0x20000000 */
#define EXTI_EMR1_EMR29                           EXTI_EMR1_EMR29_Msk                               
#define EXTI_EMR1_EMR30_Pos                       (30U)
#define EXTI_EMR1_EMR30_Msk                       (0x1UL<<EXTI_EMR1_EMR30_Pos)                      /*!< 0x40000000 */
#define EXTI_EMR1_EMR30                           EXTI_EMR1_EMR30_Msk                               
#define EXTI_EMR1_EMR31_Pos                       (31U)
#define EXTI_EMR1_EMR31_Msk                       (0x1UL<<EXTI_EMR1_EMR31_Pos)                      /*!< 0x80000000 */
#define EXTI_EMR1_EMR31                           EXTI_EMR1_EMR31_Msk                               

