Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/********************************* Bit definition for I2C_TRISE register ********************************************/
#define I2C_TRISE_TRISE_Pos                       (0U)
#define I2C_TRISE_TRISE_Msk                       (0x7FUL<<I2C_TRISE_TRISE_Pos)                     /*!< 0x0000007F */
#define I2C_TRISE_TRISE                           I2C_TRISE_TRISE_Msk                               /*!< Maximum rise time in Fm+/Fm/Sm mode (Master mode) */
#define I2C_TRISE_THOLDDATA_Pos                   (7U)
#define I2C_TRISE_THOLDDATA_Msk                   (0x1FUL<<I2C_TRISE_THOLDDATA_Pos)                 /*!< 0x00000F80 */
#define I2C_TRISE_THOLDDATA                       I2C_TRISE_THOLDDATA_Msk                           /*!< Data hold time */
#define I2C_TRISE_THOLDDATA_0                     (0x1UL<<I2C_TRISE_THOLDDATA_Pos)                  /*!< 0x00000080 */
#define I2C_TRISE_THOLDDATA_1                     (0x2UL<<I2C_TRISE_THOLDDATA_Pos)                  /*!< 0x00000100 */
#define I2C_TRISE_THOLDDATA_2                     (0x4UL<<I2C_TRISE_THOLDDATA_Pos)                  /*!< 0x00000200 */
#define I2C_TRISE_THOLDDATA_3                     (0x8UL<<I2C_TRISE_THOLDDATA_Pos)                  /*!< 0x00000400 */
#define I2C_TRISE_THOLDDATA_4                     (0x10UL<<I2C_TRISE_THOLDDATA_Pos)                 /*!< 0x00000800 */
#define I2C_TRISE_THOLDDATA_SEL_Pos               (12U)
#define I2C_TRISE_THOLDDATA_SEL_Msk               (0x1UL<<I2C_TRISE_THOLDDATA_SEL_Pos)              /*!< 0x00001000 */
#define I2C_TRISE_THOLDDATA_SEL                   I2C_TRISE_THOLDDATA_SEL_Msk                       /*!< Data hold time select */

/********************************* Bit definition for I2C_TIMEOUTR register *****************************************/
#define I2C_TIMEOUTR_TIMEOUTA_Pos                 (0U)
#define I2C_TIMEOUTR_TIMEOUTA_Msk                 (0xFFFUL<<I2C_TIMEOUTR_TIMEOUTA_Pos)              /*!< 0x00000FFF */
#define I2C_TIMEOUTR_TIMEOUTA                     I2C_TIMEOUTR_TIMEOUTA_Msk                         /*!< Bus Timeout A */
#define I2C_TIMEOUTR_TIDLE_Pos                    (12U)
#define I2C_TIMEOUTR_TIDLE_Msk                    (0x1UL<<I2C_TIMEOUTR_TIDLE_Pos)                   /*!< 0x00001000 */
#define I2C_TIMEOUTR_TIDLE                        I2C_TIMEOUTR_TIDLE_Msk                            /*!< Idle clock timeout detection */
#define I2C_TIMEOUTR_TIMEOUTEN_Pos                (15U)
#define I2C_TIMEOUTR_TIMEOUTEN_Msk                (0x1UL<<I2C_TIMEOUTR_TIMEOUTEN_Pos)               /*!< 0x00008000 */
#define I2C_TIMEOUTR_TIMEOUTEN                    I2C_TIMEOUTR_TIMEOUTEN_Msk                        /*!< Clock timeout enable */
#define I2C_TIMEOUTR_TIMEOUTB_Pos                 (16U)
#define I2C_TIMEOUTR_TIMEOUTB_Msk                 (0xFFFUL<<I2C_TIMEOUTR_TIMEOUTB_Pos)              /*!< 0x0FFF0000 */
#define I2C_TIMEOUTR_TIMEOUTB                     I2C_TIMEOUTR_TIMEOUTB_Msk                         /*!< Bus timeout B */
#define I2C_TIMEOUTR_TEXTEN_Pos                   (31U)
#define I2C_TIMEOUTR_TEXTEN_Msk                   (0x1UL<<I2C_TIMEOUTR_TEXTEN_Pos)                  /*!< 0x80000000 */
#define I2C_TIMEOUTR_TEXTEN                       I2C_TIMEOUTR_TEXTEN_Msk                           /*!< Extended clock timeout enable */

/********************************************************************************************************************/
/********************************* IWDG *****************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for IWDG_KR register **********************************************/
#define IWDG_KR_KEY_Pos                           (0U)
#define IWDG_KR_KEY_Msk                           (0xFFFFUL<<IWDG_KR_KEY_Pos)                       /*!< 0x0000FFFF */
#define IWDG_KR_KEY                               IWDG_KR_KEY_Msk                                   /*!< IWDG KEY */

/********************************* Bit definition for IWDG_PR register **********************************************/
#define IWDG_PR_PR_Pos                            (0U)
#define IWDG_PR_PR_Msk                            (0x7UL<<IWDG_PR_PR_Pos)                           /*!< 0x00000007 */
#define IWDG_PR_PR                                IWDG_PR_PR_Msk                                    /*!< IWDG preload */
#define IWDG_PR_PR_0                              (0x1UL<<IWDG_PR_PR_Pos)                           /*!< 0x00000001 */
#define IWDG_PR_PR_1                              (0x2UL<<IWDG_PR_PR_Pos)                           /*!< 0x00000002 */
#define IWDG_PR_PR_2                              (0x4UL<<IWDG_PR_PR_Pos)                           /*!< 0x00000004 */

/********************************* Bit definition for IWDG_RLR register *********************************************/
#define IWDG_RLR_RL_Pos                           (0U)
#define IWDG_RLR_RL_Msk                           (0xFFFUL<<IWDG_RLR_RL_Pos)                        /*!< 0x00000FFF */
#define IWDG_RLR_RL                               IWDG_RLR_RL_Msk                                   /*!< IWDG reload */

/********************************* Bit definition for IWDG_SR register **********************************************/
#define IWDG_SR_PVU_Pos                           (0U)
#define IWDG_SR_PVU_Msk                           (0x1UL<<IWDG_SR_PVU_Pos)                          /*!< 0x00000001 */
#define IWDG_SR_PVU                               IWDG_SR_PVU_Msk                                   /*!< Watchdog prescaler value update */
#define IWDG_SR_RVU_Pos                           (1U)
#define IWDG_SR_RVU_Msk                           (0x1UL<<IWDG_SR_RVU_Pos)                          /*!< 0x00000002 */
#define IWDG_SR_RVU                               IWDG_SR_RVU_Msk                                   /*!< Watchdog counter reload value update */

/********************************************************************************************************************/
/********************************* LCDC *****************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for LCDC_CSR register *********************************************/
#define LCDC_CSR_EN0_Pos                          (0U)
#define LCDC_CSR_EN0_Msk                          (0x1UL<<LCDC_CSR_EN0_Pos)                         /*!< 0x00000001 */
#define LCDC_CSR_EN0                              LCDC_CSR_EN0_Msk                                  /*!< LCD0 enable */
#define LCDC_CSR_EN1_Pos                          (1U)
#define LCDC_CSR_EN1_Msk                          (0x1UL<<LCDC_CSR_EN1_Pos)                         /*!< 0x00000002 */
#define LCDC_CSR_EN1                              LCDC_CSR_EN1_Msk                                  /*!< LCD1 enable */
#define LCDC_CSR_EN2_Pos                          (2U)
#define LCDC_CSR_EN2_Msk                          (0x1UL<<LCDC_CSR_EN2_Pos)                         /*!< 0x00000004 */
#define LCDC_CSR_EN2                              LCDC_CSR_EN2_Msk                                  /*!< LCD2 enable */
#define LCDC_CSR_EN3_Pos                          (3U)
#define LCDC_CSR_EN3_Msk                          (0x1UL<<LCDC_CSR_EN3_Pos)                         /*!< 0x00000008 */
#define LCDC_CSR_EN3                              LCDC_CSR_EN3_Msk                                  /*!< LCD3 enable */
#define LCDC_CSR_MODE0_Pos                        (4U)
#define LCDC_CSR_MODE0_Msk                        (0x1UL<<LCDC_CSR_MODE0_Pos)                       /*!< 0x00000010 */
#define LCDC_CSR_MODE0                            LCDC_CSR_MODE0_Msk                                /*!< LCD0 mode */
#define LCDC_CSR_MODE1_Pos                        (5U)
#define LCDC_CSR_MODE1_Msk                        (0x1UL<<LCDC_CSR_MODE1_Pos)                       /*!< 0x00000020 */
#define LCDC_CSR_MODE1                            LCDC_CSR_MODE1_Msk                                /*!< LCD1 mode */
#define LCDC_CSR_MODE2_Pos                        (6U)
#define LCDC_CSR_MODE2_Msk                        (0x1UL<<LCDC_CSR_MODE2_Pos)                       /*!< 0x00000040 */
#define LCDC_CSR_MODE2                            LCDC_CSR_MODE2_Msk                                /*!< LCD2 mode */
#define LCDC_CSR_MODE3_Pos                        (7U)
#define LCDC_CSR_MODE3_Msk                        (0x1UL<<LCDC_CSR_MODE3_Pos)                       /*!< 0x00000080 */
#define LCDC_CSR_MODE3                            LCDC_CSR_MODE3_Msk                                /*!< LCD3 mode */
#define LCDC_CSR_DMAEN_Pos                        (16U)
#define LCDC_CSR_DMAEN_Msk                        (0x1UL<<LCDC_CSR_DMAEN_Pos)                       /*!< 0x00010000 */
#define LCDC_CSR_DMAEN                            LCDC_CSR_DMAEN_Msk                                /*!< LCDC DMA enable */
#define LCDC_CSR_BUSY_Pos                         (17U)
#define LCDC_CSR_BUSY_Msk                         (0x1UL<<LCDC_CSR_BUSY_Pos)                        /*!< 0x00020000 */
#define LCDC_CSR_BUSY                             LCDC_CSR_BUSY_Msk                                 /*!< LCDC busy */

/********************************* Bit definition for LCDC_DR register ***********************************************/
#define LCDC_DR_D_Pos                           (0U)
#define LCDC_DR_D_Msk                           (0x3FFFFUL << LCDC_DR_D_Pos)                        /*!< 0x0003FFFF */
#define LCDC_DR_D                               LCDC_DR_D_Msk    

/********************************* Bit definition for LCDC_CMDR register *********************************************/
#define LCDC_CMDR_CMD_Pos                           (0U)
#define LCDC_CMDR_CMD_Msk                           (0x3FFFFUL << LCDC_CMDR_CMD_Pos)                        
#define LCDC_CMDR_CMD                               LCDC_CMDR_CMD_Msk    

/********************************* Bit definition for LCDC_WCFGR register ********************************************/
#define LCDC_WCFGR_ADDSET_Pos                           (0U)
#define LCDC_WCFGR_ADDSET_Msk                           (0xFUL << LCDC_WCFGR_ADDSET_Pos)                        
#define LCDC_WCFGR_ADDSET                               LCDC_WCFGR_ADDSET_Msk 
#define LCDC_WCFGR_ADDSET_0                       (0x1UL<<LCDC_WCFGR_ADDSET_Pos)                    /*!< 0x00000001 */
#define LCDC_WCFGR_ADDSET_1                       (0x2UL<<LCDC_WCFGR_ADDSET_Pos)                    /*!< 0x00000002 */
#define LCDC_WCFGR_ADDSET_2                       (0x4UL<<LCDC_WCFGR_ADDSET_Pos)                    /*!< 0x00000004 */
#define LCDC_WCFGR_ADDSET_3                       (0x8UL<<LCDC_WCFGR_ADDSET_Pos)                    /*!< 0x00000008 */
#define LCDC_WCFGR_DATAST_Pos                     (8U)
#define LCDC_WCFGR_DATAST_Msk                     (0xFFUL<<LCDC_WCFGR_DATAST_Pos)                   /*!< 0x0000FF00 */
#define LCDC_WCFGR_DATAST                         LCDC_WCFGR_DATAST_Msk                             /*!< LCDC write DATAST */
#define LCDC_WCFGR_DATAHLD_Pos                    (30U)
#define LCDC_WCFGR_DATAHLD_Msk                    (0x3UL<<LCDC_WCFGR_DATAHLD_Pos)                   /*!< 0xC0000000 */
#define LCDC_WCFGR_DATAHLD                        LCDC_WCFGR_DATAHLD_Msk                            /*!< LCDC write DATAHLD */
#define LCDC_WCFGR_DATAHLD_0                      (0x1UL<<LCDC_WCFGR_DATAHLD_Pos)                   /*!< 0x40000000 */
#define LCDC_WCFGR_DATAHLD_1                      (0x2UL<<LCDC_WCFGR_DATAHLD_Pos)                   /*!< 0x80000000 */  

/********************************* Bit definition for LCDC_RCFGR register ********************************************/
#define LCDC_RCFGR_ADDSET_Pos                     (0U)
#define LCDC_RCFGR_ADDSET_Msk                     (0xFUL<<LCDC_RCFGR_ADDSET_Pos)                    /*!< 0x0000000F */
#define LCDC_RCFGR_ADDSET                         LCDC_RCFGR_ADDSET_Msk                             /*!< LCDC read ADDSET */
#define LCDC_RCFGR_ADDSET_0                       (0x1UL<<LCDC_RCFGR_ADDSET_Pos)                    /*!< 0x00000001 */
#define LCDC_RCFGR_ADDSET_1                       (0x2UL<<LCDC_RCFGR_ADDSET_Pos)                    /*!< 0x00000002 */
#define LCDC_RCFGR_ADDSET_2                       (0x4UL<<LCDC_RCFGR_ADDSET_Pos)                    /*!< 0x00000004 */
#define LCDC_RCFGR_ADDSET_3                       (0x8UL<<LCDC_RCFGR_ADDSET_Pos)                    /*!< 0x00000008 */
#define LCDC_RCFGR_DATAST_Pos                     (8U)
#define LCDC_RCFGR_DATAST_Msk                     (0xFFUL<<LCDC_RCFGR_DATAST_Pos)                   /*!< 0x0000FF00 */
#define LCDC_RCFGR_DATAST                         LCDC_RCFGR_DATAST_Msk                             /*!< LCDC read DATAST */
#define LCDC_RCFGR_DATAHLD_Pos                    (30U)
#define LCDC_RCFGR_DATAHLD_Msk                    (0x3UL<<LCDC_RCFGR_DATAHLD_Pos)                   /*!< 0xC0000000 */
#define LCDC_RCFGR_DATAHLD                        LCDC_RCFGR_DATAHLD_Msk                            /*!< LCDC read DATAHLD */
#define LCDC_RCFGR_DATAHLD_0                      (0x1UL<<LCDC_RCFGR_DATAHLD_Pos)                   /*!< 0x40000000 */
#define LCDC_RCFGR_DATAHLD_1                      (0x2UL<<LCDC_RCFGR_DATAHLD_Pos)                   /*!< 0x80000000 */

