Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/********************************************************************************************************************/
/********************************* PWR ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for PWR_CR1 register **********************************************/
#define PWR_CR1_LPMS_Pos                          (0U)
#define PWR_CR1_LPMS_Msk                          (0x3UL<<PWR_CR1_LPMS_Pos)                         /*!< 0x00000003 */
#define PWR_CR1_LPMS                              PWR_CR1_LPMS_Msk
#define PWR_CR1_LPMS_0                            (0x1UL<<PWR_CR1_LPMS_Pos)                         /*!< 0x00000001 */
#define PWR_CR1_LPMS_1                            (0x2UL<<PWR_CR1_LPMS_Pos)                         /*!< 0x00000002 */
#define PWR_CR1_LPMS_STOP0                        (0x00000000U)                                     /*!< Stop 0 mode */
#define PWR_CR1_LPMS_STOP1_Pos                    (0U)
#define PWR_CR1_LPMS_STOP1_Msk                    (0x1UL << PWR_CR1_LPMS_STOP1_Pos)                 /*!< 0x00000001 */
#define PWR_CR1_LPMS_STOP1                        PWR_CR1_LPMS_STOP1_Msk                            /*!< Stop 1 mode */
#define PWR_CR1_LPMS_STANDBY_Pos                  (0U)
#define PWR_CR1_LPMS_STANDBY_Msk                  (0x3UL << PWR_CR1_LPMS_STANDBY_Pos)               /*!< 0x00000003 */
#define PWR_CR1_LPMS_STANDBY                      PWR_CR1_LPMS_STANDBY_Msk                          /*!< Stand-by mode */
#define PWR_CR1_DBP_Pos                           (8U)
#define PWR_CR1_DBP_Msk                           (0x1UL<<PWR_CR1_DBP_Pos)                          /*!< 0x00000100 */
#define PWR_CR1_DBP                               PWR_CR1_DBP_Msk                                   
#define PWR_CR1_VOS_Pos                           (9U)
#define PWR_CR1_VOS_Msk                           (0x3UL<<PWR_CR1_VOS_Pos)                          /*!< 0x00000600 */
#define PWR_CR1_VOS                               PWR_CR1_VOS_Msk
#define PWR_CR1_VOS_0                             (0x1UL<<PWR_CR1_VOS_Pos)                          /*!< 0x00000200 */
#define PWR_CR1_VOS_1                             (0x2UL<<PWR_CR1_VOS_Pos)                          /*!< 0x00000400 */
#define PWR_CR1_SRAM_RETV_Pos                     (11U)
#define PWR_CR1_SRAM_RETV_Msk                     (0x3UL<<PWR_CR1_SRAM_RETV_Pos)                    /*!< 0x00001800 */
#define PWR_CR1_SRAM_RETV                         PWR_CR1_SRAM_RETV_Msk
#define PWR_CR1_SRAM_RETV_0                       (0x1UL<<PWR_CR1_SRAM_RETV_Pos)                    /*!< 0x00000800 */
#define PWR_CR1_SRAM_RETV_1                       (0x2UL<<PWR_CR1_SRAM_RETV_Pos)                    /*!< 0x00001000 */
#define PWR_CR1_LPR_Pos                           (14U)
#define PWR_CR1_LPR_Msk                           (0x1UL<<PWR_CR1_LPR_Pos)                          /*!< 0x00004000 */
#define PWR_CR1_LPR                               PWR_CR1_LPR_Msk                                   
#define PWR_CR1_HSION_CTRL_Pos                    (16U)
#define PWR_CR1_HSION_CTRL_Msk                    (0x1UL<<PWR_CR1_HSION_CTRL_Pos)                   /*!< 0x00010000 */
#define PWR_CR1_HSION_CTRL                        PWR_CR1_HSION_CTRL_Msk                            
#define PWR_CR1_FLS_WUPT_Pos                      (17U)
#define PWR_CR1_FLS_WUPT_Msk                      (0x3UL<<PWR_CR1_FLS_WUPT_Pos)                     /*!< 0x00060000 */
#define PWR_CR1_FLS_WUPT                          PWR_CR1_FLS_WUPT_Msk
#define PWR_CR1_FLS_WUPT_0                        (0x1UL<<PWR_CR1_FLS_WUPT_Pos)                     /*!< 0x00020000 */
#define PWR_CR1_FLS_WUPT_1                        (0x2UL<<PWR_CR1_FLS_WUPT_Pos)                     /*!< 0x00040000 */
#define PWR_CR1_STDBY_MRRDY_WAIT_Pos              (19U)
#define PWR_CR1_STDBY_MRRDY_WAIT_Msk              (0x3UL<<PWR_CR1_STDBY_MRRDY_WAIT_Pos)             /*!< 0x00180000 */
#define PWR_CR1_STDBY_MRRDY_WAIT                  PWR_CR1_STDBY_MRRDY_WAIT_Msk
#define PWR_CR1_STDBY_MRRDY_WAIT_0                (0x1UL<<PWR_CR1_STDBY_MRRDY_WAIT_Pos)             /*!< 0x00080000 */
#define PWR_CR1_STDBY_MRRDY_WAIT_1                (0x2UL<<PWR_CR1_STDBY_MRRDY_WAIT_Pos)             /*!< 0x00100000 */

/********************************* Bit definition for PWR_CR2 register **********************************************/
#define PWR_CR2_PVDE_Pos                          (0U)
#define PWR_CR2_PVDE_Msk                          (0x1UL<<PWR_CR2_PVDE_Pos)                         /*!< 0x00000001 */
#define PWR_CR2_PVDE                              PWR_CR2_PVDE_Msk                                  
#define PWR_CR2_PLS_Pos                           (1U)
#define PWR_CR2_PLS_Msk                           (0x7UL<<PWR_CR2_PLS_Pos)                          /*!< 0x0000000E */
#define PWR_CR2_PLS                               PWR_CR2_PLS_Msk
#define PWR_CR2_PLS_0                             (0x1UL<<PWR_CR2_PLS_Pos)                          /*!< 0x00000002 */
#define PWR_CR2_PLS_1                             (0x2UL<<PWR_CR2_PLS_Pos)                          /*!< 0x00000004 */
#define PWR_CR2_PLS_2                             (0x4UL<<PWR_CR2_PLS_Pos)                          /*!< 0x00000008 */

/*!< PVD level configuration */
/* #define PWR_CR2_PLS_LEV0                          0x00000000U */                                      /*!< PVD level 1.8V */
/* #define PWR_CR2_PLS_LEV1                          0x00000002U */                                      /*!< PVD level 2.0V */
/* #define PWR_CR2_PLS_LEV2                          0x00000004U */                                      /*!< PVD level 2.2V */
#define PWR_CR2_PLS_LEV3                          0x00000006U                                       /*!< PVD level 2.4V */
#define PWR_CR2_PLS_LEV4                          0x00000008U                                       /*!< PVD level 2.6V */
#define PWR_CR2_PLS_LEV5                          0x0000000AU                                       /*!< PVD level 2.8V */
#define PWR_CR2_PLS_LEV6                          0x0000000CU                                       /*!< PVD level 3.0V */
#define PWR_CR2_PLS_LEV7                          0x0000000EU

