Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/********************************* Bit definition for ESMC_XCR3 register ********************************************/
#define ESMC_XCR3_ADDR8BIT_Pos                    (0U)
#define ESMC_XCR3_ADDR8BIT_Msk                    (0x1UL<<ESMC_XCR3_ADDR8BIT_Pos)                   /*!< 0x00000001 */
#define ESMC_XCR3_ADDR8BIT                        ESMC_XCR3_ADDR8BIT_Msk                            /*!< xip read 8bit address */
#define ESMC_XCR3_ADDR16BIT_Pos                   (1U)
#define ESMC_XCR3_ADDR16BIT_Msk                   (0x1UL<<ESMC_XCR3_ADDR16BIT_Pos)                  /*!< 0x00000002 */
#define ESMC_XCR3_ADDR16BIT                       ESMC_XCR3_ADDR16BIT_Msk                           /*!< xip read 16bit address */
#define ESMC_XCR3_ADDR32BIT_Pos                   (2U)
#define ESMC_XCR3_ADDR32BIT_Msk                   (0x1UL<<ESMC_XCR3_ADDR32BIT_Pos)                  /*!< 0x00000004 */
#define ESMC_XCR3_ADDR32BIT                       ESMC_XCR3_ADDR32BIT_Msk                           /*!< xip read 32bit address */
#define ESMC_XCR3_NO_ADDR_Pos                     (3U)
#define ESMC_XCR3_NO_ADDR_Msk                     (0x1UL<<ESMC_XCR3_NO_ADDR_Pos)                    /*!< 0x00000008 */
#define ESMC_XCR3_NO_ADDR                         ESMC_XCR3_NO_ADDR_Msk                             /*!< xip read no address enable */
#define ESMC_XCR3_XSPI_RWDS_Pos                   (4U)
#define ESMC_XCR3_XSPI_RWDS_Msk                   (0x1UL<<ESMC_XCR3_XSPI_RWDS_Pos)                  /*!< 0x00000010 */
#define ESMC_XCR3_XSPI_RWDS                       ESMC_XCR3_XSPI_RWDS_Msk                           /*!< xip read xSPI RWDS enable */
#define ESMC_XCR3_CMD_EXT_Pos                     (5U)
#define ESMC_XCR3_CMD_EXT_Msk                     (0x1UL<<ESMC_XCR3_CMD_EXT_Pos)                    /*!< 0x00000020 */
#define ESMC_XCR3_CMD_EXT                         ESMC_XCR3_CMD_EXT_Msk                             /*!< xip read command extend enable */

/********************************* Bit definition for ESMC_XMODE register *******************************************/
#define ESMC_XMODE_XMODE_Pos                      (0U)
#define ESMC_XMODE_XMODE_Msk                      (0xFFUL<<ESMC_XMODE_XMODE_Pos)                    /*!< 0x000000FF */
#define ESMC_XMODE_XMODE                          ESMC_XMODE_XMODE_Msk                              /*!< xip send modereg */

/********************************* Bit definition for ESMC_XMODE_WE register ****************************************/
#define ESMC_XMODE_WE_XMODE_WE_Pos                (0U)
#define ESMC_XMODE_WE_XMODE_WE_Msk                (0xFFUL<<ESMC_XMODE_WE_XMODE_WE_Pos)              /*!< 0x000000FF */
#define ESMC_XMODE_WE_XMODE_WE                    ESMC_XMODE_WE_XMODE_WE_Msk                        /*!< xip send modereg_we */

/********************************* Bit definition for ESMC_XSSOCR register ******************************************/
#define ESMC_XSSOCR_SSXO_Pos                      (0U)
#define ESMC_XSSOCR_SSXO_Msk                      (0x3FUL<<ESMC_XSSOCR_SSXO_Pos)                    /*!< 0x0000003F */
#define ESMC_XSSOCR_SSXO                          ESMC_XSSOCR_SSXO_Msk                              /*!< xip read Slave select enable */
#define ESMC_XSSOCR_SSXO_0                        (0x1UL<<ESMC_XSSOCR_SSXO_Pos)                     /*!< 0x00000001 */
#define ESMC_XSSOCR_SSXO_1                        (0x2UL<<ESMC_XSSOCR_SSXO_Pos)                     /*!< 0x00000002 */
#define ESMC_XSSOCR_SSXO_2                        (0x4UL<<ESMC_XSSOCR_SSXO_Pos)                     /*!< 0x00000004 */
#define ESMC_XSSOCR_SSXO_3                        (0x8UL<<ESMC_XSSOCR_SSXO_Pos)                     /*!< 0x00000008 */
#define ESMC_XSSOCR_SSXO_4                        (0x10UL<<ESMC_XSSOCR_SSXO_Pos)                    /*!< 0x00000010 */
#define ESMC_XSSOCR_SSXO_5                        (0x20UL<<ESMC_XSSOCR_SSXO_Pos)                    /*!< 0x00000020 */
#define ESMC_XSSOCR_SS_CLR_RQ_Pos                 (6U)
#define ESMC_XSSOCR_SS_CLR_RQ_Msk                 (0x1UL<<ESMC_XSSOCR_SS_CLR_RQ_Pos)                /*!< 0x00000040 */
#define ESMC_XSSOCR_SS_CLR_RQ                     ESMC_XSSOCR_SS_CLR_RQ_Msk                         /*!< xip read Slave select clear */

/********************************* Bit definition for ESMC_XSSOCR_WE register ***************************************/
#define ESMC_XSSOCR_WE_SSXO_Pos                   (0U)
#define ESMC_XSSOCR_WE_SSXO_Msk                   (0x3FUL<<ESMC_XSSOCR_WE_SSXO_Pos)                 /*!< 0x0000003F */
#define ESMC_XSSOCR_WE_SSXO                       ESMC_XSSOCR_WE_SSXO_Msk                           /*!< xip write Slave select enable */
#define ESMC_XSSOCR_WE_SSXO_0                     (0x1UL<<ESMC_XSSOCR_WE_SSXO_Pos)                  /*!< 0x00000001 */
#define ESMC_XSSOCR_WE_SSXO_1                     (0x2UL<<ESMC_XSSOCR_WE_SSXO_Pos)                  /*!< 0x00000002 */
#define ESMC_XSSOCR_WE_SSXO_2                     (0x4UL<<ESMC_XSSOCR_WE_SSXO_Pos)                  /*!< 0x00000004 */
#define ESMC_XSSOCR_WE_SSXO_3                     (0x8UL<<ESMC_XSSOCR_WE_SSXO_Pos)                  /*!< 0x00000008 */
#define ESMC_XSSOCR_WE_SSXO_4                     (0x10UL<<ESMC_XSSOCR_WE_SSXO_Pos)                 /*!< 0x00000010 */
#define ESMC_XSSOCR_WE_SSXO_5                     (0x20UL<<ESMC_XSSOCR_WE_SSXO_Pos)                 /*!< 0x00000020 */
#define ESMC_XSSOCR_WE_SS_CLR_RQ_Pos              (6U)
#define ESMC_XSSOCR_WE_SS_CLR_RQ_Msk              (0x1UL<<ESMC_XSSOCR_WE_SS_CLR_RQ_Pos)             /*!< 0x00000040 */
#define ESMC_XSSOCR_WE_SS_CLR_RQ                  ESMC_XSSOCR_WE_SS_CLR_RQ_Msk                      /*!< xip write Slave select clear */

/********************************* Bit definition for ESMC_XSFCR_WE register ****************************************/
#define ESMC_XSFCR_WE_XINS_WE_Pos                 (0U)
#define ESMC_XSFCR_WE_XINS_WE_Msk                 (0xFFUL<<ESMC_XSFCR_WE_XINS_WE_Pos)               /*!< 0x000000FF */
#define ESMC_XSFCR_WE_XINS_WE                     ESMC_XSFCR_WE_XINS_WE_Msk                         /*!< XIP write command */

