Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/********************************* Bit definition for ESMC_XSOCR_WE register ****************************************/
#define ESMC_XSOCR_WE_SPI_MODE_Pos                (0U)
#define ESMC_XSOCR_WE_SPI_MODE_Msk                (0x3UL<<ESMC_XSOCR_WE_SPI_MODE_Pos)               /*!< 0x00000003 */
#define ESMC_XSOCR_WE_SPI_MODE                    ESMC_XSOCR_WE_SPI_MODE_Msk                        /*!< xip write spi mode */
#define ESMC_XSOCR_WE_SPI_MODE_0                  (0x1UL<<ESMC_XSOCR_WE_SPI_MODE_Pos)               /*!< 0x00000001 */
#define ESMC_XSOCR_WE_SPI_MODE_1                  (0x2UL<<ESMC_XSOCR_WE_SPI_MODE_Pos)               /*!< 0x00000002 */
#define ESMC_XSOCR_WE_SEND_M_Pos                  (2U)
#define ESMC_XSOCR_WE_SEND_M_Msk                  (0x1UL<<ESMC_XSOCR_WE_SEND_M_Pos)                 /*!< 0x00000004 */
#define ESMC_XSOCR_WE_SEND_M                      ESMC_XSOCR_WE_SEND_M_Msk                          /*!< xip write send mode enable */
#define ESMC_XSOCR_WE_MULTICMD_Pos                (3U)
#define ESMC_XSOCR_WE_MULTICMD_Msk                (0x1UL<<ESMC_XSOCR_WE_MULTICMD_Pos)               /*!< 0x00000008 */
#define ESMC_XSOCR_WE_MULTICMD                    ESMC_XSOCR_WE_MULTICMD_Msk                        /*!< xip write muti command  */
#define ESMC_XSOCR_WE_MULTIADDR_Pos               (4U)
#define ESMC_XSOCR_WE_MULTIADDR_Msk               (0x1UL<<ESMC_XSOCR_WE_MULTIADDR_Pos)              /*!< 0x00000010 */
#define ESMC_XSOCR_WE_MULTIADDR                   ESMC_XSOCR_WE_MULTIADDR_Msk                       /*!< xip write muti address */
#define ESMC_XSOCR_WE_DDRCMD_Pos                  (5U)
#define ESMC_XSOCR_WE_DDRCMD_Msk                  (0x1UL<<ESMC_XSOCR_WE_DDRCMD_Pos)                 /*!< 0x00000020 */
#define ESMC_XSOCR_WE_DDRCMD                      ESMC_XSOCR_WE_DDRCMD_Msk                          /*!< xip write ddr command */
#define ESMC_XSOCR_WE_DDRADDR_Pos                 (6U)
#define ESMC_XSOCR_WE_DDRADDR_Msk                 (0x1UL<<ESMC_XSOCR_WE_DDRADDR_Pos)                /*!< 0x00000040 */
#define ESMC_XSOCR_WE_DDRADDR                     ESMC_XSOCR_WE_DDRADDR_Msk                         /*!< xip write ddr address */
#define ESMC_XSOCR_WE_DDRDATA_Pos                 (7U)
#define ESMC_XSOCR_WE_DDRDATA_Msk                 (0x1UL<<ESMC_XSOCR_WE_DDRDATA_Pos)                /*!< 0x00000080 */
#define ESMC_XSOCR_WE_DDRDATA                     ESMC_XSOCR_WE_DDRDATA_Msk                         /*!< xip write ddr data */

/********************************* Bit definition for ESMC_XDCR_WE register *****************************************/
#define ESMC_XDCR_WE_XDUMMY_Pos                   (0U)
#define ESMC_XDCR_WE_XDUMMY_Msk                   (0x3FUL<<ESMC_XDCR_WE_XDUMMY_Pos)                 /*!< 0x0000003F */
#define ESMC_XDCR_WE_XDUMMY                       ESMC_XDCR_WE_XDUMMY_Msk                           /*!< xip write dummy cycle set */
#define ESMC_XDCR_WE_XDUMMY_0                     (0x1UL<<ESMC_XDCR_WE_XDUMMY_Pos)                  /*!< 0x00000001 */
#define ESMC_XDCR_WE_XDUMMY_1                     (0x2UL<<ESMC_XDCR_WE_XDUMMY_Pos)                  /*!< 0x00000002 */
#define ESMC_XDCR_WE_XDUMMY_2                     (0x4UL<<ESMC_XDCR_WE_XDUMMY_Pos)                  /*!< 0x00000004 */
#define ESMC_XDCR_WE_XDUMMY_3                     (0x8UL<<ESMC_XDCR_WE_XDUMMY_Pos)                  /*!< 0x00000008 */
#define ESMC_XDCR_WE_XDUMMY_4                     (0x10UL<<ESMC_XDCR_WE_XDUMMY_Pos)                 /*!< 0x00000010 */
#define ESMC_XDCR_WE_XDUMMY_5                     (0x20UL<<ESMC_XDCR_WE_XDUMMY_Pos)                 /*!< 0x00000020 */
#define ESMC_XDCR_WE_NO_CMD_Pos                   (6U)
#define ESMC_XDCR_WE_NO_CMD_Msk                   (0x1UL<<ESMC_XDCR_WE_NO_CMD_Pos)                  /*!< 0x00000040 */
#define ESMC_XDCR_WE_NO_CMD                       ESMC_XDCR_WE_NO_CMD_Msk                           /*!< xip write no command  */

/********************************* Bit definition for ESMC_XCR3_WE register *****************************************/
#define ESMC_XCR3_WE_ADDR8BIT_Pos                 (0U)
#define ESMC_XCR3_WE_ADDR8BIT_Msk                 (0x1UL<<ESMC_XCR3_WE_ADDR8BIT_Pos)                /*!< 0x00000001 */
#define ESMC_XCR3_WE_ADDR8BIT                     ESMC_XCR3_WE_ADDR8BIT_Msk                         /*!< xip write 8bit address */
#define ESMC_XCR3_WE_ADDR16BIT_Pos                (1U)
#define ESMC_XCR3_WE_ADDR16BIT_Msk                (0x1UL<<ESMC_XCR3_WE_ADDR16BIT_Pos)               /*!< 0x00000002 */
#define ESMC_XCR3_WE_ADDR16BIT                    ESMC_XCR3_WE_ADDR16BIT_Msk                        /*!< xip write 16bit address */
#define ESMC_XCR3_WE_ADDR32BIT_Pos                (2U)
#define ESMC_XCR3_WE_ADDR32BIT_Msk                (0x1UL<<ESMC_XCR3_WE_ADDR32BIT_Pos)               /*!< 0x00000004 */
#define ESMC_XCR3_WE_ADDR32BIT                    ESMC_XCR3_WE_ADDR32BIT_Msk                        /*!< xip write 32bit address */
#define ESMC_XCR3_WE_NO_ADDR_Pos                  (3U)
#define ESMC_XCR3_WE_NO_ADDR_Msk                  (0x1UL<<ESMC_XCR3_WE_NO_ADDR_Pos)                 /*!< 0x00000008 */
#define ESMC_XCR3_WE_NO_ADDR                      ESMC_XCR3_WE_NO_ADDR_Msk                          /*!< xip write no address enable */
#define ESMC_XCR3_WE_XSPI_RWDS_Pos                (4U)
#define ESMC_XCR3_WE_XSPI_RWDS_Msk                (0x1UL<<ESMC_XCR3_WE_XSPI_RWDS_Pos)               /*!< 0x00000010 */
#define ESMC_XCR3_WE_XSPI_RWDS                    ESMC_XCR3_WE_XSPI_RWDS_Msk                        /*!< xip write xSPI RWDS enable */
#define ESMC_XCR3_WE_CMD_EXT_Pos                  (5U)
#define ESMC_XCR3_WE_CMD_EXT_Msk                  (0x1UL<<ESMC_XCR3_WE_CMD_EXT_Pos)                 /*!< 0x00000020 */
#define ESMC_XCR3_WE_CMD_EXT                      ESMC_XCR3_WE_CMD_EXT_Msk                          /*!< xip write command extend enable */

/********************************* Bit definition for ESMC_BCR register *********************************************/
#define ESMC_BCR_BCR_Pos                          (0U)
#define ESMC_BCR_BCR_Msk                          (0xFFFFFFFFUL<<ESMC_BCR_BCR_Pos)                  /*!< 0xFFFFFFFF */
#define ESMC_BCR_BCR                              ESMC_BCR_BCR_Msk                                  /*!< bit control register */

/********************************* Bit definition for ESMC_RXTOUT register ******************************************/
#define ESMC_RXTOUT_RXTOUT_Pos                    (0U)
#define ESMC_RXTOUT_RXTOUT_Msk                    (0xFFUL<<ESMC_RXTOUT_RXTOUT_Pos)                  /*!< 0x000000FF */
#define ESMC_RXTOUT_RXTOUT                        ESMC_RXTOUT_RXTOUT_Msk                            /*!< rx timeout */

/********************************* Bit definition for ESMC_XSTRR register *******************************************/
#define ESMC_XSTRR_XSMP_Pos                       (0U)
#define ESMC_XSTRR_XSMP_Msk                       (0x3FUL<<ESMC_XSTRR_XSMP_Pos)                     /*!< 0x0000003F */
#define ESMC_XSTRR_XSMP                           ESMC_XSTRR_XSMP_Msk                               /*!< xip sample sample */
#define ESMC_XSTRR_XSMP_0                         (0x1UL<<ESMC_XSTRR_XSMP_Pos)                      /*!< 0x00000001 */
#define ESMC_XSTRR_XSMP_1                         (0x2UL<<ESMC_XSTRR_XSMP_Pos)                      /*!< 0x00000002 */
#define ESMC_XSTRR_XSMP_2                         (0x4UL<<ESMC_XSTRR_XSMP_Pos)                      /*!< 0x00000004 */
#define ESMC_XSTRR_XSMP_3                         (0x8UL<<ESMC_XSTRR_XSMP_Pos)                      /*!< 0x00000008 */
#define ESMC_XSTRR_XSMP_4                         (0x10UL<<ESMC_XSTRR_XSMP_Pos)                     /*!< 0x00000010 */
#define ESMC_XSTRR_XSMP_5                         (0x20UL<<ESMC_XSTRR_XSMP_Pos)                     /*!< 0x00000020 */

