Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/********************************* Bit definition for RCC_APB1RSTR1 register ****************************************/
#define RCC_APB1RSTR1_TIM2RST_Pos                 (0U)
#define RCC_APB1RSTR1_TIM2RST_Msk                 (0x1UL<<RCC_APB1RSTR1_TIM2RST_Pos)                /*!< 0x00000001 */
#define RCC_APB1RSTR1_TIM2RST                     RCC_APB1RSTR1_TIM2RST_Msk                         
#define RCC_APB1RSTR1_TIM3RST_Pos                 (1U)
#define RCC_APB1RSTR1_TIM3RST_Msk                 (0x1UL<<RCC_APB1RSTR1_TIM3RST_Pos)                /*!< 0x00000002 */
#define RCC_APB1RSTR1_TIM3RST                     RCC_APB1RSTR1_TIM3RST_Msk                         
#define RCC_APB1RSTR1_TIM4RST_Pos                 (2U)
#define RCC_APB1RSTR1_TIM4RST_Msk                 (0x1UL<<RCC_APB1RSTR1_TIM4RST_Pos)                /*!< 0x00000004 */
#define RCC_APB1RSTR1_TIM4RST                     RCC_APB1RSTR1_TIM4RST_Msk                         
#define RCC_APB1RSTR1_TIM5RST_Pos                 (3U)
#define RCC_APB1RSTR1_TIM5RST_Msk                 (0x1UL<<RCC_APB1RSTR1_TIM5RST_Pos)                /*!< 0x00000008 */
#define RCC_APB1RSTR1_TIM5RST                     RCC_APB1RSTR1_TIM5RST_Msk                         
#define RCC_APB1RSTR1_TIM6RST_Pos                 (4U)
#define RCC_APB1RSTR1_TIM6RST_Msk                 (0x1UL<<RCC_APB1RSTR1_TIM6RST_Pos)                /*!< 0x00000010 */
#define RCC_APB1RSTR1_TIM6RST                     RCC_APB1RSTR1_TIM6RST_Msk                         
#define RCC_APB1RSTR1_TIM7RST_Pos                 (5U)
#define RCC_APB1RSTR1_TIM7RST_Msk                 (0x1UL<<RCC_APB1RSTR1_TIM7RST_Pos)                /*!< 0x00000020 */
#define RCC_APB1RSTR1_TIM7RST                     RCC_APB1RSTR1_TIM7RST_Msk                         
#define RCC_APB1RSTR1_TIM12RST_Pos                (6U)
#define RCC_APB1RSTR1_TIM12RST_Msk                (0x1UL<<RCC_APB1RSTR1_TIM12RST_Pos)               /*!< 0x00000040 */
#define RCC_APB1RSTR1_TIM12RST                    RCC_APB1RSTR1_TIM12RST_Msk                        
#define RCC_APB1RSTR1_TIM13RST_Pos                (7U)
#define RCC_APB1RSTR1_TIM13RST_Msk                (0x1UL<<RCC_APB1RSTR1_TIM13RST_Pos)               /*!< 0x00000080 */
#define RCC_APB1RSTR1_TIM13RST                    RCC_APB1RSTR1_TIM13RST_Msk                        
#define RCC_APB1RSTR1_TIM14RST_Pos                (8U)
#define RCC_APB1RSTR1_TIM14RST_Msk                (0x1UL<<RCC_APB1RSTR1_TIM14RST_Pos)               /*!< 0x00000100 */
#define RCC_APB1RSTR1_TIM14RST                    RCC_APB1RSTR1_TIM14RST_Msk                        
#define RCC_APB1RSTR1_TIM18RST_Pos                (9U)
#define RCC_APB1RSTR1_TIM18RST_Msk                (0x1UL<<RCC_APB1RSTR1_TIM18RST_Pos)               /*!< 0x00000200 */
#define RCC_APB1RSTR1_TIM18RST                    RCC_APB1RSTR1_TIM18RST_Msk                        
#define RCC_APB1RSTR1_WWDGRST_Pos                 (11U)
#define RCC_APB1RSTR1_WWDGRST_Msk                 (0x1UL<<RCC_APB1RSTR1_WWDGRST_Pos)                /*!< 0x00000800 */
#define RCC_APB1RSTR1_WWDGRST                     RCC_APB1RSTR1_WWDGRST_Msk                         
#define RCC_APB1RSTR1_SPI2RST_Pos                 (14U)
#define RCC_APB1RSTR1_SPI2RST_Msk                 (0x1UL<<RCC_APB1RSTR1_SPI2RST_Pos)                /*!< 0x00004000 */
#define RCC_APB1RSTR1_SPI2RST                     RCC_APB1RSTR1_SPI2RST_Msk                         
#define RCC_APB1RSTR1_SPI3RST_Pos                 (15U)
#define RCC_APB1RSTR1_SPI3RST_Msk                 (0x1UL<<RCC_APB1RSTR1_SPI3RST_Pos)                /*!< 0x00008000 */
#define RCC_APB1RSTR1_SPI3RST                     RCC_APB1RSTR1_SPI3RST_Msk                         
#define RCC_APB1RSTR1_USART2RST_Pos               (17U)
#define RCC_APB1RSTR1_USART2RST_Msk               (0x1UL<<RCC_APB1RSTR1_USART2RST_Pos)              /*!< 0x00020000 */
#define RCC_APB1RSTR1_USART2RST                   RCC_APB1RSTR1_USART2RST_Msk                       
#define RCC_APB1RSTR1_USART3RST_Pos               (18U)
#define RCC_APB1RSTR1_USART3RST_Msk               (0x1UL<<RCC_APB1RSTR1_USART3RST_Pos)              /*!< 0x00040000 */
#define RCC_APB1RSTR1_USART3RST                   RCC_APB1RSTR1_USART3RST_Msk                       
#define RCC_APB1RSTR1_UART1RST_Pos                (19U)
#define RCC_APB1RSTR1_UART1RST_Msk                (0x1UL<<RCC_APB1RSTR1_UART1RST_Pos)               /*!< 0x00080000 */
#define RCC_APB1RSTR1_UART1RST                    RCC_APB1RSTR1_UART1RST_Msk                        
#define RCC_APB1RSTR1_UART2RST_Pos                (20U)
#define RCC_APB1RSTR1_UART2RST_Msk                (0x1UL<<RCC_APB1RSTR1_UART2RST_Pos)               /*!< 0x00100000 */
#define RCC_APB1RSTR1_UART2RST                    RCC_APB1RSTR1_UART2RST_Msk                        
#define RCC_APB1RSTR1_I2C1RST_Pos                 (21U)
#define RCC_APB1RSTR1_I2C1RST_Msk                 (0x1UL<<RCC_APB1RSTR1_I2C1RST_Pos)                /*!< 0x00200000 */
#define RCC_APB1RSTR1_I2C1RST                     RCC_APB1RSTR1_I2C1RST_Msk                         
#define RCC_APB1RSTR1_I2C2RST_Pos                 (22U)
#define RCC_APB1RSTR1_I2C2RST_Msk                 (0x1UL<<RCC_APB1RSTR1_I2C2RST_Pos)                /*!< 0x00400000 */
#define RCC_APB1RSTR1_I2C2RST                     RCC_APB1RSTR1_I2C2RST_Msk                         
#define RCC_APB1RSTR1_UART3RST_Pos                (23U)
#define RCC_APB1RSTR1_UART3RST_Msk                (0x1UL<<RCC_APB1RSTR1_UART3RST_Pos)               /*!< 0x00800000 */
#define RCC_APB1RSTR1_UART3RST                    RCC_APB1RSTR1_UART3RST_Msk                        
#define RCC_APB1RSTR1_CAN1RST_Pos                 (25U)
#define RCC_APB1RSTR1_CAN1RST_Msk                 (0x1UL<<RCC_APB1RSTR1_CAN1RST_Pos)                /*!< 0x02000000 */
#define RCC_APB1RSTR1_CAN1RST                     RCC_APB1RSTR1_CAN1RST_Msk                         
#define RCC_APB1RSTR1_CAN2RST_Pos                 (26U)
#define RCC_APB1RSTR1_CAN2RST_Msk                 (0x1UL<<RCC_APB1RSTR1_CAN2RST_Pos)                /*!< 0x04000000 */
#define RCC_APB1RSTR1_CAN2RST                     RCC_APB1RSTR1_CAN2RST_Msk                         
#define RCC_APB1RSTR1_PWRRST_Pos                  (28U)
#define RCC_APB1RSTR1_PWRRST_Msk                  (0x1UL<<RCC_APB1RSTR1_PWRRST_Pos)                 /*!< 0x10000000 */
#define RCC_APB1RSTR1_PWRRST                      RCC_APB1RSTR1_PWRRST_Msk                          
#define RCC_APB1RSTR1_DACRST_Pos                  (29U)
#define RCC_APB1RSTR1_DACRST_Msk                  (0x1UL<<RCC_APB1RSTR1_DACRST_Pos)                 /*!< 0x20000000 */
#define RCC_APB1RSTR1_DACRST                      RCC_APB1RSTR1_DACRST_Msk                          
#define RCC_APB1RSTR1_I2C3RST_Pos                 (30U)
#define RCC_APB1RSTR1_I2C3RST_Msk                 (0x1UL<<RCC_APB1RSTR1_I2C3RST_Pos)                /*!< 0x40000000 */
#define RCC_APB1RSTR1_I2C3RST                     RCC_APB1RSTR1_I2C3RST_Msk                         
#define RCC_APB1RSTR1_CTCRST_Pos                  (31U)
#define RCC_APB1RSTR1_CTCRST_Msk                  (0x1UL<<RCC_APB1RSTR1_CTCRST_Pos)                 /*!< 0x80000000 */
#define RCC_APB1RSTR1_CTCRST                      RCC_APB1RSTR1_CTCRST_Msk                          

/********************************* Bit definition for RCC_APB1RSTR2 register ****************************************/
#define RCC_APB1RSTR2_LPTIM1RST_Pos               (0U)
#define RCC_APB1RSTR2_LPTIM1RST_Msk               (0x1UL<<RCC_APB1RSTR2_LPTIM1RST_Pos)              /*!< 0x00000001 */
#define RCC_APB1RSTR2_LPTIM1RST                   RCC_APB1RSTR2_LPTIM1RST_Msk                       
#define RCC_APB1RSTR2_LPUART1RST_Pos              (1U)
#define RCC_APB1RSTR2_LPUART1RST_Msk              (0x1UL<<RCC_APB1RSTR2_LPUART1RST_Pos)             /*!< 0x00000002 */
#define RCC_APB1RSTR2_LPUART1RST                  RCC_APB1RSTR2_LPUART1RST_Msk                      
#define RCC_APB1RSTR2_I2C4RST_Pos                 (2U)
#define RCC_APB1RSTR2_I2C4RST_Msk                 (0x1UL<<RCC_APB1RSTR2_I2C4RST_Pos)                /*!< 0x00000004 */
#define RCC_APB1RSTR2_I2C4RST                     RCC_APB1RSTR2_I2C4RST_Msk                         

