Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/********************************* Bit definition for RCC_AHB2ENR register ******************************************/
#define RCC_AHB2ENR_IOPAEN_Pos                    (2U)
#define RCC_AHB2ENR_IOPAEN_Msk                    (0x1UL<<RCC_AHB2ENR_IOPAEN_Pos)                   /*!< 0x00000004 */
#define RCC_AHB2ENR_IOPAEN                        RCC_AHB2ENR_IOPAEN_Msk                            
#define RCC_AHB2ENR_IOPBEN_Pos                    (3U)
#define RCC_AHB2ENR_IOPBEN_Msk                    (0x1UL<<RCC_AHB2ENR_IOPBEN_Pos)                   /*!< 0x00000008 */
#define RCC_AHB2ENR_IOPBEN                        RCC_AHB2ENR_IOPBEN_Msk                            
#define RCC_AHB2ENR_IOPCEN_Pos                    (4U)
#define RCC_AHB2ENR_IOPCEN_Msk                    (0x1UL<<RCC_AHB2ENR_IOPCEN_Pos)                   /*!< 0x00000010 */
#define RCC_AHB2ENR_IOPCEN                        RCC_AHB2ENR_IOPCEN_Msk                            
#define RCC_AHB2ENR_IOPDEN_Pos                    (5U)
#define RCC_AHB2ENR_IOPDEN_Msk                    (0x1UL<<RCC_AHB2ENR_IOPDEN_Pos)                   /*!< 0x00000020 */
#define RCC_AHB2ENR_IOPDEN                        RCC_AHB2ENR_IOPDEN_Msk                            
#define RCC_AHB2ENR_IOPEEN_Pos                    (6U)
#define RCC_AHB2ENR_IOPEEN_Msk                    (0x1UL<<RCC_AHB2ENR_IOPEEN_Pos)                   /*!< 0x00000040 */
#define RCC_AHB2ENR_IOPEEN                        RCC_AHB2ENR_IOPEEN_Msk                            
#define RCC_AHB2ENR_IOPFEN_Pos                    (7U)
#define RCC_AHB2ENR_IOPFEN_Msk                    (0x1UL<<RCC_AHB2ENR_IOPFEN_Pos)                   /*!< 0x00000080 */
#define RCC_AHB2ENR_IOPFEN                        RCC_AHB2ENR_IOPFEN_Msk                            
#define RCC_AHB2ENR_SDIOEN_Pos                    (9U)
#define RCC_AHB2ENR_SDIOEN_Msk                    (0x1UL<<RCC_AHB2ENR_SDIOEN_Pos)                   /*!< 0x00000200 */
#define RCC_AHB2ENR_SDIOEN                        RCC_AHB2ENR_SDIOEN_Msk                            
#define RCC_AHB2ENR_AESEN_Pos                     (10U)
#define RCC_AHB2ENR_AESEN_Msk                     (0x1UL<<RCC_AHB2ENR_AESEN_Pos)                    /*!< 0x00000400 */
#define RCC_AHB2ENR_AESEN                         RCC_AHB2ENR_AESEN_Msk                             
#define RCC_AHB2ENR_USB1EN_Pos                    (13U)
#define RCC_AHB2ENR_USB1EN_Msk                    (0x1UL<<RCC_AHB2ENR_USB1EN_Pos)                   /*!< 0x00002000 */
#define RCC_AHB2ENR_USB1EN                        RCC_AHB2ENR_USB1EN_Msk                            
#define RCC_AHB2ENR_USB2EN_Pos                    (14U)
#define RCC_AHB2ENR_USB2EN_Msk                    (0x1UL<<RCC_AHB2ENR_USB2EN_Pos)                   /*!< 0x00004000 */
#define RCC_AHB2ENR_USB2EN                        RCC_AHB2ENR_USB2EN_Msk                            
#define RCC_AHB2ENR_ETHEN_Pos                     (15U)
#define RCC_AHB2ENR_ETHEN_Msk                     (0x1UL<<RCC_AHB2ENR_ETHEN_Pos)                    /*!< 0x00008000 */
#define RCC_AHB2ENR_ETHEN                         RCC_AHB2ENR_ETHEN_Msk                             
#define RCC_AHB2ENR_ETHTXEN_Pos                   (16U)
#define RCC_AHB2ENR_ETHTXEN_Msk                   (0x1UL<<RCC_AHB2ENR_ETHTXEN_Pos)                  /*!< 0x00010000 */
#define RCC_AHB2ENR_ETHTXEN                       RCC_AHB2ENR_ETHTXEN_Msk                           
#define RCC_AHB2ENR_ETHRXEN_Pos                   (17U)
#define RCC_AHB2ENR_ETHRXEN_Msk                   (0x1UL<<RCC_AHB2ENR_ETHRXEN_Pos)                  /*!< 0x00020000 */
#define RCC_AHB2ENR_ETHRXEN                       RCC_AHB2ENR_ETHRXEN_Msk                           

/********************************* Bit definition for RCC_APB1ENR1 register *****************************************/
#define RCC_APB1ENR1_TIM2EN_Pos                   (0U)
#define RCC_APB1ENR1_TIM2EN_Msk                   (0x1UL<<RCC_APB1ENR1_TIM2EN_Pos)                  /*!< 0x00000001 */
#define RCC_APB1ENR1_TIM2EN                       RCC_APB1ENR1_TIM2EN_Msk                           
#define RCC_APB1ENR1_TIM3EN_Pos                   (1U)
#define RCC_APB1ENR1_TIM3EN_Msk                   (0x1UL<<RCC_APB1ENR1_TIM3EN_Pos)                  /*!< 0x00000002 */
#define RCC_APB1ENR1_TIM3EN                       RCC_APB1ENR1_TIM3EN_Msk                           
#define RCC_APB1ENR1_TIM4EN_Pos                   (2U)
#define RCC_APB1ENR1_TIM4EN_Msk                   (0x1UL<<RCC_APB1ENR1_TIM4EN_Pos)                  /*!< 0x00000004 */
#define RCC_APB1ENR1_TIM4EN                       RCC_APB1ENR1_TIM4EN_Msk                           
#define RCC_APB1ENR1_TIM5EN_Pos                   (3U)
#define RCC_APB1ENR1_TIM5EN_Msk                   (0x1UL<<RCC_APB1ENR1_TIM5EN_Pos)                  /*!< 0x00000008 */
#define RCC_APB1ENR1_TIM5EN                       RCC_APB1ENR1_TIM5EN_Msk                           
#define RCC_APB1ENR1_TIM6EN_Pos                   (4U)
#define RCC_APB1ENR1_TIM6EN_Msk                   (0x1UL<<RCC_APB1ENR1_TIM6EN_Pos)                  /*!< 0x00000010 */
#define RCC_APB1ENR1_TIM6EN                       RCC_APB1ENR1_TIM6EN_Msk                           
#define RCC_APB1ENR1_TIM7EN_Pos                   (5U)
#define RCC_APB1ENR1_TIM7EN_Msk                   (0x1UL<<RCC_APB1ENR1_TIM7EN_Pos)                  /*!< 0x00000020 */
#define RCC_APB1ENR1_TIM7EN                       RCC_APB1ENR1_TIM7EN_Msk                           
#define RCC_APB1ENR1_TIM12EN_Pos                  (6U)
#define RCC_APB1ENR1_TIM12EN_Msk                  (0x1UL<<RCC_APB1ENR1_TIM12EN_Pos)                 /*!< 0x00000040 */
#define RCC_APB1ENR1_TIM12EN                      RCC_APB1ENR1_TIM12EN_Msk                          
#define RCC_APB1ENR1_TIM13EN_Pos                  (7U)
#define RCC_APB1ENR1_TIM13EN_Msk                  (0x1UL<<RCC_APB1ENR1_TIM13EN_Pos)                 /*!< 0x00000080 */
#define RCC_APB1ENR1_TIM13EN                      RCC_APB1ENR1_TIM13EN_Msk                          
#define RCC_APB1ENR1_TIM14EN_Pos                  (8U)
#define RCC_APB1ENR1_TIM14EN_Msk                  (0x1UL<<RCC_APB1ENR1_TIM14EN_Pos)                 /*!< 0x00000100 */
#define RCC_APB1ENR1_TIM14EN                      RCC_APB1ENR1_TIM14EN_Msk                          
#define RCC_APB1ENR1_TIM18EN_Pos                  (9U)
#define RCC_APB1ENR1_TIM18EN_Msk                  (0x1UL<<RCC_APB1ENR1_TIM18EN_Pos)                 /*!< 0x00000200 */
#define RCC_APB1ENR1_TIM18EN                      RCC_APB1ENR1_TIM18EN_Msk                          
#define RCC_APB1ENR1_WWDGEN_Pos                   (11U)
#define RCC_APB1ENR1_WWDGEN_Msk                   (0x1UL<<RCC_APB1ENR1_WWDGEN_Pos)                  /*!< 0x00000800 */
#define RCC_APB1ENR1_WWDGEN                       RCC_APB1ENR1_WWDGEN_Msk                           
#define RCC_APB1ENR1_SPI2EN_Pos                   (14U)
#define RCC_APB1ENR1_SPI2EN_Msk                   (0x1UL<<RCC_APB1ENR1_SPI2EN_Pos)                  /*!< 0x00004000 */
#define RCC_APB1ENR1_SPI2EN                       RCC_APB1ENR1_SPI2EN_Msk                           
#define RCC_APB1ENR1_SPI3EN_Pos                   (15U)
#define RCC_APB1ENR1_SPI3EN_Msk                   (0x1UL<<RCC_APB1ENR1_SPI3EN_Pos)                  /*!< 0x00008000 */
#define RCC_APB1ENR1_SPI3EN                       RCC_APB1ENR1_SPI3EN_Msk                           
#define RCC_APB1ENR1_USART2EN_Pos                 (17U)
#define RCC_APB1ENR1_USART2EN_Msk                 (0x1UL<<RCC_APB1ENR1_USART2EN_Pos)                /*!< 0x00020000 */
#define RCC_APB1ENR1_USART2EN                     RCC_APB1ENR1_USART2EN_Msk                         
#define RCC_APB1ENR1_USART3EN_Pos                 (18U)
#define RCC_APB1ENR1_USART3EN_Msk                 (0x1UL<<RCC_APB1ENR1_USART3EN_Pos)                /*!< 0x00040000 */
#define RCC_APB1ENR1_USART3EN                     RCC_APB1ENR1_USART3EN_Msk                         
#define RCC_APB1ENR1_UART1EN_Pos                  (19U)
#define RCC_APB1ENR1_UART1EN_Msk                  (0x1UL<<RCC_APB1ENR1_UART1EN_Pos)                 /*!< 0x00080000 */
#define RCC_APB1ENR1_UART1EN                      RCC_APB1ENR1_UART1EN_Msk                          
#define RCC_APB1ENR1_UART2EN_Pos                  (20U)
#define RCC_APB1ENR1_UART2EN_Msk                  (0x1UL<<RCC_APB1ENR1_UART2EN_Pos)                 /*!< 0x00100000 */
#define RCC_APB1ENR1_UART2EN                      RCC_APB1ENR1_UART2EN_Msk                          
#define RCC_APB1ENR1_I2C1EN_Pos                   (21U)
#define RCC_APB1ENR1_I2C1EN_Msk                   (0x1UL<<RCC_APB1ENR1_I2C1EN_Pos)                  /*!< 0x00200000 */
#define RCC_APB1ENR1_I2C1EN                       RCC_APB1ENR1_I2C1EN_Msk                           
#define RCC_APB1ENR1_I2C2EN_Pos                   (22U)
#define RCC_APB1ENR1_I2C2EN_Msk                   (0x1UL<<RCC_APB1ENR1_I2C2EN_Pos)                  /*!< 0x00400000 */
#define RCC_APB1ENR1_I2C2EN                       RCC_APB1ENR1_I2C2EN_Msk                           
#define RCC_APB1ENR1_UART3EN_Pos                  (23U)
#define RCC_APB1ENR1_UART3EN_Msk                  (0x1UL<<RCC_APB1ENR1_UART3EN_Pos)                 /*!< 0x00800000 */
#define RCC_APB1ENR1_UART3EN                      RCC_APB1ENR1_UART3EN_Msk                          
#define RCC_APB1ENR1_CAN1EN_Pos                   (25U)
#define RCC_APB1ENR1_CAN1EN_Msk                   (0x1UL<<RCC_APB1ENR1_CAN1EN_Pos)                  /*!< 0x02000000 */
#define RCC_APB1ENR1_CAN1EN                       RCC_APB1ENR1_CAN1EN_Msk                           
#define RCC_APB1ENR1_CAN2EN_Pos                   (26U)
#define RCC_APB1ENR1_CAN2EN_Msk                   (0x1UL<<RCC_APB1ENR1_CAN2EN_Pos)                  /*!< 0x04000000 */
#define RCC_APB1ENR1_CAN2EN                       RCC_APB1ENR1_CAN2EN_Msk                           
#define RCC_APB1ENR1_BKPEN_Pos                    (27U)
#define RCC_APB1ENR1_BKPEN_Msk                    (0x1UL<<RCC_APB1ENR1_BKPEN_Pos)                   /*!< 0x08000000 */
#define RCC_APB1ENR1_BKPEN                        RCC_APB1ENR1_BKPEN_Msk                            
#define RCC_APB1ENR1_PWREN_Pos                    (28U)
#define RCC_APB1ENR1_PWREN_Msk                    (0x1UL<<RCC_APB1ENR1_PWREN_Pos)                   /*!< 0x10000000 */
#define RCC_APB1ENR1_PWREN                        RCC_APB1ENR1_PWREN_Msk                            
#define RCC_APB1ENR1_DACEN_Pos                    (29U)
#define RCC_APB1ENR1_DACEN_Msk                    (0x1UL<<RCC_APB1ENR1_DACEN_Pos)                   /*!< 0x20000000 */
#define RCC_APB1ENR1_DACEN                        RCC_APB1ENR1_DACEN_Msk                            
#define RCC_APB1ENR1_I2C3EN_Pos                   (30U)
#define RCC_APB1ENR1_I2C3EN_Msk                   (0x1UL<<RCC_APB1ENR1_I2C3EN_Pos)                  /*!< 0x40000000 */
#define RCC_APB1ENR1_I2C3EN                       RCC_APB1ENR1_I2C3EN_Msk                           
#define RCC_APB1ENR1_CTCEN_Pos                    (31U)
#define RCC_APB1ENR1_CTCEN_Msk                    (0x1UL<<RCC_APB1ENR1_CTCEN_Pos)                   /*!< 0x80000000 */
#define RCC_APB1ENR1_CTCEN                        RCC_APB1ENR1_CTCEN_Msk                            

