Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
/********************************************************************************************************************/
/********************************* SYSCFG ***************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for SYSCFG_CFGR1 register *****************************************/
#define SYSCFG_CFGR1_MEM_MODE_Pos                 (0U)
#define SYSCFG_CFGR1_MEM_MODE_Msk                 (0x3UL<<SYSCFG_CFGR1_MEM_MODE_Pos)                /*!< 0x00000003 */
#define SYSCFG_CFGR1_MEM_MODE                     SYSCFG_CFGR1_MEM_MODE_Msk                         /*!< memory mapping mode */
#define SYSCFG_CFGR1_MEM_MODE_0                   (0x1UL<<SYSCFG_CFGR1_MEM_MODE_Pos)                /*!< 0x00000001 */
#define SYSCFG_CFGR1_MEM_MODE_1                   (0x2UL<<SYSCFG_CFGR1_MEM_MODE_Pos)                /*!< 0x00000002 */
#define SYSCFG_CFGR1_ETH_PHYSEL_Pos               (2U)
#define SYSCFG_CFGR1_ETH_PHYSEL_Msk               (0x1UL<<SYSCFG_CFGR1_ETH_PHYSEL_Pos)              /*!< 0x00000004 */
#define SYSCFG_CFGR1_ETH_PHYSEL                   SYSCFG_CFGR1_ETH_PHYSEL_Msk                       /*!< Ethernet PHY Interface selection */
#define SYSCFG_CFGR1_TIM2ITR1_REMAP_Pos           (3U)
#define SYSCFG_CFGR1_TIM2ITR1_REMAP_Msk           (0x3UL<<SYSCFG_CFGR1_TIM2ITR1_REMAP_Pos)          /*!< 0x00000018 */
#define SYSCFG_CFGR1_TIM2ITR1_REMAP               SYSCFG_CFGR1_TIM2ITR1_REMAP_Msk                   /*!< timer2 inner trigger input 1 mapping */
#define SYSCFG_CFGR1_TIM2ITR1_REMAP_0             (0x1UL<<SYSCFG_CFGR1_TIM2ITR1_REMAP_Pos)          /*!< 0x00000008 */
#define SYSCFG_CFGR1_TIM2ITR1_REMAP_1             (0x2UL<<SYSCFG_CFGR1_TIM2ITR1_REMAP_Pos)          /*!< 0x00000010 */
#define SYSCFG_CFGR1_PTP_PPS_REMAP_Pos            (5U)
#define SYSCFG_CFGR1_PTP_PPS_REMAP_Msk            (0x1UL<<SYSCFG_CFGR1_PTP_PPS_REMAP_Pos)           /*!< 0x00000020 */
#define SYSCFG_CFGR1_PTP_PPS_REMAP                SYSCFG_CFGR1_PTP_PPS_REMAP_Msk                    /*!< ETH PTP PPS mapping */
#define SYSCFG_CFGR1_CTC_SOF_SEL_Pos              (6U)
#define SYSCFG_CFGR1_CTC_SOF_SEL_Msk              (0x1UL<<SYSCFG_CFGR1_CTC_SOF_SEL_Pos)             /*!< 0x00000040 */
#define SYSCFG_CFGR1_CTC_SOF_SEL                  SYSCFG_CFGR1_CTC_SOF_SEL_Msk                      /*!< selection of usb sof to ctc */
#define SYSCFG_CFGR1_I2C1_FMP_Pos                 (7U)
#define SYSCFG_CFGR1_I2C1_FMP_Msk                 (0x1UL<<SYSCFG_CFGR1_I2C1_FMP_Pos)                /*!< 0x00000080 */
#define SYSCFG_CFGR1_I2C1_FMP                     SYSCFG_CFGR1_I2C1_FMP_Msk                         /*!< I2C1 Fast-mode Plus driving capability activation */
#define SYSCFG_CFGR1_I2C2_FMP_Pos                 (8U)
#define SYSCFG_CFGR1_I2C2_FMP_Msk                 (0x1UL<<SYSCFG_CFGR1_I2C2_FMP_Pos)                /*!< 0x00000100 */
#define SYSCFG_CFGR1_I2C2_FMP                     SYSCFG_CFGR1_I2C2_FMP_Msk                         /*!< I2C2 Fast-mode Plus driving capability activation */
#define SYSCFG_CFGR1_I2C3_FMP_Pos                 (9U)
#define SYSCFG_CFGR1_I2C3_FMP_Msk                 (0x1UL<<SYSCFG_CFGR1_I2C3_FMP_Pos)                /*!< 0x00000200 */
#define SYSCFG_CFGR1_I2C3_FMP                     SYSCFG_CFGR1_I2C3_FMP_Msk                         /*!< I2C3 Fast-mode Plus driving capability activation */
#define SYSCFG_CFGR1_I2C4_FMP_Pos                 (10U)
#define SYSCFG_CFGR1_I2C4_FMP_Msk                 (0x1UL<<SYSCFG_CFGR1_I2C4_FMP_Pos)                /*!< 0x00000400 */
#define SYSCFG_CFGR1_I2C4_FMP                     SYSCFG_CFGR1_I2C4_FMP_Msk                         /*!< I2C4 Fast-mode Plus driving capability activation */
#define SYSCFG_CFGR1_I2C_EIIC_Pos                 (16U)
#define SYSCFG_CFGR1_I2C_EIIC_Msk                 (0xFFFFUL<<SYSCFG_CFGR1_I2C_EIIC_Pos)             /*!< 0xFFFF0000 */
#define SYSCFG_CFGR1_I2C_EIIC                     SYSCFG_CFGR1_I2C_EIIC_Msk                         /*!< I2C analog filter enable */
#define SYSCFG_CFGR1_I2C_EIIC_0                   (0x1UL << SYSCFG_CFGR1_I2C_EIIC_Pos)              /*!< 0x00010000 */
#define SYSCFG_CFGR1_I2C_EIIC_1                   (0x2UL << SYSCFG_CFGR1_I2C_EIIC_Pos)              /*!< 0x00020000 */
#define SYSCFG_CFGR1_I2C_EIIC_2                   (0x4UL << SYSCFG_CFGR1_I2C_EIIC_Pos)              /*!< 0x00040000 */
#define SYSCFG_CFGR1_I2C_EIIC_3                   (0x8UL << SYSCFG_CFGR1_I2C_EIIC_Pos)              /*!< 0x00080000 */
#define SYSCFG_CFGR1_I2C_EIIC_4                   (0x10UL << SYSCFG_CFGR1_I2C_EIIC_Pos)             /*!< 0x00100000 */
#define SYSCFG_CFGR1_I2C_EIIC_5                   (0x20UL << SYSCFG_CFGR1_I2C_EIIC_Pos)             /*!< 0x00200000 */
#define SYSCFG_CFGR1_I2C_EIIC_6                   (0x40UL << SYSCFG_CFGR1_I2C_EIIC_Pos)             /*!< 0x00400000 */
#define SYSCFG_CFGR1_I2C_EIIC_7                   (0x80UL << SYSCFG_CFGR1_I2C_EIIC_Pos)             /*!< 0x00800000 */
#define SYSCFG_CFGR1_I2C_EIIC_8                   (0x100UL << SYSCFG_CFGR1_I2C_EIIC_Pos)            /*!< 0x01000000 */
#define SYSCFG_CFGR1_I2C_EIIC_9                   (0x200UL << SYSCFG_CFGR1_I2C_EIIC_Pos)            /*!< 0x02000000 */
#define SYSCFG_CFGR1_I2C_EIIC_10                  (0x400UL << SYSCFG_CFGR1_I2C_EIIC_Pos)            /*!< 0x04000000 */
#define SYSCFG_CFGR1_I2C_EIIC_11                  (0x800UL << SYSCFG_CFGR1_I2C_EIIC_Pos)            /*!< 0x08000000 */
#define SYSCFG_CFGR1_I2C_EIIC_12                  (0x1000UL << SYSCFG_CFGR1_I2C_EIIC_Pos)           /*!< 0x10000000 */
#define SYSCFG_CFGR1_I2C_EIIC_13                  (0x2000UL << SYSCFG_CFGR1_I2C_EIIC_Pos)           /*!< 0x20000000 */
#define SYSCFG_CFGR1_I2C_EIIC_14                  (0x4000UL << SYSCFG_CFGR1_I2C_EIIC_Pos)           /*!< 0x40000000 */
#define SYSCFG_CFGR1_I2C_EIIC_15                  (0x8000UL << SYSCFG_CFGR1_I2C_EIIC_Pos)           /*!< 0x80000000 */
                                                                                                   
/********************************* Bit definition for SYSCFG_CFGR2 register *****************************************/
#define SYSCFG_CFGR2_CLL_Pos                      (0U)
#define SYSCFG_CFGR2_CLL_Msk                      (0x1UL<<SYSCFG_CFGR2_CLL_Pos)                     /*!< 0x00000001 */
#define SYSCFG_CFGR2_CLL                          SYSCFG_CFGR2_CLL_Msk                              /*!< core lockup enable */
#define SYSCFG_CFGR2_SPL_Pos                      (1U)
#define SYSCFG_CFGR2_SPL_Msk                      (0x1UL<<SYSCFG_CFGR2_SPL_Pos)                     /*!< 0x00000002 */
#define SYSCFG_CFGR2_SPL                          SYSCFG_CFGR2_SPL_Msk                              /*!< sram parity lock enable */
#define SYSCFG_CFGR2_PVDL_Pos                     (2U)
#define SYSCFG_CFGR2_PVDL_Msk                     (0x1UL<<SYSCFG_CFGR2_PVDL_Pos)                    /*!< 0x00000004 */
#define SYSCFG_CFGR2_PVDL                         SYSCFG_CFGR2_PVDL_Msk                             /*!< pvd lock enable */
#define SYSCFG_CFGR2_ECCL_Pos                     (3U)
#define SYSCFG_CFGR2_ECCL_Msk                     (0x1UL<<SYSCFG_CFGR2_ECCL_Pos)                    /*!< 0x00000008 */
#define SYSCFG_CFGR2_ECCL                         SYSCFG_CFGR2_ECCL_Msk                             /*!< ecc lock */
#define SYSCFG_CFGR2_SPF_Pos                      (8U)
#define SYSCFG_CFGR2_SPF_Msk                      (0x1UL<<SYSCFG_CFGR2_SPF_Pos)                     /*!< 0x00000100 */
#define SYSCFG_CFGR2_SPF                          SYSCFG_CFGR2_SPF_Msk                              /*!< SRAM parity flag */                   

