Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xD.h
#define SYSCFG_CFGR5_DMA2_MAP6_Pos                 (24U)
#define SYSCFG_CFGR5_DMA2_MAP6_Msk                 (0x7FUL << SYSCFG_CFGR5_DMA2_MAP6_Pos)             /*!< 0x7F000000 */
#define SYSCFG_CFGR5_DMA2_MAP6                     SYSCFG_CFGR5_DMA2_MAP6_Msk                         /*!< DMA2 ch6 mapping */
#define SYSCFG_CFGR5_DMA2_MAP6_0                   (0x1UL << SYSCFG_CFGR5_DMA2_MAP6_Pos)              /*!< 0x01000000 */
#define SYSCFG_CFGR5_DMA2_MAP6_1                   (0x2UL << SYSCFG_CFGR5_DMA2_MAP6_Pos)              /*!< 0x02000000 */
#define SYSCFG_CFGR5_DMA2_MAP6_2                   (0x4UL << SYSCFG_CFGR5_DMA2_MAP6_Pos)              /*!< 0x04000000 */
#define SYSCFG_CFGR5_DMA2_MAP6_3                   (0x8UL << SYSCFG_CFGR5_DMA2_MAP6_Pos)              /*!< 0x08000000 */
#define SYSCFG_CFGR5_DMA2_MAP6_4                   (0x10UL << SYSCFG_CFGR5_DMA2_MAP6_Pos)             /*!< 0x10000000 */
#define SYSCFG_CFGR5_DMA2_MAP6_5                   (0x20UL << SYSCFG_CFGR5_DMA2_MAP6_Pos)             /*!< 0x20000000 */
#define SYSCFG_CFGR5_DMA2_MAP6_6                   (0x40UL << SYSCFG_CFGR5_DMA2_MAP6_Pos)             /*!< 0x40000000 */

/********************************* Bit definition for SYSCFG_EXTICR1 register ***************************************/
#define SYSCFG_EXTICR1_EXTI0_Pos                  (0U)
#define SYSCFG_EXTICR1_EXTI0_Msk                  (0xFUL<<SYSCFG_EXTICR1_EXTI0_Pos)                 /*!< 0x0000000F */
#define SYSCFG_EXTICR1_EXTI0                      SYSCFG_EXTICR1_EXTI0_Msk
#define SYSCFG_EXTICR1_EXTI0_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI0_Pos)                 /*!< 0x00000001 */
#define SYSCFG_EXTICR1_EXTI0_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI0_Pos)                 /*!< 0x00000002 */
#define SYSCFG_EXTICR1_EXTI0_2                    (0x4UL<<SYSCFG_EXTICR1_EXTI0_Pos)                 /*!< 0x00000004 */
#define SYSCFG_EXTICR1_EXTI0_3                    (0x8UL<<SYSCFG_EXTICR1_EXTI0_Pos)                 /*!< 0x00000008 */
#define SYSCFG_EXTICR1_EXTI1_Pos                  (4U)
#define SYSCFG_EXTICR1_EXTI1_Msk                  (0xFUL<<SYSCFG_EXTICR1_EXTI1_Pos)                 /*!< 0x000000F0 */
#define SYSCFG_EXTICR1_EXTI1                      SYSCFG_EXTICR1_EXTI1_Msk
#define SYSCFG_EXTICR1_EXTI1_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI1_Pos)                 /*!< 0x00000010 */
#define SYSCFG_EXTICR1_EXTI1_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI1_Pos)                 /*!< 0x00000020 */
#define SYSCFG_EXTICR1_EXTI1_2                    (0x4UL<<SYSCFG_EXTICR1_EXTI1_Pos)                 /*!< 0x00000040 */
#define SYSCFG_EXTICR1_EXTI1_3                    (0x8UL<<SYSCFG_EXTICR1_EXTI1_Pos)                 /*!< 0x00000080 */
#define SYSCFG_EXTICR1_EXTI2_Pos                  (8U)
#define SYSCFG_EXTICR1_EXTI2_Msk                  (0xFUL<<SYSCFG_EXTICR1_EXTI2_Pos)                 /*!< 0x00000F00 */
#define SYSCFG_EXTICR1_EXTI2                      SYSCFG_EXTICR1_EXTI2_Msk
#define SYSCFG_EXTICR1_EXTI2_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI2_Pos)                 /*!< 0x00000100 */
#define SYSCFG_EXTICR1_EXTI2_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI2_Pos)                 /*!< 0x00000200 */
#define SYSCFG_EXTICR1_EXTI2_2                    (0x4UL<<SYSCFG_EXTICR1_EXTI2_Pos)                 /*!< 0x00000400 */
#define SYSCFG_EXTICR1_EXTI2_3                    (0x8UL<<SYSCFG_EXTICR1_EXTI2_Pos)                 /*!< 0x00000800 */
#define SYSCFG_EXTICR1_EXTI3_Pos                  (12U)
#define SYSCFG_EXTICR1_EXTI3_Msk                  (0xFUL<<SYSCFG_EXTICR1_EXTI3_Pos)                 /*!< 0x0000F000 */
#define SYSCFG_EXTICR1_EXTI3                      SYSCFG_EXTICR1_EXTI3_Msk                          /*!< EXTI 0~3 configuration */
#define SYSCFG_EXTICR1_EXTI3_0                    (0x1UL<<SYSCFG_EXTICR1_EXTI3_Pos)                 /*!< 0x00001000 */
#define SYSCFG_EXTICR1_EXTI3_1                    (0x2UL<<SYSCFG_EXTICR1_EXTI3_Pos)                 /*!< 0x00002000 */
#define SYSCFG_EXTICR1_EXTI3_2                    (0x4UL<<SYSCFG_EXTICR1_EXTI3_Pos)                 /*!< 0x00004000 */
#define SYSCFG_EXTICR1_EXTI3_3                    (0x8UL<<SYSCFG_EXTICR1_EXTI3_Pos)                 /*!< 0x00008000 */

/********************************* Bit definition for SYSCFG_EXTICR2 register ***************************************/
#define SYSCFG_EXTICR2_EXTI4_Pos                  (0U)
#define SYSCFG_EXTICR2_EXTI4_Msk                  (0xFUL<<SYSCFG_EXTICR2_EXTI4_Pos)                 /*!< 0x0000000F */
#define SYSCFG_EXTICR2_EXTI4                      SYSCFG_EXTICR2_EXTI4_Msk
#define SYSCFG_EXTICR2_EXTI4_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI4_Pos)                 /*!< 0x00000001 */
#define SYSCFG_EXTICR2_EXTI4_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI4_Pos)                 /*!< 0x00000002 */
#define SYSCFG_EXTICR2_EXTI4_2                    (0x4UL<<SYSCFG_EXTICR2_EXTI4_Pos)                 /*!< 0x00000004 */
#define SYSCFG_EXTICR2_EXTI4_3                    (0x8UL<<SYSCFG_EXTICR2_EXTI4_Pos)                 /*!< 0x00000008 */
#define SYSCFG_EXTICR2_EXTI5_Pos                  (4U)
#define SYSCFG_EXTICR2_EXTI5_Msk                  (0xFUL<<SYSCFG_EXTICR2_EXTI5_Pos)                 /*!< 0x000000F0 */
#define SYSCFG_EXTICR2_EXTI5                      SYSCFG_EXTICR2_EXTI5_Msk
#define SYSCFG_EXTICR2_EXTI5_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI5_Pos)                 /*!< 0x00000010 */
#define SYSCFG_EXTICR2_EXTI5_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI5_Pos)                 /*!< 0x00000020 */
#define SYSCFG_EXTICR2_EXTI5_2                    (0x4UL<<SYSCFG_EXTICR2_EXTI5_Pos)                 /*!< 0x00000040 */
#define SYSCFG_EXTICR2_EXTI5_3                    (0x8UL<<SYSCFG_EXTICR2_EXTI5_Pos)                 /*!< 0x00000080 */
#define SYSCFG_EXTICR2_EXTI6_Pos                  (8U)
#define SYSCFG_EXTICR2_EXTI6_Msk                  (0xFUL<<SYSCFG_EXTICR2_EXTI6_Pos)                 /*!< 0x00000F00 */
#define SYSCFG_EXTICR2_EXTI6                      SYSCFG_EXTICR2_EXTI6_Msk
#define SYSCFG_EXTICR2_EXTI6_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI6_Pos)                 /*!< 0x00000100 */
#define SYSCFG_EXTICR2_EXTI6_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI6_Pos)                 /*!< 0x00000200 */
#define SYSCFG_EXTICR2_EXTI6_2                    (0x4UL<<SYSCFG_EXTICR2_EXTI6_Pos)                 /*!< 0x00000400 */
#define SYSCFG_EXTICR2_EXTI6_3                    (0x8UL<<SYSCFG_EXTICR2_EXTI6_Pos)                 /*!< 0x00000800 */
#define SYSCFG_EXTICR2_EXTI7_Pos                  (12U)
#define SYSCFG_EXTICR2_EXTI7_Msk                  (0xFUL<<SYSCFG_EXTICR2_EXTI7_Pos)                 /*!< 0x0000F000 */
#define SYSCFG_EXTICR2_EXTI7                      SYSCFG_EXTICR2_EXTI7_Msk                          /*!< EXTI 4~7 configuration */
#define SYSCFG_EXTICR2_EXTI7_0                    (0x1UL<<SYSCFG_EXTICR2_EXTI7_Pos)                 /*!< 0x00001000 */
#define SYSCFG_EXTICR2_EXTI7_1                    (0x2UL<<SYSCFG_EXTICR2_EXTI7_Pos)                 /*!< 0x00002000 */
#define SYSCFG_EXTICR2_EXTI7_2                    (0x4UL<<SYSCFG_EXTICR2_EXTI7_Pos)                 /*!< 0x00004000 */
#define SYSCFG_EXTICR2_EXTI7_3                    (0x8UL<<SYSCFG_EXTICR2_EXTI7_Pos)                 /*!< 0x00008000 */

/********************************* Bit definition for SYSCFG_EXTICR3 register ***************************************/
#define SYSCFG_EXTICR3_EXTI8_Pos                  (0U)
#define SYSCFG_EXTICR3_EXTI8_Msk                  (0xFUL<<SYSCFG_EXTICR3_EXTI8_Pos)                 /*!< 0x0000000F */
#define SYSCFG_EXTICR3_EXTI8                      SYSCFG_EXTICR3_EXTI8_Msk
#define SYSCFG_EXTICR3_EXTI8_0                    (0x1UL<<SYSCFG_EXTICR3_EXTI8_Pos)                 /*!< 0x00000001 */
#define SYSCFG_EXTICR3_EXTI8_1                    (0x2UL<<SYSCFG_EXTICR3_EXTI8_Pos)                 /*!< 0x00000002 */
#define SYSCFG_EXTICR3_EXTI8_2                    (0x4UL<<SYSCFG_EXTICR3_EXTI8_Pos)                 /*!< 0x00000004 */
#define SYSCFG_EXTICR3_EXTI8_3                    (0x8UL<<SYSCFG_EXTICR3_EXTI8_Pos)                 /*!< 0x00000008 */
#define SYSCFG_EXTICR3_EXTI9_Pos                  (4U)
#define SYSCFG_EXTICR3_EXTI9_Msk                  (0xFUL<<SYSCFG_EXTICR3_EXTI9_Pos)                 /*!< 0x000000F0 */
#define SYSCFG_EXTICR3_EXTI9                      SYSCFG_EXTICR3_EXTI9_Msk
#define SYSCFG_EXTICR3_EXTI9_0                    (0x1UL<<SYSCFG_EXTICR3_EXTI9_Pos)                 /*!< 0x00000010 */
#define SYSCFG_EXTICR3_EXTI9_1                    (0x2UL<<SYSCFG_EXTICR3_EXTI9_Pos)                 /*!< 0x00000020 */
#define SYSCFG_EXTICR3_EXTI9_2                    (0x4UL<<SYSCFG_EXTICR3_EXTI9_Pos)                 /*!< 0x00000040 */
#define SYSCFG_EXTICR3_EXTI9_3                    (0x8UL<<SYSCFG_EXTICR3_EXTI9_Pos)                 /*!< 0x00000080 */
#define SYSCFG_EXTICR3_EXTI10_Pos                 (8U)
#define SYSCFG_EXTICR3_EXTI10_Msk                 (0xFUL<<SYSCFG_EXTICR3_EXTI10_Pos)                /*!< 0x00000F00 */
#define SYSCFG_EXTICR3_EXTI10                     SYSCFG_EXTICR3_EXTI10_Msk
#define SYSCFG_EXTICR3_EXTI10_0                   (0x1UL<<SYSCFG_EXTICR3_EXTI10_Pos)                /*!< 0x00000100 */
#define SYSCFG_EXTICR3_EXTI10_1                   (0x2UL<<SYSCFG_EXTICR3_EXTI10_Pos)                /*!< 0x00000200 */
#define SYSCFG_EXTICR3_EXTI10_2                   (0x4UL<<SYSCFG_EXTICR3_EXTI10_Pos)                /*!< 0x00000400 */
#define SYSCFG_EXTICR3_EXTI10_3                   (0x8UL<<SYSCFG_EXTICR3_EXTI10_Pos)                /*!< 0x00000800 */
#define SYSCFG_EXTICR3_EXTI11_Pos                 (12U)
#define SYSCFG_EXTICR3_EXTI11_Msk                 (0xFUL<<SYSCFG_EXTICR3_EXTI11_Pos)                /*!< 0x0000F000 */
#define SYSCFG_EXTICR3_EXTI11                     SYSCFG_EXTICR3_EXTI11_Msk                         /*!< EXTI 8~11 configuration */
#define SYSCFG_EXTICR3_EXTI11_0                   (0x1UL<<SYSCFG_EXTICR3_EXTI11_Pos)                /*!< 0x00001000 */
#define SYSCFG_EXTICR3_EXTI11_1                   (0x2UL<<SYSCFG_EXTICR3_EXTI11_Pos)                /*!< 0x00002000 */
#define SYSCFG_EXTICR3_EXTI11_2                   (0x4UL<<SYSCFG_EXTICR3_EXTI11_Pos)                /*!< 0x00004000 */
#define SYSCFG_EXTICR3_EXTI11_3                   (0x8UL<<SYSCFG_EXTICR3_EXTI11_Pos)                /*!< 0x00008000 */

/********************************* Bit definition for SYSCFG_EXTICR4 register ***************************************/
#define SYSCFG_EXTICR4_EXTI12_Pos                 (0U)
#define SYSCFG_EXTICR4_EXTI12_Msk                 (0xFUL<<SYSCFG_EXTICR4_EXTI12_Pos)                /*!< 0x0000000F */
#define SYSCFG_EXTICR4_EXTI12                     SYSCFG_EXTICR4_EXTI12_Msk
#define SYSCFG_EXTICR4_EXTI12_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI12_Pos)                /*!< 0x00000001 */
#define SYSCFG_EXTICR4_EXTI12_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI12_Pos)                /*!< 0x00000002 */
#define SYSCFG_EXTICR4_EXTI12_2                   (0x4UL<<SYSCFG_EXTICR4_EXTI12_Pos)                /*!< 0x00000004 */
#define SYSCFG_EXTICR4_EXTI12_3                   (0x8UL<<SYSCFG_EXTICR4_EXTI12_Pos)                /*!< 0x00000008 */
#define SYSCFG_EXTICR4_EXTI13_Pos                 (4U)
#define SYSCFG_EXTICR4_EXTI13_Msk                 (0xFUL<<SYSCFG_EXTICR4_EXTI13_Pos)                /*!< 0x000000F0 */
#define SYSCFG_EXTICR4_EXTI13                     SYSCFG_EXTICR4_EXTI13_Msk
#define SYSCFG_EXTICR4_EXTI13_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI13_Pos)                /*!< 0x00000010 */
#define SYSCFG_EXTICR4_EXTI13_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI13_Pos)                /*!< 0x00000020 */
#define SYSCFG_EXTICR4_EXTI13_2                   (0x4UL<<SYSCFG_EXTICR4_EXTI13_Pos)                /*!< 0x00000040 */
#define SYSCFG_EXTICR4_EXTI13_3                   (0x8UL<<SYSCFG_EXTICR4_EXTI13_Pos)                /*!< 0x00000080 */
#define SYSCFG_EXTICR4_EXTI14_Pos                 (8U)
#define SYSCFG_EXTICR4_EXTI14_Msk                 (0xFUL<<SYSCFG_EXTICR4_EXTI14_Pos)                /*!< 0x00000F00 */
#define SYSCFG_EXTICR4_EXTI14                     SYSCFG_EXTICR4_EXTI14_Msk
#define SYSCFG_EXTICR4_EXTI14_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI14_Pos)                /*!< 0x00000100 */
#define SYSCFG_EXTICR4_EXTI14_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI14_Pos)                /*!< 0x00000200 */
#define SYSCFG_EXTICR4_EXTI14_2                   (0x4UL<<SYSCFG_EXTICR4_EXTI14_Pos)                /*!< 0x00000400 */
#define SYSCFG_EXTICR4_EXTI14_3                   (0x8UL<<SYSCFG_EXTICR4_EXTI14_Pos)                /*!< 0x00000800 */
#define SYSCFG_EXTICR4_EXTI15_Pos                 (12U)
#define SYSCFG_EXTICR4_EXTI15_Msk                 (0xFUL<<SYSCFG_EXTICR4_EXTI15_Pos)                /*!< 0x0000F000 */
#define SYSCFG_EXTICR4_EXTI15                     SYSCFG_EXTICR4_EXTI15_Msk                         /*!< EXTI 12~15 configuration */
#define SYSCFG_EXTICR4_EXTI15_0                   (0x1UL<<SYSCFG_EXTICR4_EXTI15_Pos)                /*!< 0x00001000 */
#define SYSCFG_EXTICR4_EXTI15_1                   (0x2UL<<SYSCFG_EXTICR4_EXTI15_Pos)                /*!< 0x00002000 */
#define SYSCFG_EXTICR4_EXTI15_2                   (0x4UL<<SYSCFG_EXTICR4_EXTI15_Pos)                /*!< 0x00004000 */
#define SYSCFG_EXTICR4_EXTI15_3                   (0x8UL<<SYSCFG_EXTICR4_EXTI15_Pos)                /*!< 0x00008000 */

/********************************* Bit definition for PA_ENS register ***********************************************/
#define SYSCFG_PAENS_PA_ENS_Pos                         (0U)
#define SYSCFG_PAENS_PA_ENS_Msk                         (0xFFFFUL<<SYSCFG_PAENS_PA_ENS_Pos)                     /*!< 0x0000FFFF */
#define SYSCFG_PAENS_PA_ENS                             SYSCFG_PAENS_PA_ENS_Msk                                 /*!< GPIOA noise filter enable */

/********************************* Bit definition for PB_ENS register ***********************************************/
#define SYSCFG_PBENS_PB_ENS_Pos                         (0U)
#define SYSCFG_PBENS_PB_ENS_Msk                         (0xFFFFUL<<SYSCFG_PBENS_PB_ENS_Pos)                     /*!< 0x0000FFFF */
#define SYSCFG_PBENS_PB_ENS                             SYSCFG_PBENS_PB_ENS_Msk                                 /*!< GPIOB noise filter enable */

/********************************* Bit definition for PC_ENS register ***********************************************/
#define SYSCFG_PCENS_PC_ENS_Pos                         (0U)
#define SYSCFG_PCENS_PC_ENS_Msk                         (0xFFFFUL<<SYSCFG_PCENS_PC_ENS_Pos)                     /*!< 0x0000FFFF */
#define SYSCFG_PCENS_PC_ENS                             SYSCFG_PCENS_PC_ENS_Msk                                 /*!< GPIOC noise filter enable */

/********************************* Bit definition for PD_ENS register ***********************************************/
#define SYSCFG_PDENS_PD_ENS_Pos                         (0U)
#define SYSCFG_PDENS_PD_ENS_Msk                         (0xFFFFUL<<SYSCFG_PDENS_PD_ENS_Pos)                     /*!< 0x0000FFFF */
#define SYSCFG_PDENS_PD_ENS                             SYSCFG_PDENS_PD_ENS_Msk                                 /*!< GPIOD noise filter enable */

/********************************* Bit definition for PE_ENS register ***********************************************/
#define SYSCFG_PEENS_PE_ENS_Pos                         (0U)
#define SYSCFG_PEENS_PE_ENS_Msk                         (0xFFFFUL<<SYSCFG_PEENS_PE_ENS_Pos)                     /*!< 0x0000FFFF */
#define SYSCFG_PEENS_PE_ENS                             SYSCFG_PEENS_PE_ENS_Msk                                 /*!< GPIOE noise filter enable */

/********************************* Bit definition for PF_ENS register ***********************************************/
#define SYSCFG_PFENS_PF_ENS_Pos                         (0U)
#define SYSCFG_PFENS_PF_ENS_Msk                         (0x3FUL<<SYSCFG_PFENS_PF_ENS_Pos)                       /*!< 0x0000003F */
#define SYSCFG_PFENS_PF_ENS                             SYSCFG_PFENS_PF_ENS_Msk                                 /*!< GPIOF noise filter enable */
#define SYSCFG_PFENS_PF_ENS_0                           (0x1UL<<SYSCFG_PFENS_PF_ENS_Pos)                        /*!< 0x00000001 */
#define SYSCFG_PFENS_PF_ENS_1                           (0x2UL<<SYSCFG_PFENS_PF_ENS_Pos)                        /*!< 0x00000002 */
#define SYSCFG_PFENS_PF_ENS_2                           (0x4UL<<SYSCFG_PFENS_PF_ENS_Pos)                        /*!< 0x00000004 */
#define SYSCFG_PFENS_PF_ENS_3                           (0x8UL<<SYSCFG_PFENS_PF_ENS_Pos)                        /*!< 0x00000008 */
#define SYSCFG_PFENS_PF_ENS_4                           (0x10UL<<SYSCFG_PFENS_PF_ENS_Pos)                       /*!< 0x00000010 */
#define SYSCFG_PFENS_PF_ENS_5                           (0x20UL<<SYSCFG_PFENS_PF_ENS_Pos)                       /*!< 0x00000020 */

/********************************* Bit definition for PA_ANA2ENR register *******************************************/
#define SYSCFG_PAANA2ENR_PA0_ENA2_Pos                   (0U)
#define SYSCFG_PAANA2ENR_PA0_ENA2_Msk                   (0x1UL<<SYSCFG_PAANA2ENR_PA0_ENA2_Pos)                  /*!< 0x00000001 */
#define SYSCFG_PAANA2ENR_PA0_ENA2                       SYSCFG_PAANA2ENR_PA0_ENA2_Msk                           /*!< GPIOA0 ANA2 enable */
#define SYSCFG_PAANA2ENR_PA1_ENA2_Pos                   (1U)
#define SYSCFG_PAANA2ENR_PA1_ENA2_Msk                   (0x1UL<<SYSCFG_PAANA2ENR_PA1_ENA2_Pos)                  /*!< 0x00000002 */
#define SYSCFG_PAANA2ENR_PA1_ENA2                       SYSCFG_PAANA2ENR_PA1_ENA2_Msk                           /*!< GPIOA1 ANA2 enable */
#define SYSCFG_PAANA2ENR_PA2_ENA2_Pos                   (2U)
#define SYSCFG_PAANA2ENR_PA2_ENA2_Msk                   (0x1UL<<SYSCFG_PAANA2ENR_PA2_ENA2_Pos)                  /*!< 0x00000004 */
#define SYSCFG_PAANA2ENR_PA2_ENA2                       SYSCFG_PAANA2ENR_PA2_ENA2_Msk                           /*!< GPIOA2 ANA2 enable */
#define SYSCFG_PAANA2ENR_PA3_ENA2_Pos                   (3U)
#define SYSCFG_PAANA2ENR_PA3_ENA2_Msk                   (0x1UL<<SYSCFG_PAANA2ENR_PA3_ENA2_Pos)                  /*!< 0x00000008 */
#define SYSCFG_PAANA2ENR_PA3_ENA2                       SYSCFG_PAANA2ENR_PA3_ENA2_Msk                           /*!< GPIOA3 ANA2 enable */
#define SYSCFG_PAANA2ENR_PA4_ENA2_Pos                   (4U)
#define SYSCFG_PAANA2ENR_PA4_ENA2_Msk                   (0x1UL<<SYSCFG_PAANA2ENR_PA4_ENA2_Pos)                  /*!< 0x00000010 */
#define SYSCFG_PAANA2ENR_PA4_ENA2                       SYSCFG_PAANA2ENR_PA4_ENA2_Msk                           /*!< GPIOA4 ANA2 enable */
#define SYSCFG_PAANA2ENR_PA5_ENA2_Pos                   (5U)
#define SYSCFG_PAANA2ENR_PA5_ENA2_Msk                   (0x1UL<<SYSCFG_PAANA2ENR_PA5_ENA2_Pos)                  /*!< 0x00000020 */
#define SYSCFG_PAANA2ENR_PA5_ENA2                       SYSCFG_PAANA2ENR_PA5_ENA2_Msk                           /*!< GPIOA5 ANA2 enable */
#define SYSCFG_PAANA2ENR_PA7_ENA2_Pos                   (7U)
#define SYSCFG_PAANA2ENR_PA7_ENA2_Msk                   (0x1UL<<SYSCFG_PAANA2ENR_PA7_ENA2_Pos)                  /*!< 0x00000080 */
#define SYSCFG_PAANA2ENR_PA7_ENA2                       SYSCFG_PAANA2ENR_PA7_ENA2_Msk                           /*!< GPIOA7 ANA2 enable */
#define SYSCFG_PAANA2ENR_PA10_ENA2_Pos                  (10U)
#define SYSCFG_PAANA2ENR_PA10_ENA2_Msk                  (0x1UL<<SYSCFG_PAANA2ENR_PA10_ENA2_Pos)                 /*!< 0x00000400 */
#define SYSCFG_PAANA2ENR_PA10_ENA2                      SYSCFG_PAANA2ENR_PA10_ENA2_Msk                          /*!< GPIOA10 ANA2 enable */

/********************************* Bit definition for PB_ANA2ENR register *******************************************/
#define SYSCFG_PBANA2ENR_PB0_ENA2_Pos                   (0U)
#define SYSCFG_PBANA2ENR_PB0_ENA2_Msk                   (0x1UL<<SYSCFG_PBANA2ENR_PB0_ENA2_Pos)                  /*!< 0x00000001 */
#define SYSCFG_PBANA2ENR_PB0_ENA2                       SYSCFG_PBANA2ENR_PB0_ENA2_Msk                           /*!< GPIOB0 ANA2 enable */
#define SYSCFG_PBANA2ENR_PB1_ENA2_Pos                   (1U)
#define SYSCFG_PBANA2ENR_PB1_ENA2_Msk                   (0x1UL<<SYSCFG_PBANA2ENR_PB1_ENA2_Pos)                  /*!< 0x00000002 */
#define SYSCFG_PBANA2ENR_PB1_ENA2                       SYSCFG_PBANA2ENR_PB1_ENA2_Msk                           /*!< GPIOB1 ANA2 enable */
#define SYSCFG_PBANA2ENR_PB2_ENA2_Pos                   (2U)
#define SYSCFG_PBANA2ENR_PB2_ENA2_Msk                   (0x1UL<<SYSCFG_PBANA2ENR_PB2_ENA2_Pos)                  /*!< 0x00000004 */
#define SYSCFG_PBANA2ENR_PB2_ENA2                       SYSCFG_PBANA2ENR_PB2_ENA2_Msk                           /*!< GPIOB2 ANA2 enable */

/********************************* Bit definition for PC_ANA2ENR register *******************************************/
#define SYSCFG_PCANA2ENR_PC0_ENA2_Pos                   (0U)
#define SYSCFG_PCANA2ENR_PC0_ENA2_Msk                   (0x1UL<<SYSCFG_PCANA2ENR_PC0_ENA2_Pos)                  /*!< 0x00000001 */
#define SYSCFG_PCANA2ENR_PC0_ENA2                       SYSCFG_PCANA2ENR_PC0_ENA2_Msk                           /*!< GPIOC0 ANA2 enable */
#define SYSCFG_PCANA2ENR_PC1_ENA2_Pos                   (1U)
#define SYSCFG_PCANA2ENR_PC1_ENA2_Msk                   (0x1UL<<SYSCFG_PCANA2ENR_PC1_ENA2_Pos)                  /*!< 0x00000002 */
#define SYSCFG_PCANA2ENR_PC1_ENA2                       SYSCFG_PCANA2ENR_PC1_ENA2_Msk                           /*!< GPIOC1 ANA2 enable */
#define SYSCFG_PCANA2ENR_PC2_ENA2_Pos                   (2U)
#define SYSCFG_PCANA2ENR_PC2_ENA2_Msk                   (0x1UL<<SYSCFG_PCANA2ENR_PC2_ENA2_Pos)                  /*!< 0x00000004 */
#define SYSCFG_PCANA2ENR_PC2_ENA2                       SYSCFG_PCANA2ENR_PC2_ENA2_Msk                           /*!< GPIOC2 ANA2 enable */
#define SYSCFG_PCANA2ENR_PC3_ENA2_Pos                   (3U)
#define SYSCFG_PCANA2ENR_PC3_ENA2_Msk                   (0x1UL<<SYSCFG_PCANA2ENR_PC3_ENA2_Pos)                  /*!< 0x00000008 */
#define SYSCFG_PCANA2ENR_PC3_ENA2                       SYSCFG_PCANA2ENR_PC3_ENA2_Msk                           /*!< GPIOC3 ANA2 enable */
#define SYSCFG_PCANA2ENR_PC14_ENA2_Pos                  (14U)
#define SYSCFG_PCANA2ENR_PC14_ENA2_Msk                  (0x1UL<<SYSCFG_PCANA2ENR_PC14_ENA2_Pos)                 /*!< 0x00004000 */
#define SYSCFG_PCANA2ENR_PC14_ENA2                      SYSCFG_PCANA2ENR_PC14_ENA2_Msk                          /*!< GPIOC14 ANA2 enable */
#define SYSCFG_PCANA2ENR_PC15_ENA2_Pos                  (15U)
#define SYSCFG_PCANA2ENR_PC15_ENA2_Msk                  (0x1UL<<SYSCFG_PCANA2ENR_PC15_ENA2_Pos)                 /*!< 0x00004000 */
#define SYSCFG_PCANA2ENR_PC15_ENA2                      SYSCFG_PCANA2ENR_PC15_ENA2_Msk                          /*!< GPIOC14 ANA2 enable */

